Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/c_sharp.po
Languages: it

source: C# for Device Developers
it: C# per gli sviluppatori del dispostivo

source: See `iot-csharp <https://github.com/IoT-Analytics/iot-csharp>`_ in GitHub
it: Consultare `iot-csharp <https://github.com/IoT-Analytics/iot-csharp>`_ in GitHub

source: Constructor
it: Costruttore

source: The constructor builds the client instance, and accepts arguments containing the following definitions:
it: Il costruttore crea l'istanza client e accetta argomenti che contengono le seguenti definizioni:

source: ``orgId`` - Your organization ID.
it: ``orgId`` - l'ID organizzazione.

source: ``deviceType`` - The type of your device.
it: ``deviceType`` - il tipo di dispositivo.

source: ``deviceId`` - The ID of your device.
it: ``deviceId`` - l'ID dispositivo.

source: ``auth-method`` - Method of authentication (the only value currently supported is "token").
it: ``auth-method`` - Metodo di autenticazione (il solo valore attualmente supportato è "token").

source: ``auth-token`` - API key token (required if auth-method is "token").
it: ``auth-token`` - token chiave API (richiesto se auth-method è "token").

source: If deviceId and deviceType are provided, the client will connect to the IoT Platform Quickstart, and default to an unregistered device. The argument lists creates definitions which are used to interact with the IoT Platform module.
it: Se vengono forniti DeviceId e deviceType, il client si connetterà a IoT Platform Quickstart e, per impostazione predefinita, ad un dispositivo non registrato. L'argomento lists crea le definizioni utilizzate per interagire con il modulo IoT Platform.

source: Publishing events
it: Pubblicazione degli eventi

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
it: Gli eventi sono il meccanismo tramite cui i dispositivi pubblicano i dati in IoT Platform. Il dispositivo controlla il contenuto dell'evento e assegna un nome per ogni evento inviato.

source: When an event is received by the IoT Platform the credentials of the connection on which the event was received are used to determine which device sent the event. With this architecture it is impossible for a device to impersonate another device.
it: Quando IoT Platform riceve un evento, vengono utilizzate le credenziali della connessione su cui si è ricevuto l'evento al fine di determinare quale dispositivo ha inviato l'evento. Con questa architettura è impossibile per un dispositivo impersonare un altro dispositivo.

source: Events can be published at any of the three `quality of service (QoS) levels <../mqtt.html#/qoslevels>`_, defined by the MQTT protocol. By default events will be published as QoS level 0.
it: Gli eventi possono essere pubblicati ad uno qualsiasi dei tre `livelli QoS (quality of service) <../mqtt.html#/qoslevels>`_, definiti dal protocollo MQTT. Per impostazione predefinita gli eventi verranno pubblicati al livello QoS 0.

source: Publish event using default quality of service
it: Pubblicare l'evento utilizzando il qos predefinito

source: Publish event using user-defined quality of service
it: Pubblicare l'evento utilizzando il qos definito dall'utente

source: Events can be published at higher MQTT quality of service levels, but events published at QoS levels above 0 may be slower then QoS 0 events, because of the extra confirmation of receipt used in QoS levels above 0.
it: Gli eventi possono essere pubblicati a livelli QoS MQTT più elevati, ma gli eventi pubblicati a livelli QoS al di sopra di 0 possono essere più lenti degli eventi QoS 0, a causa dell'ulteriore conferma di ricezione utilizzata nei livelli QoS superiori a 0.

source: Handling commands
it: Gestione dei comandi

source: When the device client connects, it automatically subscribes to any commands for this device. To process specific commands, you must register a command callback method.
it: Quando il client del dispositivo si connette, effettua automaticamente la sottoscrizione a qualsiasi comando per questo dispositivo. Per elaborare comandi specifici, è necessario registrare un metodo di callback del comando.
