Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/embedded_c.po
Languages: de, it

source: Embedded C for Device Developers
de: Embedded C für Geräteentwickler
it: Embedded C per gli sviluppatori del dispositivo

source: See `iotf-embeddedc <https://github.com/ibm-messaging/iotf-embeddedc>`_ on GitHub
de: Siehe `iotf-embeddedc <https://github.com/ibm-messaging/iotf-embeddedc>`_ in GitHub
it: Consultare `iotf-embeddedc <https://github.com/ibm-messaging/iotf-embeddedc>`_ on GitHub

source: Dependencies
de: Abhängigkeiten
it: Dipendenze

source: `Eclipse Paho Embedded C library <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - provides an MQTT C client library, check `here <http://www.eclipse.org/paho/clients/c/embedded/>`__ for more information.
de: `Eclipse Paho Embedded C-Bibliothek <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - stellt eine MQTT C-Clientbibliothek bereit. Weitere Informationen finden Sie hier: `<http://www.eclipse.org/paho/clients/c/embedded/>`__.
it: `Libreria C integrato Eclipse Paho <http://git.eclipse.org/c/paho/org.eclipse.paho.mqtt.embedded-c.git/>`__ - fornisce una libreria client C MQTT, per ulteriori informazioni andare `qui <http://www.eclipse.org/paho/clients/c/embedded/>`.

source: Installation
it: Installazione

source: To install the IoT Platform client library for Embedded C follow the instructions below.
de: Führen Sie zum Installieren der IoT Platform-Clientbibliothek für Embedded C die nachfolgenden Anweisungen aus.
it: Per installare la libreria client IoT Platform per Embedded C seguire le istruzioni di seguito riportate.

source: To install the latest version of the library, enter the following code in your command line.
de: Zur Installation der neuesten Version der Bibliothek geben Sie den folgenden Code in der Befehlszeile ein.
it: Per installare la versione più recente della libreria, immettere il seguente codice nella riga comandi.

source: Copy the Paho library .tar file that was downloaded in the previous step to the *lib* directory.
de: Kopieren Sie die TAR-Datei der Paho-Bibliothek, die im vorherigen TAR-Datei heruntergeladen wurde, in die Bibliothek *lib*.
it: Copiare il file .tar della libreria Paho che è stato scaricato nel passo precedente nella directory *lib*.

source: Extract the library file
de: Bibliotheksdatei extrahieren
it: Estrarre il file libreria

source: When downloaded, the client has the following file structure:
de: Nach dem Herunterladen hat der Client die folgenden Dateistruktur:
it: Una volta scaricato, il client ha la seguente struttura di file:

source: Initializing the Client Library
de: Clientbibliothek initialisieren
it: Inizializzazione della libreria client

source: After downloading the client library, it must be initialized and connected to the IoT Platform. There are 2 ways to initialize the IoT Platform Client Library for Embedded C:
de: Nach dem Herunterladen der Clientbibliothek muss diese initialisiert und mit IoT Platform verbunden werden. Zum Initialisieren der IoT Platform-Clientbibliothek für Embedded C stehen die beiden folgenden Möglichkeiten zur Verfügung:
it: Una volta eseguito il download della libreria client, è necessario inizializzarla e connetterla a IoT Platform. Per inizializzare la libreria client IoT Platform per Embedded C esistono due modi:

source: Passing as Parameters
de: Als Parameter übergeben
it: Tramite parametri

source: The 'initialize' function takes the following details to connect to the IoT Platform service:
de: Die Funktion 'initialize' übernimmt die folgenden Details zum Herstellen der Verbindung mit dem IoT Platform-Service:
it: La funzione 'initialize' assume i seguenti dettagli per connettersi al servizio IoT Platform:

source: client - Pointer to the *iotfclient*
de: client - Zeiger auf *iotfclient*
it: client - Puntatore su *iotfclient*

source: org - Your organization ID
de: org - Ihre Organisations-ID
it: org - L'ID organizzazione

source: type - The type of your device
de: type - Der Typ Ihres Geräts
it: type - Il tipo di dispositivo

source: id - The device ID
de: id - Die Geräte-ID
it: id - L'ID dispositivo

source: authmethod - Method of authentication (the only value currently supported is "token")
de: authmethod - Die Methode der Authentifizierung (der einzige derzeit unterstützte Wert ist "token").
it: authmethod - Il metodo di autenticazione (il solo valore attualmente supportato è "token")

source: authtoken - API key token (required if auth-method is "token")
de: authtoken - API-Schlüsseltoken (erforderlich, falls auth-method den Wert "token" hat).
it: authtoken - Il token chiave API (richiesto se authmethod è "token")

source: Using a Configuration File
de: Konfigurationsdatei verwenden
it: Tramite File di configurazione

source: You can also use a configuration file to initialize the Embedded C client library. The function 'initialize\_configfile' takes the configuration file path as a parameter.
de: Sie können auch eine Konfigurationsdatei verwenden, um die Embedded C-Clientbibliothek zu initialisieren. Die Funktion 'initialize\_configfile' übernimmt den Konfigurationsdateipfad als einen Parameter.
it: È anche possibile utilizzare un file di configurazione per inizializzare la libreria client C integrato. La funzione 'initialize\_configfile' utilizza il percorso del file di configurazione come parametro.

source: The configuration file must use the following format.
de: Die Konfigurationsdatei muss das folgende Format verwenden.
it: Il file di configurazione deve utilizzare il formato seguente.

source: Connecting to the Service
de: Herstellen der Verbindung zum Service
it: Connessione al servizio

source: After initializing the IoT Platform Embedded C client library, you can connect to the IoT Platform by calling the 'connectiotf' function.
de: Nach der Initialisierung der IoT Platform-Clientbibliothek für Embedded C können Sie die Verbindung zu IoT Platform herstellen, indem Sie die Funktion 'connectiotf' aufrufen.
it: Una volta inizializzata la libreria client IoT Platform Embedded C, è possibile connettersi a IoT Platform richiamando la funzione 'connectiotf'.

source: Handling commands
de: Befehle verarbeiten
it: Gestione dei comandi

source: When the device client connects, it automatically subscribes to any command for this device. To process specific commands you need to register a command callback function by calling the function 'setCommandHandler'. The commands are returned as:
de: Wenn der Geräteclient die Verbindung herstellt, subskribiert er automatisch jeden Befehl für dieses Gerät. Zum Verarbeiten bestimmter Befehle müssen Sie eine Callback-Funktion für Befehle registrieren; rufen Sie dazu die Funktion 'setCommandHandler' auf. Die Befehle werden wie folgt zurückgegeben:
it: Quando il client del dispositivo si connette, effettua automaticamente la sottoscrizione a qualsiasi comando per questo dispositivo. Per elaborare comandi specifici è necessario registrare una funzione di callback del comando richiamando la funzione 'setCommandHandler'. I comandi sono restituiti come:

source: commandName - name of the command invoked
de: commandName - Name des aufgerufenen Befehls
it: commandName - il nome del comando richiamato

source: format - e.g json, xml
de: format - z.B.: json, xml
it: format - il formato, ad es. json, xml

source: The 'yield' function must be called periodically to receive commands.
de: Die Funktion 'yield' muss in Abständen aufgerufen werden, um Befehl empfangen zu können.
it: La funzione 'yield' deve essere richiamata periodicamente per ricevere i comandi.

source: Publishing events
de: Ereignisse publizieren
it: Pubblicazione degli eventi

source: Events can be published by using:
de: Ereignisse können unter Verwendung von Folgendem publiziert werden:
it: Gli eventi possono essere pubblicati utilizzando:

source: eventType - Type of event to be published e.g status, gps
de: eventType - Der zu publizierende Ereignistyp, beispielsweise status, gps
it: eventType - Il tipo di evento da pubblicare, ad es. status, gps

source: eventFormat - Format of the event e.g json
de: eventFormat - Das Format des Ereignisses, beispielsweise json
it: eventFormat - Il formato dell'evento, ad es. json

source: data - Payload of the event
de: data - Nutzdaten des Ereignisses
it: data - Il payload dell'evento

source: QoS - qos for the publish event. Supported values : QOS0, QOS1, QOS2
de: QoS - qos für das Publizierungsereignis. Unterstützte Werte: QOS0, QOS1, QOS2
it: QoS - Il qos per l'evento pubblicato. Valori supportati: QOS0, QOS1, QOS2

source: Disconnect Client
de: Verbindung des Clients trennen
it: Disconnetti client

source: To disconnect the client and release the connections, run the following code snippet.
de: Um die Verbindung des Clients zu trennen und die Verbindungen freizugeben, führen Sie das folgende Code-Snippet aus.
it: Per disconnettere il client e rilasciare le connessioni, utilizzare il seguente frammento di codice.

source: Samples
de: Beispiele
it: Esempi

source: Sample device and application code is provided in `GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_.
de: Beispielgeräte- und -anwendungscodes finden Sie in `GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_.
it: Il codice applicazione e dispositivo di esempio è fornito in `GitHub <https://github.com/ibm-messaging/iotf-embeddedc/tree/master/samples>`_.
