Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/java_deviceManagement.po
Languages: it

source: Java Client Library - Managed Devices
it: Libreria client Java - Dispositivi gestiti

source: Introduction
it: Introduzione

source: This client library describes how to use devices with the Java ibmiotf client library. For help with getting started with this module, see `Java Client Library - Introduction <../java/javaintro.html>`__.
it: Questa libreria client descrive come utilizzare i dispositivi con la libreria client ibmiotf Java. Per una guida introduttiva per questo modulo, consultare `Libreria client Java - Introduzione <../java/javaintro.html>`__.

source: This section contains information on how devices can to the IoT Platform Device Management service using Java and perform device management operations like firmware update, location update, and diagnostics update.
it: Questa sezione contiene le informazioni sul modo in cui i dispositivi possono connettersi al servizio di gestione dispositivo di IoT Platform utilizzando Java ed eseguire le operazioni di gestione dispositivo come l'aggiornamento del firmware, l'aggiornamento dell'ubicazione e l'aggiornamento della diagnostica.

source: The Device section contains information on how devices can publish events and handle commands using the Java ibmiotf Client Library.
it: La sezione Dispositivo contiene informazioni su come i dispositivi possono pubblicare gli eventi e gestire i comandi utilizzando la libreria client ibmiotf Java.

source: The Applications section contains information on how applications can use the Java ibmiotf Client Library to interact with devices.
it: La sezione Applicazioni contiene informazioni su come le applicazioni possono utilizzare la libreria client ibmiotf Java per interagire con i dispositivi.

source: Device Management
it: Gestione dispositivo

source: The `device management <../reference/device_mgmt.html>`__ feature enhances the IoT Platform service with new capabilities for managing devices. Device management makes a distinction between managed and unmanaged devices:
it: La funzione di gestione dispositivo <../reference/device_mgmt.html>`__ migliora il servizio IoT Platform con nuove funzionalità per la gestione dei dispositivi. La gestione dispositivo effettua una distinzione tra i dispositivi gestiti e non gestiti:

source: **Managed Devices** are defined as devices which have a management agent installed. The management agent sends and receives device metadata and responds to device management commands from the IoT Platform.
it: **Dispositivi gestiti** sono definiti come dispositivi che hanno un agent di gestione installato. L'agent di gestione invia e riceve i metadati del dispositivo e risponde ai comandi di gestione dispositivo da IoT Platform.

source: **Unmanaged Devices** are any devices which do not have a device management agent. All devices begin their lifecycle as unmanaged devices, and can transition to managed devices by sending a message from a device management agent to the IoT Platform.
it: **Dispositivi non gestiti** * sono tutti i dispositivi che non dispongono di un agent di gestione dispositivo. Tutti i dispositivi iniziano il loro ciclo di vita come dispositivi non gestiti e possono trasformarsi in dispositivi gestiti inviando un messaggio da un agent di gestione dispositivo a IoT Platform.

source: Connecting to the IoT Platform Device Management Service
it: Connessione al servizio gestione dispositivo IoT Platform

source: Create DeviceData
it: Crea DeviceData

source: The `device model <../reference/device_model.html>`__ describes the metadata and management characteristics of a device. The device database in the IoT Platform is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the IoT Platform, the device database is updated, making the information available to applications.
it: Il `modello di dispositivo <../reference/device_model.html>`__ descrive le caratteristiche di gestione e metadati di un dispositivo. Il database del dispositivo in IoT Platform è l'origine principale delle informazioni sul dispositivo. Le applicazioni e i dispositivi gestiti sono in grado di inviare aggiornamenti al database come un'ubicazione o l'avanzamento di un aggiornamento firmware. Una volta che IoT Platform ha ricevuto questi aggiornamenti, il database del dispositivo viene aggiornato, rendendo disponibili le informazioni alle applicazioni.

source: The device model in the ibmiotf client library is represented as DeviceData and to create a DeviceData one needs to create the following objects,
it: Il modello dispositivo nella libreria client ibmiotf è rappresentato come DeviceData e per creare un DeviceData è necessario creare i seguenti oggetti,

source: DeviceInfo (mandatory)
it: DeviceInfo (obbligatorio)

source: DeviceLocation (required if the device supports location update)
it: DeviceLocation (richiesto se il dispositivo supporta l'aggiornamento di ubicazione)

source: DiagnosticErrorCode (required if the device wants to update the ErrorCode)
it: DiagnosticErrorCode (richiesto se il dispositivo desidera aggiornare ErrorCode)

source: DiagnosticLog (required if the device wants to update Log information)
it: DiagnosticLog (richiesto se il dispositivo desidera aggiornare le informazioni log)

source: DeviceFirmware (required if the device supports Firmware Actions)
it: DeviceFirmware (richiesto se il dispositivo supporta le azioni firmware)

source: DeviceMetadata (optional)
it: DeviceMetadata (facoltativo)

source: The following code snippet shows how to create the mandatory object DeviceInfo along with an optional object DeviceMetadata with sample data:
it: Il seguente frammento di codice mostra come creare l'oggetto obbligatorio DeviceInfo insieme a un oggetto facoltativo DeviceMetadata con dati di esempio:

source: The following code snippet shows how to create the DeviceData object with the above created DeviceInfo and DeviceMetadata objects:
it: Il seguente frammento di codice mostra come creare l'oggetto DeviceData con gli oggetti DeviceInfo e DeviceMetadata creati in precedenza:

source: Construct ManagedDevice
it: Costruisci ManagedDevice

source: ManagedDevice - A device class that connects the device as managed device to IoT Platform and enables the device to perform one or more Device Management operations. Also the ManagedDevice instance can be used to do normal device operations like publishing device events and listening for commands from application.
it: ManagedDevice - Una classe dispositivo che connette il dispositivo come dispositivo gestito a IoT Platform e abilita il dispositivo ad eseguire una o più operazioni di gestione dispositivo. Inoltre, l'istanza ManagedDevice può essere utilizzata per eseguire normali operazioni come la pubblicazione degli eventi dispositivo e l'ascolto di comandi dall'applicazione.

source: ManagedDevice exposes 2 different constructors to support different user patterns,
it: ManagedDevice espone 2 diversi costruttori per supportare diversi schemi utente,

source: **Constructor One**
it: **Costruttore Uno**

source: Constructs a ManagedDevice instance by accepting the DeviceData and the following properties,
it: Costruisce un'istanza ManagedDevice accettando DeviceData e le seguenti proprietà,

source: Organization-ID - Your organization ID.
it: Organization-ID - L'ID dell'organizzazione.

source: Device-Type - The type of your device.
it: Device-Type - Il tipo di dispositivo.

source: Device-ID - The ID of your device.
it: Device-ID - L'ID del dispositivo.

source: Authentication-Method - Method of authentication (The only value currently supported is "token").
it: Authentication-Method - Il metodo di autenticazione (il solo valore attualmente supportato è "token").

source: Authentication-Token - API key token
it: Authentication-Token - Il token della chiave API

source: All these properties are required to interact with the IoT Platform.
it: Sono necessarie tutte queste proprietà per interagire con IoT Platform.

source: The following code shows how to create a ManagedDevice instance:
it: Il seguente codice mostra come creare un'istanza ManagedDevice:

source: The existing users of DeviceClient might observe that the names of these properties have changed slightly. These names have been changed to mirror the names in the IoT Platform Dashboard, but the existing users who want to migrate from the DeviceClient to the ManagedDevice can still use the old format and construct the ManagedDevice instance as follows:
it: Gli utenti esistenti di DeviceClient potrebbero notare che i nomi di queste proprietà sono stati leggermente modificati. Questi nomi sono stati modificati per riflettere i nomi nel dashboard Iot Platform, ma gli utenti esistenti che desiderano migrare da DeviceClient a ManagedDevice possono ancora utilizzare il vecchio formato e creare l'istanza ManagedDevice come riportato di seguito:

source: **Constructor Two**
it: **Costruttore Due**

source: Construct a ManagedDevice instance by accepting the DeviceData and the MqttClient instance. This constructor requires the DeviceData to be created with additional device attributes like Device Type and Device Id as follows:
it: Costruisce un'istanza ManagedDevice accettando DeviceData e l'istanza MqttClient. Questo costruttore richiede che DeviceData sia creato con ulteriori attributi dispositivo, come il tipo di dispositivo e l'ID dispositivo come illustrato di seguito:

source: Note this constructor helps the custom device users to create a ManagedDevice instance with the already created and connected MqttClient instance to take advantage of device management operations. But we recommend the users to use the library for all the device functionalities.
it: Tenere presente che questo costruttore aiuta gli utenti del dispositivo personalizzato a creare un'istanza ManagedDevice con l'istanza MqttClient già creata e connesso per sfruttare le operazioni di gestione dispositivo. Tuttavia, agli utenti è consigliato di utilizzare la libreria per tutte le funzionalità del dispositivo.

source: Manage
it: Gestisci

source: The device can invoke manage() method to participate in device management activities. The manage request will initiate a connect request internally if the device is not connected to the IoT Platform already:
it: Il dispositivo può richiamare il metodo manage() per partecipare alle attività di gestione dispositivo. La richiesta avvierà una richiesta di connessione internamente se il dispositivo non è già connesso a IoT Platform .

source: The device can use overloaded manage (lifetime) method to register the device for a given timeframe. The timeframe specifies the length of time within which the device must send another **Manage device** request in order to avoid being reverted to an unmanaged device and marked as dormant.
it: Il dispositivo può utilizzare il metodo manage (lifetime) sottoposto a overload per registrare il dispositivo per un periodo di tempo specificato. Il periodo specifica l'intervallo di tempo entro cui il dispositivo deve inviare un'altra richiesta **Gestisci dispositivo** per evitare di essere invertito in un dispositivo non gestito e contrassegnato come inattivo.

source: Refer to the `documentation <../device_mgmt/operations/manage.html>`__ for more information about the manage operation.
it: Fare riferimento alla documentazione <../device_mgmt/operations/manage.html>`__ per ulteriori informazioni sull'operazione di gestione.

source: Unmanage
it: Annulla gestione

source: A device can invoke unmanage() method when it no longer needs to be managed. The IoT Platform will no longer send new device management requests to this device and all device management requests from this device will be rejected other than a **Manage device** request.
it: Un dispositivo può richiamare il metodo unmanage() quando non è più necessario che sia un dispositivo gestito. IoT Platform non invierà più nuove richieste di gestione dispositivo a questo dispositivo e tutte le richieste di gestione dispositivo da questo dispositivo diverse da **Gestisci dispositivo** verranno respinte.

source: Refer to the `documentation <../device_mgmt/operations/manage.html>`__ for more information about the Unmanage operation.
it: Fare riferimento alla documentazione <../device_mgmt/operations/manage.html>`__ per ulteriori informazioni sull'operazione di annullamento della gestione.

source: Location Update
it: Aggiornamento ubicazione

source: Devices that can determine their location can choose to notify the IoT Platform about location changes. In order to update the location, the device needs to create DeviceData instance with the DeviceLocation object first.
it: I dispositivi che possono determinare la loro ubicazione possono scegliere di notificare a IoT Platform le modifiche dell'ubicazione. Per aggiornare l'ubicazione, il dispositivo deve prima creare un'istanza DeviceData con l'oggetto DeviceLocation.

source: Once the device is connected to IoT Platform, the location can be updated by invoking the following method:
it: Una volta che il dispositivo è connesso a IoT Platform, l'ubicazione può essere aggiornata richiamando il seguente metodo:

source: Later, any new location can be updated by changing the properties of the DeviceLocation object:
it: Successivamente, le nuove ubicazioni possono essere aggiornate modificando le proprietà dell'oggetto DeviceLocation:

source: The update() method informs the IoT Platform about the new location.
it: Il metodo update() informa IoT Platform circa la nuova ubicazione.

source: Refer to the `documentation <../device_mgmt/operations/update.html>`__ for more information about the Location update.
it: Fare riferimento alla documentazione <../device_mgmt/operations/update.html>`__ per ulteriori informazioni sull'aggiornamento dell'ubicazione.

source: Append/Clear ErrorCodes
it: Aggiungi/Elimina ErrorCodes

source: Devices can choose to notify the IoT Platform about changes in their error status. In order to send the ErrorCodes the device needs to construct a DiagnosticErrorCode object as follows:
it: I dispositivi possono scegliere di notificare a IoT Platform le modifiche al loro stato di errore. Per inviare ErrorCodes il dispositivo deve costruire un oggetto DiagnosticErrorCode come illustrato di seguito:

source: Once the device is connected to IoT Platform, the ErrorCode can be sent by calling the send() method as follows:
it: Una volta che il dispositivo è connesso a IoT Platform, ErrorCode può essere inviato richiamando il metodo send() come di seguito riportato.

source: Later, any new ErrorCodes can be easily added to the IoT Platform by calling the append method as follows:
it: Successivamente, qualsiasi nuovo ErrorCodes può essere facilmente aggiunto a IoT Platform richiamando il metodo append come di seguito riportato:

source: Also, the ErrorCodes can be cleared from IoT Platform by calling the clear() method as follows:
it: Inoltre, ErrorCodes può essere eliminato da IoT Platform richiamando il metodo clear() come di seguito riportato:

source: Append/Clear Log messages
it: Aggiungi/Elimina messaggi log

source: Devices can choose to notify the IoT Platform about changes by adding a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data. In order to send log messages, the device needs to construct a DiagnosticLog object as follows:
it: I dispositivi possono scegliere di notificare a IoT Platform le modifiche aggiungendo una nuova voce di log. La voce di log include messaggi di log, la sua registrazione data/ora e gravità, nonché dati di diagnostica binari codificati base64 facoltativi. Per inviare i messaggi di log, il dispositivo deve costruire un oggetto DiagnosticLog come illustrato di seguito:

source: Once the device is connected to IoT Platform, the log message can be sent by calling the send() method as follows:
it: Una volta che il dispositivo è connesso a IoT Platform, il messaggio di log può essere inviato richiamando il metodo send() come di seguito riportato:

source: Later, any new log messages can be easily added to the IoT Platform by calling the append method as follows:
it: Successivamente, qualsiasi nuovo messaggio di log può essere facilmente aggiunto a IoT Platform richiamando il metodo append come di seguito riportato:

source: Also, the log messages can be cleared from IoT Platform by calling the clear method as follows:
it: Inoltre, i messaggi di log possono essere eliminati da IoT Platform richiamando il metodo clear come di seguito riportato:

source: The device diagnostics operations are intended to provide information on device errors, and does not provide diagnostic information relating to the devices connection to the IoT Platform.
it: Le operazioni di diagnostica del dispositivo sono destinate a fornire le informazioni sugli errori del dispositivo e non forniscono informazioni sulla diagnostica relative alla connessione dei dispositivi a IoT Platform.

source: Refer to the `documentation <../device_mgmt/operations/diagnostics.html>`__ for more information about the Diagnostics operation.
it: Fare riferimento alla documentazione <../device_mgmt/operations/diagnostics.html>`__ per ulteriori informazioni sulle operazioni di diagnostica.

source: Firmware Actions
it: Azioni firmware

source: The firmware update process is separated into two distinct actions:
it: Il processo di aggiornamento del firmware è separato in due azioni distinte:

source: Downloading Firmware
it: Scaricamento del firmware

source: Updating Firmware.
it: Aggiornamento del firmware.

source: The device needs to do the following activities to support Firmware Actions:
it: Il dispositivo deve completare le seguenti attività per supportare le azioni firmware:

source: **1. Construct DeviceFirmware Object**
it: **1. Costruire l'oggetto DeviceFirmware**

source: In order to perform Firmware actions the device needs to construct the DeviceFirmware object and add it to DeviceData as follows:
it: Per eseguire le azioni firmware, il dispositivo deve costruire l'oggetto DeviceFirmware e aggiungerlo a DeviceData come illustrato di seguito:

source: The DeviceFirmware object represents the current firmware of the device and will be used to report the status of the Firmware Download and Firmware Update actions to IoT Platform.
it: L'oggetto DeviceFirmware rappresenta il firmware corrente del dispositivo e verrà utilizzato per indicare lo stato delle azioni di download del firmware e di aggiornamento del firmware a IoT Platform.

source: **2. Inform the server about the Firmware action support**
it: **2. Informare il server riguardo al supporto dell'azione firmware**

source: The device needs to set the firmware action flag to true in order for the server to initiate the firmware request. This can be achieved by invoking a following method with a boolean value:
it: Il dispositivo deve impostare l'indicatore dell'azione firmware su true per consentire al server di avviare la richiesta firmware. Ciò può essere eseguito richiamando il seguente metodo con un valore booleano:

source: As the manage request informs the IoT Platform about the firmware action support, manage() method needs to be called right after setting the firmware action support.
it: Quando la richiesta di gestione informa IoT Platform del supporto dell'azione firmware, deve essere chiamato il metodo manage() subito dopo l'impostazione del supporto per l'azione firmware.

source: **3. Create the Firmware Action Handler**
it: **3. Creare il gestore dell'azione firmware**

source: In order to support the Firmware action, the device needs to create a handler and add it to ManagedDevice. The handler must extend a DeviceFirmwareHandler class and implement the following methods:
it: Per supportare l'azione firmware, il dispositivo deve creare un gestore e aggiungerlo a ManagedDevice. Il gestore deve estendere una classe DeviceFirmwareHandler e implementare i seguenti metodi:

source: **3.1 Sample implementation of downloadFirmware**
it: **3.1 Implementazione di esempio di downloadFirmware**

source: The implementation must add logic to download the firmware and report the status of the download via DeviceFirmware object. If the Firmware Download operation is successful, then the state of the firmware to be set to DOWNLOADED and UpdateStatus should be set to SUCCESS.
it: L'implementazione deve aggiungere una logica per scaricare il firmware e notificare lo stato dello scaricamento tramite l'oggetto DeviceFirmware. Se l'operazione di scaricamento del firmware ha esito positivo, lo stato del firmware deve essere impostato su DOWNLOADED e UpdateStatus deve essere impostato su SUCCESS.

source: If an error occurs during Firmware Download the state should be set to IDLE and updateStatus should be set to one of the error status values:
it: Se si verifica un errore durante lo scaricamento del firmware, lo stato deve essere impostato su IDLE e updateStatus deve essere impostato su uno dei valori dello stato di errore:

source: A sample Firmware Download implementation for a Raspberry Pi device is shown below:
it: Di seguito, viene illustrata un'implementazione di esempio dello scaricamento del firmware per un dispositivo Raspberry Pi:

source: Device can check the integrity of the downloaded firmware image using the verifier and report the status back to IoT Platform. The verifier can be set by the device during the startup (while creating the DeviceFirmware Object) or as part of the Download Firmware request by the application. A sample code to verify the same is below:
it: Il dispositivo può verificare l'integrità dell'immagine firmware scaricata utilizzando il verificatore e riporta lo stato a IoT Platform. Il verificatore può essere impostato dal dispositivo durante l'avvio (durante la creazione dell'oggetto DeviceFirmware) oppure come parte della richiesta Scaricamento del firmware da parte dell'applicazione. Un codice di esempio per eseguire la stessa verifica è illustrato di seguito:

source: The complete code can be found in the device management sample `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.
it: Il codice completo si trova nell'esempio di gestione dispositivo `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.

source: **3.2 Sample implementation of updateFirmware**
it: **3.2 Implementazione di esempio di updateFirmware**

source: The implementation must add logic to install the downloaded firmware and report the status of the update via DeviceFirmware object. If the Firmware Update operation is successful, then the state of the firmware should to be set to IDLE and UpdateStatus should be set to SUCCESS.
it: L'implementazione deve aggiungere una logica per installare il firmware scaricato e notificare lo stato dell'aggiornamento tramite l'oggetto DeviceFirmware. Se l'operazione di aggiornamento del firmware ha esito positivo, lo stato del firmware deve essere impostato su IDLE e UpdateStatus deve essere impostato su SUCCESS.

source: If an error occurs during Firmware Update, updateStatus should be set to one of the error status values:
it: Se si verifica un errore durante l'aggiornamento del firmware, updateStatus deve essere impostato su uno dei valori dello stato di errore illustrati di seguito:
