Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/java_deviceManagement.po
Languages: it

source: A sample Firmware Update implementation for a Raspberry Pi device is shown below:
it: Un'implementazione dell'aggiornamento del firmware per un dispositivo Raspberry Pi è illustrata di seguito:

source: **4. Add the handler to ManagedDevice**
it: **4. Aggiunta del gestore a ManagedDevice**

source: The created handler needs to be added to the ManagedDevice instance so that the ibmiotf client library invokes the corresponding method when there is a Firmware action request from IoT Platform.
it: Il gestore creato deve essere aggiunto all'istanza ManagedDevice in modo che la libreria client ibmiotf richiami il corrispondente metodo quando è presente una richiesta di azione Firmware da IoT Platform.

source: Refer to `this page <../device_mgmt/operations/firmware_actions.html>`__ for more information about the Firmware action.
it: Fare riferimento a `questa pagina <../device_mgmt/operations/firmware_actions.html>`__ per ulteriori informazioni sull'azione firmware.

source: Device Actions
it: Azioni dispositivo

source: The IoT Platform supports the following device actions:
it: IoT Platform supporta le seguenti azioni per il dispositivo:

source: Reboot
it: Riavvia

source: Factory Reset
it: Reimpostazione alle impostazioni di fabbrica

source: The device needs to do the following activities to support Device Actions:
it: Il dispositivo deve completare le seguenti attività per supportare le azioni dispositivo:

source: **1. Inform server about the Device Actions support**
it: **1. Informare il server del supporto alle azioni dispositivo**

source: In order to perform Reboot and Factory Reset, the device needs to inform the IoT Platform about its support first. This can achieved by invoking a following method with a boolean value:
it: Per eseguire il riavvio e la reimpostazione alle impostazioni di fabbrica, è necessario che il dispositivo prima informi IoT Platform del relativo supporto. Ciò può essere eseguito richiamando il seguente metodo con un valore booleano:

source: As the manage request informs the IoT Platform about the device action support, manage() method needs to be called right after setting the device action support.
it: Quando la richiesta di gestione informa IoT Platform sul supporto dell'azione dispositivo, è necessario richiamare il metodo manage() subito dopo l'impostazione del supporto per l'azione dispositivo.

source: **2. Create the Device Action Handler**
it: **2. Creare il gestore dell'azione dispositivo**

source: In order to support the device action, the device needs to create a handler and add it to ManagedDevice. The handler must extend a DeviceActionHandler class and provide implementation for the following methods:
it: Per supportare l'azione dispositivo, il dispositivo deve creare un gestore e aggiungerlo a ManagedDevice. Il gestore deve estendere una classe DeviceActionHandler e fornire l'implementazione dei seguenti metodi:

source: **2.1 Sample implementation of handleReboot**
it: **2.1 Implementazione di esempio di handleReboot**

source: The implementation must add a logic to reboot the device and report the status of the reboot via DeviceAction object. The device needs to update the status along with a optional message only when there is a failure (because the successful operation reboots the device and the device code will not have a control to update the IoT Platform). A sample reboot implementation for a Raspberry Pi device is shown below:
it: L'implementazione deve aggiungere una logica per riavviare il dispositivo e notificare lo stato del riavvio tramite l'oggetto DeviceAction. Il dispositivo deve aggiornare lo stato insieme ad un messaggio facoltativo solo quando si è verificato un errore (perché l'operazione riuscita riavvia il dispositivo e il codice dispositivo non dovrà controllare l'aggiornamento di IoT Platform). Un'implementazione di esempio del riavvio per un dispositivo Raspberry Pi è illustrata di seguito:

source: The complete code can be found in the device management sample `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.
it: Il codice completo si trova nell'esempio di gestione dispositivo `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.

source: **2.2 Sample implementation of handleFactoryReset**
it: **2.2 Implementazione di esempio di handleFactoryReset**

source: The implementation must add a logic to reset the device to factory settings and report the status via DeviceAction object. The device needs to update the status along with a optional message only when there is a failure (because as part of this process, the device reboots and the device will not have a control to update status to IoT Platform). The skeleton of the Factory Reset implementation is shown below:
it: L'implementazione deve aggiungere una logica per reimpostare il dispositivo alle impostazioni di fabbrica e notificare lo stato tramite l'oggetto DeviceAction. È necessario che il dispositivo aggiorni lo stato insieme ad un messaggio facoltatrivo solo quando si verifica un errore (in quanto, in caso di esito positivo dell'operazione, questo processo prevede il riavvio del dispositivo e non dovrà controllare l'aggiornamento dello stato in IoT Platform). Lo skeleton dell'implementazione della reimpostazione alle impostazioni di fabbrica è illustrato di seguito:

source: **3. Add the handler to ManagedDevice**
it: **3. Aggiunta del gestore a ManagedDevice**

source: The created handler needs to be added to the ManagedDevice instance so that the ibmiotf client library invokes the corresponding method when there is a device action request from IoT Platform.
it: È necessario aggiungere il gestore creato all'istanza ManagedDevice in modo che la libreria client ibmiotf richiami il corrispondente metodo quando è presente una richiesta di azione dispositivo da IoT Platform.

source: Refer to `this page <../device_mgmt/operations/device_actions.html>`__ for more information about the Device Action.
it: Fare riferimento a `questa pagina <../device_mgmt/operations/device_actions.html>`__ per ulteriori informazioni sull'azione dispositivo.

source: Listen for Device attribute changes
it: Ascolto di modifiche dell'attributo dispositivo

source: This ibmiotf client library updates the corresponding objects whenever there is an update request from the IoT Platform, these update requests are initiated by the application either directly or indirectly (Firmware Update) via the IoT Platform ReST API. Apart from updating these attributes, the library provides a mechanism where the device can be notified whenever a device attribute is updated.
it: Questa libreria client ibmiotf aggiorna gli oggetti corrispondenti ogni volta che avviene una richiesta di aggiornamento da IoT Platform, queste richieste di aggiornamento vengono avviate dall'applicazione direttamente o indirettamente (Aggiornamento firmware) mediante l'API REST IoT Platform. Oltre ad aggiornare questi attributi, la libreria fornisce un meccanismo tramite il quale il dispositivo può ricevere notifiche quando viene aggiornato un attributo dispositivo.

source: Attributes that can be updated by this operation are location, metadata, device information and firmware.
it: Gli attributi che possono essere aggiornati da questa operazione sono l'ubicazione, i metadati, le informazioni del dispositivo e il firmware.

source: In order to get notified, the device needs to add a property change listener on those objects that it is interested.
it: Per ricevere la notifica, il dispositivo deve aggiungere un listener di modifica delle proprietà sugli oggetti a cui è interessato.

source: Also, the device needs to implement the propertyChange() method where it receives the notification. A sample implementation is as follows:
it: Inoltre, il dispositivo deve implementare il metodo propertyChange() su cui riceve la notifica. Un'implementazione di esempio è illustrata di seguito:

source: Refer to `this page <../device_mgmt/operations/update.html>`__ for more information about updating the device attributes.
it: Fare riferimento a `questa pagina <../device_mgmt/operations/update.html>`__ per ulteriori informazioni sull'aggiornamento degli attributi dispositivo.

source: Examples
it: Esempi:

source: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - A sample agent code that shows how to perform various device management operations on Raspberry Pi.
it: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - Un codice agent di esempio che mostra come eseguire diverse operazioni di gestione dispositivo su Raspberry Pi.

source: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - A sample code that shows how one can perform both device operations and management operations.
it: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - Un codice di esempio che mostra come eseguire operazioni dispositivo e di gestione.

source: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - A sample agent code with custom MqttAsyncClient.
it: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - Un codice agent di esempio con MqttAsyncClient personalizzato.

source: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - A sample agent code with custom MqttClient.
it: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - Un codice agent di esempio con MqttClient personalizzato.

source: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - A sample implementation of FirmwareHandler for Raspberry Pi.
it: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Un'implementazione di esempio di FirmwareHandler per Raspberry Pi.

source: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - A sample implementation of DeviceActionHandler
it: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - Un'implementazione di esempio di DeviceActionHandler

source: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - A sample that shows how to send regular manage request with lifetime specified.
it: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - Un esempio che mostra come inviare richieste di gestione regolari con la durata specificata.

source: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - A sample listener code that shows how to listen for a various device attribute changes .
it: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - Un codice listener di esempio che mostra come ascoltare le modifiche dei vari attributi dispositivi.

source: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - A sample that shows how to add ErrorCode without waiting for response from the server.
it: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - Un esempio che mostra come aggiungere ErrorCode senza attendere una risposta dal server.

source: Recipe
it: Istruzioni specifiche

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ that shows how to connect the Raspberry Pi device as managed device to IoT Platform to perform various device management operations in step by step using this client library.
it: Fare riferimento all'istrzuione <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ che mostra passo dopo passo in che modo connettere il dispositivo Raspberry Pi come dispositivo gestito a IoT Platform per eseguire diverse operazioni di gestione dispositivo utilizzando questa libreria client.
