Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/mbedcpp.po
Languages: de, ja

source: mBed C++ for Device Developers
de: mBed C++ für Geräteentwickler
ja: デバイス開発者用の mBed C++

source: See `ibmiotf <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ on `developer.mbed.org <https://developer.mbed.org/>`_
de: Siehe `ibmiotf <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ in `developer.mbed.org <https://developer.mbed.org/>`_.
ja: `developer.mbed.org <https://developer.mbed.org/>`_ にある `ibmiotf <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ を参照してください。

source: The `mBed C++ client library <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ can be used to connect `mBed devices <https://www.mbed.com/en/>`__ like `LPC1768 <https://developer.mbed.org/platforms/mbed-LPC1768/>`__, `FRDM-K64F <https://developer.mbed.org/platforms/FRDM-K64F/>`__ and etc.. to the IoT Platform Cloud service with ease. Although the library uses C++, it still avoids dynamic memory allocations and use of STL functions as the mBed devices sometimes have idiosyncratic memory models which make porting difficult. In any case, the library allows one to make memory use as predictable as possible.
de: Die `mBed C++-Clientbibliothek <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ kann dazu verwendet werden, auf einfache Weise eine Verbindung von `mBed-Geräten <https://www.mbed.com/en/>`__ wie `LPC1768 <https://developer.mbed.org/platforms/mbed-LPC1768/>`__, `FRDM-K64F <https://developer.mbed.org/platforms/FRDM-K64F/>`__ usw. zum IoT Platform Cloud-Service herzustellen. Die Bibliothek verwendet zwar C++, es wird jedoch vermieden, dynamische Speicherzuordnungen und STL-Funktionen zu verwenden, da die mBed-Geräte in manchen Fällen idiosynkratische Speichermodelle aufweisen, die Probleme bei der Portierbarkeit verursachen können. In jedem Fall ermöglicht der Einsatz der Bibliothek eine möglichst exakt prognostizierbare Speichernutzung.
ja: `mBed C++ クライアント・ライブラリー <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ を使用すると、`mBed デバイス <https://www.mbed.com/en/>`__ (`LPC1768 <https://developer.mbed.org/platforms/mbed-LPC1768/>`__、`FRDM-K64F <https://developer.mbed.org/platforms/FRDM-K64F/>`__ など) を IoT Platform のクラウド・サービスに簡単に接続できます。ライブラリーは C++ を使用しますが、mBed デバイスが固有のメモリー・モデルを持ち、それにより移植が難しくなる動的メモリー割り振りと STL 関数の使用が回避されています。いずれの場合でも、ライブラリーによってメモリーの使用量が可能な限り予測できるようになります。

source: Dependencies
de: Abhängigkeiten
ja: 従属関係

source: `Eclipse Paho MQTT library <https://developer.mbed.org/teams/mqtt/code/MQTT/>`__ - Provides a MQTT client library for mBed devices, check `here <http://www.eclipse.org/paho/clients/c/embedded/>`__ for more information.
de: `Eclipse Paho-MQTT-Bibliothek <https://developer.mbed.org/teams/mqtt/code/MQTT/>`__ - Stellt eine MQTT-Clientbibliothek für mBed-Geräte bereit; weitere Informationen finden Sie `hier <http://www.eclipse.org/paho/clients/c/embedded/>`__.
ja: `Eclipse Paho MQTT ライブラリー <https://developer.mbed.org/teams/mqtt/code/MQTT/>`__ - mBed デバイスのために MQTT クライアント・ライブラリーを提供します。詳細情報は `こちら <http://www.eclipse.org/paho/clients/c/embedded/>`__ を参照してください。

source: `EthernetInterface library <https://developer.mbed.org/users/mbed_official/code/EthernetInterface/>`__ - A mBed IP library over Ethernet.
de: `Ethernet-Schnittstellenbibliothek <https://developer.mbed.org/users/mbed_official/code/EthernetInterface/>`__ - Eine mBed-IP-Bibliothek über Ethernet.
ja: `EthernetInterface ライブラリー <https://developer.mbed.org/users/mbed_official/code/EthernetInterface/>`__ - イーサネット経由の mBed IP ライブラリー。

source: How to use the library
de: Verwendung der Bibliothek
ja: ライブラリーの使用方法

source: Use the `mBed Compiler <https://developer.mbed.org/compiler/>`__ to create your applications using this mBed C++ IBMIoTF Client Library. The mBed Compiler provides a lightweight online C/C++ IDE that is pre-configured to let you quickly write programs, compile and download them to run on your mbed Microcontroller. In fact, you don't have to install or set up anything to get running with mbed.
de: Verwenden Sie den `mBed-Compiler <https://developer.mbed.org/compiler/>`__ zum Erstellen von Anwendungen mit dieser mBed C++-IBMIoTF-Clientbibliothek. Der mBed-Compiler bietet eine einfache C/C++-Online-IDE, die so vorkonfiguriert ist, dass Sie ohne großen Zeitaufwand Programme schreiben, kompilieren und zur Ausführung mit dem mbed-Mikrocontroller herunterladen können. Es sind keinerlei Installations- oder Konfigurationsschritte erforderlich, um mit der Verwendung von mbed zu beginnen.
ja: `mBed コンパイラー <https://developer.mbed.org/compiler/>`__ を使用して、この mBed C++ IBMIoTF クライアント・ライブラリーを使用してアプリケーションを作成します。mBed コンパイラーは、事前構成された軽量のオンライン C/C++ IDE を提供し、プログラムの作成や、コンパイルとダウンロードを素早く行い、mbed マイクロコントローラー上で実行できるようにします。実際に、mbed と共に動作させるために、何かをインストールしたり設定したりする必要はありません。

source: Refer to the step by step `mBed C++ Client Library for IBM IoT Platform Recipe <https://developer.ibm.com/recipes/tutorials/mbed-c-client-library-for-ibm-iot-foundation/>`__ that shows how one can use this library to connect an ARM mBed NXP LPC 1768 microcontroller to the IoT Platform.
de: Instruktionen in einzelnen Schritten finden Sie in der `Anleitung für die mBed C++ Client Library für IBM IoT Platform <https://developer.ibm.com/recipes/tutorials/mbed-c-client-library-for-ibm-iot-foundation/>`__. Hier wird erläutert, wie diese Bibliothek dazu verwendet werden kann, eine Verbindung von einem ARM mBed NXP LPC 1768-Mikrocontroller zu IoT Platform herzustellen.
ja: このライブラリーを使用して ARM mBed NXP LPC 1768 マイクロコントローラーを IoT Platform に接続する方法を示す `IBM IoT Platform のための mBed C++ クライアント・ライブラリーのレシピ <https://developer.ibm.com/recipes/tutorials/mbed-c-client-library-for-ibm-iot-foundation/>`__ を手順ごとに参照してください。

source: Constructor
de: Konstruktor
ja: コンストラクター

source: The constructor builds the client instance, and accepts the following parameters:
de: Der Konstruktor erstellt die Clientinstanz und akzeptiert die folgenden Parameter:
ja: コンストラクターはクライアント・インスタンスを作成するものであり、次のパラメーターを受け入れます。

source: org - Your organization ID. (This is a required field. In case of quickstart flow, provide org as quickstart.)
de: org - Ihre Organisations-ID. (Dies ist ein erforderliches Feld. Im Fall eines Quickstart-Ablaufs, geben Sie org als Quickstart an.)
ja: org - 組織 ID。(これは必須フィールドです。Quickstart フローの場合、Quickstart として org を指定します。)

source: type - The type of your device. (This is a required field.)
de: type - Der Typ Ihres Geräts. (Dies ist ein erforderliches Feld.)
ja: type - デバイスのタイプ。(これは必須フィールドです。)

source: id - The ID of your device. (This is a required field.
de: id - Die ID Ihres Geräts. (Dies ist ein erforderliches Feld.)
ja: id - デバイスの ID。(これは必須フィールドです。

source: auth-method - Method of authentication (This is an optional field, needed only for registered flow and the only value currently supported is "token").
de: auth-method - Die Methode der Authentifizierung. (Dies ist ein optionales Feld, das nur für registrierte Abläufe erforderlich ist; der einzige derzeit unterstützte Wert ist "token".)
ja: auth-method - 認証方式 (これはオプションのフィールドです。登録されたフローでのみ必要で、現在サポートされている値は「token」のみです)。

source: auth-token - API key token (This is an optional field, needed only for registered flow).
de: auth-token - API-Schlüsseltoken. (Dies ist ein optionales Feld, das nur für registrierte Abläufe erforderlich ist.)
ja: auth-token - API キー・トークン (これはオプションのフィールドで、登録されたフローでのみ必要です)。

source: These arguments create definitions which are used to interact with the IoT Platform service.
de: Mit diesen Argumenten werden Definitionen erstellt, die für die Interaktion mit dem IoT Platform-Service verwendet werden.
ja: これらの引数は IoT Platform サービスと対話するために使用される定義を作成します。

source: The following code block shows how to create a DeviceClient instance to interact with the IoT Platform quickstart service.
de: Der folgende Codeblock zeigt die Erstellung einer DeviceClient-Instanz zur Interaktion mit dem Quickstart-Service von IoT Platform.
ja: 次のコード・ブロックは、DeviceClient インスタンスを作成して、IoT Platform の Quickstart サービスと対話する方法を示しています。

source: As shown above, if the device id is not specified, the DeviceClient uses the MAC address of the device as device id and connects to the IoT Platform. The device code can use getDeviceId() method to retrieve the device id from the DeviceClient instance.
de: Wenn die Geräte-ID nicht angegeben wird, verwendet der Geräteclient (DeviceClient) wie oben dargestellt die MAC-Adresse des Geräts als Geräte-ID und stellt eine Verbindung zu IoT Platform her. Der Gerätecode kann mithilfe der Methode 'getDeviceId()' die Geräte-ID von der DeviceClient-Instanz abrufen.
ja: 前述のとおり、デバイス ID が指定されていない場合、DeviceClient はデバイスの MAC アドレスをデバイス ID として使用して IoT Platform に接続します。デバイス・コードは getDeviceId() メソッドを使用して、DeviceClient インスタンスからデバイス ID を取得できます。

source: The following code block shows how to create a DeviceClient instance to interact with the IoT Platform Registered organization.
de: Der folgende Codeblock zeigt die Erstellung einer Geräteclientinstanz zur Interaktion mit der registrierten Organisation von IoT Platform.
ja: 次のコード・ブロックは、DeviceClient インスタンスを作成して、IoT Platform 登録済み組織と対話する方法を示しています。

source: Connecting to the IoT Platform
de: Herstellen der Verbindung zu IoT Platform
ja: IoT Platform への接続

source: The device can connect to the IoT Platform by calling the connect function on the DeviceClient instance.
de: Das Gerät kann eine Verbindung zu IoT Platform herstellen, indem es die Verbindungsfunktion der Geräteclientinstanz aufruft.
ja: デバイスは DeviceClient インスタンスの接続関数を呼び出すことによって、IoT Platform と接続できます。

source: After the successful connection, the device can publish events to the IoT Platform and listen for commands.
de: Nach der erfolgreichen Verbindungsherstellung kann das Gerät Ereignisse in IoT Platform publizieren und ist für Befehle empfangsbereit.
ja: 接続が成功した後で、デバイスはイベントを IoT Platform にパブリッシュして、コマンドを listen できます。

source: Also, the device can query the status of the connection using the isConnected() method as follows,
de: Das Gerät kann darüber hinaus den Status der Verbindung mithilfe der Methode 'isConnected()' wie folgt abrufen:
ja: また、デバイスでは、isConnected() メソッドを以下のように使用して接続の状況を照会できます。

source: Publishing events
de: Ereignisse publizieren
ja: イベントのパブリッシング

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
de: Ereignisse sind der Mechanismus, mit dem Geräte Daten in IoT Platform publizieren. Das Gerät steuert den Inhalt des Ereignisses und ordnet einen Namen für jedes von dem Gerät gesendete Ereignis zu.
ja: イベントは、デバイスが IoT Platform にデータをパブリッシュするためのメカニズムです。デバイスはイベントのコンテンツを制御し、送信するイベントごとに名前を割り当てます。

source: When an event is received by the IBM IoT Platform the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
de: Wenn ein Ereignis von IBM IoT Platform empfangen wird, werden die Identifikationsdaten der Verbindung, über die das Ereignis empfangen wurde, dazu verwendet, das Gerät zu ermitteln, von dem das Ereignis gesendet wurde. Mit dieser Architektur ist es für ein Gerät unmöglich, die Identität eines anderen Geräts anzunehmen.
ja: IBM IoT Platform は、イベントを受け取ると、そのイベントを受け取った接続の資格情報に基づいて、イベントの送信元のデバイスを特定します。このアーキテクチャーにより、デバイスは別のデバイスの偽名を使用することが不可能になります。

source: Events can be published at any of the three `quality of service levels <../messaging/mqtt.html#/>`__ defined by the MQTT protocol. By default events will be published as qos level 0.
de: Ereignisse können mit jeder der drei 'Servicequalitätsstufen <../messaging/mqtt.html#/>`__, die durch das MQTT-Protokoll definiert sind, publiziert werden. Standardmäßig werden Ereignisse als qos-Stufe 0 publiziert.
ja: イベントは、MQTT プロトコルによって定義された 3 つの `サービスの品質レベル <../messaging/mqtt.html#/>` __ のいずれでもパブリッシュできます。デフォルトで、イベントは qos レベル 0 としてパブリッシュされます。

source: Publish event using default quality of service
de: Ereignisse mit der standardmäßigen Servicequalität publizieren
ja: デフォルトのサービスの品質を使用してイベントをパブリッシュ

source: The below sample shows how to publish various data points of LPC1768 like x,y & z axis, joystick position, current temperature reading and etc.. to IoT Platform in JSON format.
de: Das nachfolgende Beispiel zeigt, wie verschiedene Datenpunkte von LPC1768, wie z. B. X-,Y- & Z-Achse, Joystickposition, aktueller gemessener Wert für die Temperatur usw., im JSON-Format in IoT Platform publiziert werden.
ja: 以下のサンプルは、LPC1768 のさまざまなデータ・ポイント、例えば x、y、および z 軸、ジョイスティックの位置、現在の気温の読み取りなどを IoT Platform に JSON フォーマットでパブリッシュする方法を示します。

source: The complete sample can be found `here <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/file/e58533b6bc6b/src/Main.cpp>`__.
de: Das vollständige Beispiel finden Sie `hier <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/file/e58533b6bc6b/src/Main.cpp>`__.
ja: 完全なサンプルは、`こちら<https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/file/e58533b6bc6b/src/Main.cpp>`__にあります。

source: Publish event using user-defined quality of service
de: Ereignisse mit einer benutzerdefinierten Servicequalität publizieren
ja: ユーザー定義のサービスの品質を使用してイベントをパブリッシュ

source: Events can be published at higher MQTT quality of service levels, but these events may take slower than QoS level 0, because of the extra confirmation of receipt. Also quickstart flow allows only Qos of 0.
de: Ereignisse könne auf höheren MQTT-Servicequalitätsstufen publiziert werden. Diese Ereignisse können jedoch wegen der zusätzlichen Eingangsbestätigung langsamer als QoS-Stufe 0 sein. Der Quickstart-Ablauf erlaubt außerdem nur ein Qos von 0.
ja: イベントは、より高レベルな MQTT サービスの品質でパブリッシュできますが、余分な受信の確認があるためこれらのイベントは QoS レベル 0 よりも低速になる可能性があります。また、Quickstart フローでは Qos レベル 0 のみが許可されます。

source: Handling the connection lost error during the event publish
de: Verarbeiten des Verbindungsunterbrechungsfehlers beim Publizieren von Ereignissen
ja: イベントのパブリッシュ中に接続が失われた場合の対応

source: When the publishEvent() method returns false, one can check the status of the connection and call reConnect() if the connection is lost,
de: Wenn die Methode 'publishEvent()' den Wert 'false' zurückgibt, kann der Verbindungsstatus überprüft und die Methode 'reConnect()' aufgerufen werden, falls die Verbindung unterbrochen ist.
ja: publishEvent() メソッドから false が返された場合は、接続の状況を確認し、接続が失われていれば reConnect() を呼び出します。

source: The library does not store the events published during the unconnected state, and hence, the device needs to call the publishEvent() method again to send those events once the connection is reestablished.
de: In der Bibliothek werden keine Ereignisse gespeichert, die während der Verbindungsunterbrechung publiziert wurden. Darum muss das Gerät die Methode 'publishEvent()' erneut aufrufen, um die betreffenden Ereignisse zu senden, sobald die Verbindung wiederhergestellt ist.
ja: 接続していない状態でパブリッシュしたイベントはライブラリーに格納されていないため、接続が再確立された後に、デバイスから再び publishEvent() メソッドを呼び出してそれらのイベントを送信する必要があります。

source: Handling commands
de: Befehle verarbeiten
ja: コマンドの処理

source: When the device client connects, it automatically subscribes to any commands for this device. To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
de: Wenn der Geräteclient die Verbindung herstellt, subskribiert er automatisch alle Befehle für dieses Gerät. Zum Verarbeiten bestimmter Befehle müssen Sie eine Callback-Methode für Befehle registrieren. Die Nachrichten werden als eine Instanz der Befehlsklasse zurückgegeben, die die folgenden Eigenschaften hat:
ja: デバイス・クライアントは、接続時に自動的にこのデバイスに対するコマンドをサブスクライブします。特定のコマンドを処理するには、コマンド・コールバック・メソッドを登録する必要があります。メッセージは、以下のプロパティーを持つ Command クラスのインスタンスとして返されます。

source: command - name of the command invoked
de: command - Name des aufgerufenen Befehls
ja: command - 呼び出されるコマンドの名前

source: format - e.g json, xml
de: format - z.B.: json, xml
ja: format - 例: json、xml

source: Following code defines a sample command callback function that processes the LED blink interval command from the application and adds the same to the DeviceClient instance.
de: Mit dem folgenden Code wird eine Callback-Beispielfunktion für Befehle definiert, die den LED-Blinkintervallbefehl von der Anwendung verarbeitet und zur DeviceClient-Instanz hinzufügt.
ja: 次のコードは、LED の点滅の間隔コマンドをアプリケーションから処理し、同じものを DeviceClient インスタンスに追加するサンプル・コマンド・コールバック関数を定義するものです。

source: The 'client.yield()' function must be called periodically to receive commands.
de: Die Funktion 'client.yield()' muss in Abständen aufgerufen werden, um Befehl empfangen zu können.
ja: コマンドを受け取るには、'client.yield()' 関数を定期的に呼び出す必要があります。

source: Disconnect Client
de: Verbindung des Clients trennen
ja: クライアントの切断

source: To disconnect the client and release the connections, run the following code snippet.
de: Um die Verbindung des Clients zu trennen und die Verbindungen freizugeben, führen Sie das folgende Code-Snippet aus.
ja: クライアントを切断して接続を解放するには、次のコード・スニペットを実行します。

source: Samples
de: Beispiele
ja: サンプル

source: `IBMIoTClientLibrarySample <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/>`__ - A Sample code that showcases how to use IBMIoTF client library to connect the mbed LPC1768 or FRDM-K64F devices to the IBM Internet of Things Cloud service.
de: `IBMIoTClientLibrarySample <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/>`__ - Beispielcode, der veranschaulicht, wie mithilfe der IBMIoTF-Clientbibliothek eine Verbindung von mbed LPC1768-Geräten oder FRDM-K64F-Geräten zum IBM Internet of Things-Cloud-Service hergestellt werden kann.
ja: `IBMIoTClientLibrarySample <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/>`__ - IBMIoTF クライアント・ライブラリーを使用して mbed LPC1768 または FRDM-K64F デバイスを IBM Internet of Things Cloud サービスに接続する方法を示すサンプル・コード。
