Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/nodejs.po
Languages: it, pt_br, zh_tw

source: Node.js for Device Developers
it: Node.js per gli sviluppatori del dispositivo
pt_br: Node.js para Desenvolvedores de Dispositivo
zh_tw: 適用於裝置開發人員的 Node.js

source: See `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ in GitHub
it: Consultare `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ in GitHub
pt_br: Consulte `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ no GitHub
zh_tw: 請參閱 GitHub 中的 `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_

source: See the `samples for device <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ in Github
it: Consultare gli `esempi per il dispositivo <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ in Github
pt_br: Consulte `samples for device <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ em Github
zh_tw: 請參閱 Github 中的 `裝置範例 <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_

source: See `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ on NPM
it: Consultare `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ in NPM
pt_br: Consulte `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ no NPM
zh_tw: 請參閱 NPM 上的 `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_

source: Constructor
it: Costruttore
pt_br: Construtor
zh_tw: 建構子

source: The constructor builds the device client instance. It accepts a configuration json containing the following definitions:
it: Il costruttore crea l'istanza del client del dispositivo. Accetta una configurazione json contenente le seguenti definizioni:
pt_br: O construtor constrói a instância do cliente do dispositivo. Ele aceita um JSON de configuração contendo as seguintes definições:
zh_tw: 建構子會建置裝置用戶端實例。它接受包含下列定義的配置 json：

source: ``org`` - Your organization ID
it: ``org`` - ID organizzazione
pt_br: ``org`` - O ID de sua organização
zh_tw: ``org`` - 組織 ID

source: ``type`` - The type of your device
it: ``type`` - Il tipo di dispositivo
pt_br: ``type`` - O tipo de seu dispositivo
zh_tw: ``type`` - 裝置的類型

source: ``id`` - The ID of your device
it: ``id`` - L'ID dispositivo
pt_br: ``id`` - O ID de seu dispositivo
zh_tw: ``id`` - 裝置的 ID

source: ``auth-method`` - Method of authentication (the only value currently supported is ``token``)
it: ``auth-method`` - Metodo di autenticazione (il solo valore attualmente supportato è ``token``)
pt_br: ``auth-method`` - Método de autenticação (o único valor suportado atualmente é ``token``)
zh_tw: ``auth-method`` - 鑑別的方法（目前唯一支援的值是 ``token``）

source: ``auth-token`` - API key token (required if auth-method is ``token``)
it: ``auth-token`` - Token chiave API (richiesto se auth-method è ``token``)
pt_br: ``auth-token`` - Token de chave da API (necessário se o método de autenticação é ``token``)
zh_tw: ``auth-token`` - API 金鑰記號（如果 auth-method 為 ``token`` 則需要）

source: If you want to use Quickstart, then send only the first three properties.
it: Se si desidera utilizzare Quickstart, inviare solo le prime tre proprietà.
pt_br: Se desejar usar o Quickstart, envie apenas as três primeiras propriedades.
zh_tw: 如果您要使用 Quickstart，請只傳送前三個內容。

source: Using a configuration file
it: Tramite file di configurazione
pt_br: Usando um arquivo de configuração
zh_tw: 使用配置檔

source: Instead of passing the configuration json directly, you can also use a configuration json file. Use the following code snippet:
it: Invece di passare direttamente il json di configurazione, è possibile anche utilizzare un file json di configurazione. Utilizzare il seguente frammento di codice:
pt_br: Em vez de transmitir o json de configuração diretamente, também é possível usar um arquivo json de configuração. Use o seguinte fragmento de código:
zh_tw: 您也可以使用配置 json 檔，而不直接傳遞配置 json。請使用下列程式碼 Snippet：

source: The configuration file `device.json` must be in the format of
it: Il file di configurazione `device.json` deve essere nel formato
pt_br: O arquivo de configuração `device.json` deve estar no formato de
zh_tw: 配置檔 `device.json` 的格式必須如下

source: Connecting to the IoT Platform
it: Connessione a IoT Platform
pt_br: Conectando-se ao IoT Platform
zh_tw: 連接至 IoT Platform

source: Connect to the IoT Platform by calling the *connect* function.
it: Connettersi a IoT Platform chiamando la funzione *connect*.
pt_br: Conecte-se ao IoT Platform chamando a função *connect*.
zh_tw: 呼叫 *connect* 函數以連接至 IoT Platform

source: After the successful connection to the IoT Platform service, the device client sends a *connect* event. So all the device logic can be implemented inside this callback function.
it: Una volta eseguita correttamente la connessione al servizio IoT Platform, il client del dispositivo emette un evento *connect*. Così tutta la logica del dispositivo può essere implementata all'interno di questa funzione di callback.
pt_br: Após a conexão bem-sucedida com o serviço do IoT Platform, o cliente do dispositivo envia um evento *connect*. Assim, toda a lógica do dispositivo pode ser implementada dentro dessa função de retorno de chamada.
zh_tw: 成功連線至 IoT Platform 服務之後，裝置用戶端會傳送 *connect* 事件。因此所有裝置邏輯都可以在此回呼函數內實作。

source: The Device Client automatically tries to reconnect when it loses connection. When the reconnection is successful, the client emits *reconnect* event.
it: Il client del dispositivo prova a ricollegarsi automaticamente quando perde la connessione. Quando la riconnessione ha esito positivo, il client invia l'evento *reconnect*.
pt_br: O Device Client tenta automaticamente se reconectar quando perde a conexão. Quando a reconexão é bem-sucedida, o cliente emite o evento *reconnect*.
zh_tw: 「裝置用戶端」在其連線中斷時會自動嘗試重新連接。順利完成重新連線時，用戶端會發出 *reconnect* 事件。

source: Logging
it: Registrazione
pt_br: Criação de Log
zh_tw: 記載

source: By default, all the logs of ``warn`` are logged. If you want to enable more logs, use the *log.setLevel* function. Supported log levels - *trace, debug, info, warn, error*.
it: Per impostazione predefinita, vengono registrati tutti i log di tipo ``warn``. Se si desidera abilitare ulteriori log, utilizzare la funzione *log.setLevel*. Livelli di log supportati - *trace, debug, info, warn, error*.
pt_br: Por padrão, todos os logs de ``warn`` são registrados. Se desejar ativar mais logs, use a função *log.setLevel*. Níveis de logs suportados - *trace, debug, info, warn, error*.
zh_tw: 依預設，會記載所有 ``warn`` 日誌。如果要啟用其他日誌，請使用 *log.setLevel* 函數。支援的記載層次 - *trace、debug、info、warn、error*。

source: Publishing events
it: Pubblicazione degli eventi
pt_br: Publicando eventos
zh_tw: 發佈事件

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
it: Gli eventi sono il meccanismo tramite cui i dispositivi pubblicano i dati in IoT Platform. Il dispositivo controlla il contenuto dell'evento e assegna un nome per ogni evento inviato.
pt_br: Eventos são o mecanismo pelo qual dispositivos publicam dados no IoT Platform. O dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.
zh_tw: 事件是裝置藉以將資料發佈到 IoT Platform 的機制。裝置可控制事件的內容，並為它傳送的每一個事件指派一個名稱。

source: When an event is received by the IoT Platform the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
it: Quando IoT Platform riceve un evento, vengono utilizzate le credenziali della connessione in cui si è ricevuto l'evento al fine di determinare da quale dispositivo è stato inviato l'evento. Con questa architettura è impossibile per un dispositivo impersonare un altro dispositivo.
pt_br: Quando um evento é recebido pelo IoT Platform, as credenciais da conexão na qual o evento foi recebido são usadas para determinar a partir de qual dispositivo o evento foi enviado. Com essa arquitetura, é impossível para um dispositivo personificar outro dispositivo.
zh_tw: 當 IoT Platform 接收事件時，會使用接收事件的連線認證來判斷是哪個裝置傳送了事件。使用此架構，裝置就不可能假冒成另一個裝置。

source: Events can be published at any of the three quality of service levels defined by the MQTT protocol. By default events will be published as QoS level 0. Please not that if you are using the Internet of Things Quickstart service, events can only be published at QoS level 0.
it: Gli eventi possono essere pubblicati a uno qualsiasi dei tre livelli di QoS (quality of service) definiti dal protocollo MQTT. Per impostazione predefinita gli eventi verranno pubblicati al livello QoS 0. Notare che, se non si sta utilizzando il servizio Quickstart Internet of Things, gli eventi possono essere pubblicati solo a livello QoS 0.
pt_br: Os eventos podem ser publicados em qualquer um dos três níveis de qualidade de serviço definidos pelo protocolo MQTT. Por padrão, os eventos serão publicados como nível de QoS 0. Observe que, se você estiver usando o serviço de Iniciação Rápida do Internet of Things, os eventos só poderão ser publicados no nível de QoS 0.
zh_tw: 發佈的事件可以是 MQTT 通訊協定所定義的三個服務品質等級之一。依預設，事件會發佈為 QoS 等級 0。請注意，如果您是使用 Internet of Things Quickstart 服務，事件只能發佈為 QoS 等級 0。

source: Events can be published by using:
it: Gli eventi possono essere pubblicati utilizzando:
pt_br: Os eventos podem ser publicados usando:
zh_tw: 可使用下列各項來發佈事件：

source: eventType - Type of event to be published e.g status, gps.
it: eventType - Il tipo di evento da pubblicare, ad esempio status, gps.
pt_br: eventType - Tipo de evento a ser publicado, por exemplo, status, gps.
zh_tw: eventType - 要發佈的事件類型，例如 status、gps。

source: eventFormat - Format of the event e.g json.
it: eventFormat - Il formato dell'evento, ad esempio json.
pt_br: eventFormat - Formato do evento, por exemplo, json.
zh_tw: eventFormat - 事件的格式，例如 json。

source: data - Payload of the event.(Must be buffer/String)
it: data - Il payload dell'evento (deve essere buffer/String)
pt_br: data - Carga útil do evento. (Deve ser buffer/Sequência)
zh_tw: data - 事件的內容。（必須是緩衝區/字串）

source: QoS - MQTT quality of service for the publish event. Supported values : 0,1,2.
it: QoS - QoS (quality of service) MQTT per l'evento di pubblicazione. Valori supportati: 0,1,2.
pt_br: QoS - Qualidade do serviço MQTT para o evento de publicação. Valores suportados : 0,1,2.
zh_tw: QoS - 發佈事件的 MQTT 服務品質。支援的值：0、1、2。

source: Handling commands
it: Gestione dei comandi
pt_br: Manipulando comandos
zh_tw: 處理指令

source: When the device client connects, it automatically subscribes to any command for this device. To process specific commands you need to register a command callback function. The device client sends *command* when a command is received. The callback function has the following properties.
it: Quando il client del dispositivo si connette, effettua automaticamente la sottoscrizione a qualsiasi comando per questo dispositivo. Per elaborare comandi specifici è necessario registrare una funzione di callback del comando. Il client di dispositivo invia *command* quando un comando viene ricevuto. La funzione di callback ha le seguenti proprietà.
pt_br: Quando o cliente do dispositivo conecta, ele automaticamente assina qualquer comando para esse dispositivo. Para processar comandos específicos, é necessário registrar uma função de retorno de chamada de comando. O cliente do dispositivo envia *command* quando um comando é recebido. A função de retorno de chamada possui as seguintes propriedades.
zh_tw: 當裝置用戶端連接時，它會自動訂閱此裝置的任何指令。若要處理特定指令，您需要登錄指令回呼函數。收到指令時，裝置用戶端會傳送 *command*。回呼函數具有下列內容。

source: commandName - name of the command invoked
it: commandName - il nome del comando richiamato
pt_br: commandName - nome do comando chamado
zh_tw: commandName - 呼叫的指令名稱

source: format - e.g json, xml
it: format - il formato, ad es. json, xml
pt_br: formato - por exemplo, json, xml
zh_tw: 格式 - 例如 json、xml

source: payload - payload for the command
it: payload – il payload per il comando
pt_br: payload - carga útil do comando
zh_tw: payload - 指令的內容

source: topic - actual topic where the command was received
it: topic - argomento reale in cui il comando è stato ricevuto
pt_br: topic - tópico real no qual o comando foi recebido
zh_tw: topic - 收到指令的實際主題

source: Handling errors
it: Gestione degli errori
pt_br: Tratamento de Erros
zh_tw: 處理錯誤

source: When the device clients encounters an error, it emits an *error* event.
it: Quando il client del dispositivo rileva un errore, emette un evento *error*.
pt_br: Quando o cliente do dispositivo encontra um erro, ele emite um evento *error*.
zh_tw: 當裝置用戶端遇到錯誤時，它會發出 *error* 事件。

source: Disconnect Client
it: Disconnetti client
pt_br: Desconectar Cliente
zh_tw: 中斷連接用戶端

source: Disconnects the client and releases the connections
it: Disconnette il client e rilascia le connessioni
pt_br: Desconecta o cliente e libera as conexões
zh_tw: 切斷用戶端並釋放連線
