Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/dashboard.po
Languages: ja, pt_br, zh_tw

source: Connecting and Using a Gateway Device using the IoT Platform Dashboard
ja: IoT Platform ダッシュボードでのゲートウェイ・デバイスの接続と使用
pt_br: Conectando e Usando um Dispositivo de Gateway usando o Painel do IoT Platform
zh_tw: 使用 IoT Platform 儀表板來連接及使用閘道裝置

source: This task describes the process of connecting a gateway device, which connects itself, and devices behind the gateway, and sends data from itself and devices behind it to the IoT Platform.
ja: このタスクでは、ゲートウェイ・デバイスを接続するプロセスについて説明します。ゲートウェイ・デバイスは、ゲートウェイ自体とゲートウェイの内側に存在するデバイスを IoT Platform に接続し、ゲートウェイ自体のデータとそれらのデバイスからのデータを IoT Platform に送信します。
pt_br: Esta tarefa descreve o processo de conexão a um dispositivo de gateway, que conecta a si mesmo, e dispositivos atrás do gateway, e envia dados a partir de si e de dispositivos atrás dele para o IoT Platform.
zh_tw: 此作業說明連接閘道裝置的程序，而此程序會連接閘道裝置本身及閘道後面的裝置，並將資料從閘道裝置本身及其後面的裝置傳送至 IoT Platform。

source: Gateways can also subscribe to commands on behalf of devices connected to the gateway.
ja: ゲートウェイは、ゲートウェイに接続しているデバイスの代わりに、コマンドをサブスクライブすることもできます。
pt_br: Gateways também podem assinar comandos em nome de dispositivos conectados ao gateway.
zh_tw: 閘道也可以代表連接至閘道的裝置訂閱指令。

source: Prerequisites
ja: 前提条件
pt_br: Pré-requisitos
zh_tw: 必要條件

source: This task assumes that you already have an IoT Platform organization.
ja: このタスクでは、IoT Platform の組織が既に存在することを前提としています。
pt_br: Esta tarefa assume que você já tenha uma organização do IoT Platform.
zh_tw: 此作業假設您已有 IoT Platform 組織。

source: Procedure
ja: 手順
pt_br: Procedimento
zh_tw: 程序

source: Creating a device type for your gateway: A gateway has more rights than a normal device, and can send and receive device data on behalf of other devices.
ja: ゲートウェイのデバイス・タイプを作成します。ゲートウェイには通常のデバイスより多くの権限があるため、他のデバイスの代わりにデバイスのデータを送受信できます。
pt_br: Criando um tipo de dispositivo para seu gateway: um gateway possui mais direitos do que um dispositivo normal e pode enviar e receber dados do dispositivo em nome de outros dispositivos.
zh_tw: 建立閘道的裝置類型：閘道擁有超過一般裝置的權限，而且可以代表其他裝置傳送及接收裝置資料。

source: In your organization dashboard 'Devices' tab, select the 'Device Types' sub-tab. Click 'Create Type'. Click 'Create gateway type', and follow the instructions in the flow, including adding any device properties and metadata. Click 'Create' to complete the flow and create the device type.
ja: 組織のダッシュボードの「デバイス」タブで、「デバイス・タイプ」サブタブを選択します。「タイプの作成」をクリックします。「ゲートウェイ・タイプの作成」をクリックし、フローの指示に従って、デバイスのプロパティーやメタデータを追加したりします。「作成」をクリックしてフローを完了し、デバイス・タイプを作成します。
pt_br: Na guia 'Dispositivos' do painel de sua organização, selecione a subguia 'Tipos de Dispositivo'. Clique em 'Criar Tipo'. Clique em 'Criar tipo de gateway' e siga as instruções no fluxo, incluindo quaisquer propriedades de dispositivo e metadados. Clique em 'Criar' para concluir o fluxo e criar o tipo de dispositivo.
zh_tw: 在組織儀表板的「裝置」標籤中，選取「裝置類型」子標籤。按一下「建立類型」。按一下「建立閘道類型」，並遵循流程中的指示，包括新增任何裝置內容和 meta 資料。按一下「建立」來完成流程並建立裝置類型。

source: To create a gateway device:
ja: ゲートウェイ・デバイスを作成するには、以下のようにします。
pt_br: Para criar um dispositivo de gateway:
zh_tw: 若要建立閘道裝置，請執行下列動作：

source: In your organization dashboard 'Devices' tab, select the 'Browse' sub-tab and click 'Add device'. Select the gateway device type created in the previous step. Follow the 'Add device' flow, entering the mandatory *deviceId* property, and any other optional properties.
ja: 組織のダッシュボードの「デバイス」タブで、「参照」サブタブを選択し、「デバイスの追加」をクリックします。前の手順で作成したゲートウェイのデバイス・タイプを選択します。「デバイスの追加」のフローにしたがって、必須の *deviceId* プロパティーや他のオプション・プロパティーを入力します。
pt_br: Na guia 'Dispositivos' do painel de sua organização, selecione a subguia 'Procurar' e clique em 'Incluir dispositivo'. Selecione o tipo de dispositivo de gateway criado na etapa anterior. Siga o fluxo 'Incluir dispositivo', inserindo a propriedade *deviceId* obrigatória e quaisquer outras propriedades opcionais.
zh_tw: 在組織儀表板的「裝置」標籤中，選取「瀏覽」子標籤，然後按一下「新增裝置」。選取前一個步驟中建立的閘道裝置類型。遵循「新增裝置」流程，並輸入必要的 *deviceId* 內容，以及任何其他選用內容。

source: After creating a gateway device, the authentication token provided should be saved for use in configuring the gateway to connect to the IoT Platform.
ja: ゲートウェイ・デバイスを作成したら、表示された認証トークンを保存する必要があります。後で IoT Platform に接続するようにゲートウェイを構成するときに使用します。
pt_br: Após criar um dispositivo de gateway, o token de autenticação fornecido deve ser salvo para utilização na configuração do gateway para conexão com o IoT Platform.
zh_tw: 在建立閘道裝置之後，應該儲存提供的鑑別記號，以用於將閘道配置為連接至 IoT Platform 的作業。

source: Connecting the gateway to the IoT Platform.
ja: ゲートウェイを IoT Platform に接続します。
pt_br: Conectando o gateway ao IoT Platform.
zh_tw: 將閘道連接至 IoT Platform。

source: There are a range of recipes available for connecting devices to the IoT Platform platform. Connecting a gateway requires the same steps as connecting a normal device with one exception. When connecting a normal device, the clientId uses the following format:
ja: デバイスを IoT Platform に接続するためのさまざまなレシピがあります。ゲートウェイを接続するには、通常のデバイスを接続する場合と同じ手順が必要ですが、1 つだけ例外があります。通常のデバイスを接続する場合は、以下の形式の clientId を使用します。
pt_br: Há uma variedade de receitas disponíveis para conexão de dispositivos à plataforma do IoT Platform. A conexão de um gateway requer as mesmas etapas da conexão de um dispositivo normal com uma exceção. Ao conectar um dispositivo normal, o clientId usa o seguinte formato:
zh_tw: 有各種秘訣可用來將裝置連接至 IoT Platform 平台。連接閘道需要與連接一般裝置相同的步驟，但有一個例外。當連接一般裝置時，clientId 會使用下列格式：

source: When connecting a gateway device, the clientId replaces ``d`` with ``g``:
ja: ゲートウェイ・デバイスを接続する場合は、clientId の ``d`` を ``g`` に置き換えます。
pt_br: Ao conectar um dispositivo de gateway, o clientId substitui ``d`` por ``g``:
zh_tw: 當連接閘道裝置時，clientId 會將 ``d`` 取代為 ``g``：

source: Set up devices that are connected to the gateway and are to be connected to the IoT Platform:
ja: ゲートウェイを経由して IoT Platform に接続するデバイスをセットアップします。
pt_br: Os dispositivos de configuração que estão conectados ao gateway e devem ser conectados ao IoT Platform:
zh_tw: 設定連接至閘道並將連接至 IoT Platform 的裝置：

source: Create a device type for the device or devices which are to connect through the gateway. The devices should have *gatewayId* and *gatewayTypeId* properties matching the *deviceId* and *deviceTypeId* of the gateway they are connecting through. Add the devices which are connected to the gateway to the IoT Platform.
ja: ゲートウェイを経由して接続するデバイスのデバイス・タイプを作成します。それらのデバイスの *gatewayId* プロパティーと *gatewayTypeId* プロパティーは、経由するゲートウェイの *deviceId* と *deviceTypeId* に一致しなければなりません。ゲートウェイに接続するデバイスを IoT Platform に追加します。
pt_br: Crie um tipo de dispositivo para os dispositivos que devem se conectar por meio do gateway. Os dispositivos devem ter as propriedades *gatewayId* e *gatewayTypeId* correspondentes ao *deviceId* e *deviceTypeId* do gateway por meio do qual eles estão se conectando. Inclua os dispositivos que estão conectados ao gateway no IoT Platform.
zh_tw: 針對將透過閘道連接的一個或多個裝置建立裝置類型。裝置具有的 *gatewayId* 和 *gatewayTypeId* 內容應該符合透過其連接它們之閘道的 *deviceId* 和 *deviceTypeId*。將連接至閘道的裝置新增至 IoT Platform。

source: The devices connected to the gateway should now be visible in your IoT Platform organization dashboard.
ja: ゲートウェイに接続するデバイスが IoT Platform の組織のダッシュボードに表示されます。
pt_br: Os dispositivos conectados ao gateway agora devem estar visíveis no painel de sua organização do IoT Platform.
zh_tw: 現在應該可在 IoT Platform 組織儀表板中看到連接至閘道的裝置。
