Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: de, ja, pt_br, zh_cn, zh_tw

source: Java Client Library - Managed Gateway
de: Java Client Library - Verwaltetes Gateway
ja: Java クライアント・ライブラリー - 管理対象ゲートウェイ
pt_br: Java Client Library - Gateway gerenciado
zh_cn: Java 客户机库 - 受管网关
zh_tw: Java 用戶端程式庫 - 受管理閘道

source: Introduction
de: Einführung
ja: 概要
pt_br: Introdução
zh_cn: 简介
zh_tw: 簡介

source: Gateway plays an important role in the device management of devices connected to it. Many of these devices will be too basic to be managed. For a managed device, the device management agent on the gateway acts as a proxy for the connected device. The protocol used by the gateway to manage the connected devices is arbitrary, and there need not be a device management agent on the connected devices. It is only necessary for the gateway to ensure that devices connected to it perform their responsibilities as managed devices, performing any translation and processing required to achieve this. The management agent in gateway will act as more than a transparent tunnel between the attached device and the Watson IoT Platform.
de: Das Gateway spielt eine wichtige Rolle bei der Verwaltung der mit ihm verbundenen Geräte. Viele dieser Geräte sind zu einfach für eine Verwaltung. Bei einem verwalteten Gerät fungiert der Gerätemanagementagent im Gateway als Proxy für das verbundene Gerät. Als Protokoll, das das Gateway zum Verwalten der verbundenen Geräte verwendet, kann ein beliebiges Protokoll verwendet werden und auf den verbundenen Geräten muss sich kein Gerätemanagementagent befinden. Das Gateway muss lediglich sicherstellen, dass die mit ihm verbundenen Geräte die für verwaltete Geräte erforderlichen Aktionen ausführen, und die hierfür gegebenenfalls notwendigen Umsetzungs- und Verarbeitungsschritte ausführen. Die Funktionen des Managementagenten im Gateway gehen über die Rolle eines transparenten Tunnels zwischen dem angeschlossenen Gerät und Watson IoT Platform hinaus.
ja: ゲートウェイは、それに接続されたデバイスのデバイス管理で重要な役割を果たします。それらのデバイスの多くは、過度に初歩的なものであるために管理できません。管理対象デバイスでは、ゲートウェイのデバイス管理エージェントが、接続されたデバイスのプロキシーとして機能します。ゲートウェイは接続されたデバイスを任意のプロトコルを使用して管理することができ、接続されたデバイスにデバイス管理エージェントが存在する必要はありません。ゲートウェイで必要なのは、それに接続されたデバイスが管理対象デバイスとしての役割を果たし、そのために必要な変換や処理を実行していることを確認することだけです。ゲートウェイの管理エージェントの機能は、接続されているデバイスと Watson IoT Platform の間で透過的なトンネルとなることだけではありません。
pt_br: O Gateway desempenha uma função importante no gerenciamento de dispositivo dos dispositivos conectados a ele. Muitos desses dispositivos serão muito básicos para serem gerenciados. Para um dispositivo gerenciado, o agente de gerenciamento de dispositivo no gateway atua como um proxy para o dispositivo conectado. O protocolo usado pelo gateway para gerenciar os dispositivos conectados é arbitrário e não precisa haver um agente de gerenciamento de dispositivos nos dispositivos conectados. Só é necessário que o gateway assegure que os dispositivos conectados a ele executem suas responsabilidades como dispositivos gerenciados, executando qualquer conversão e processamento necessários para alcançar isso. O agente de gerenciamento no gateway atuará como mais do que um túnel transparente entre o dispositivo anexo e o Watson IoT Platform.
zh_cn: 网关在对连接到自身的设备进行设备管理方面具有重要作用。其中许多设备都异常简单而难以管理。对于受管设备，网关上的设备管理代理程序充当已连接设备的代理。网关用于管理已连接设备的协议并不固定，因此已连接设备上无需具有设备管理代理程序。网关只需确保已连接设备能够履行作为受管设备的职责即可，它可以通过执行所需的任何转换和处理来实现这一点。网关中的管理代理程序不仅仅是充当已连接设备和 Watson IoT Platform 之间的透明隧道。
zh_tw: 閘道在對與其連接的裝置進行裝置管理方面扮演著重要角色。這些裝置中有許多裝置會因太基本而不受管理。對於受管理裝置，閘道上的裝置管理代理程式會充當所連接裝置的 Proxy。閘道用於管理所連接裝置的通訊協定是任意的，且在所連接的裝置上不需要裝置管理代理程式。閘道只需要確保與它連接的裝置履行其作為受管理裝置的責任，執行任何必要的轉換及處理以達成此目的。閘道中的管理代理程式不僅僅是充當所連接的裝置與 Watson IoT Platform 之間的透明通道。

source: For example, It is unlikely that a device connected to a gateway will be able to download the firmware itself. In this case, the gateway’s device management agent will intercept the request to download the firmware and perform the download to its own storage. Then, when the device is instructed to perform the upgrade, the gateway’s device management agent will push the firmware to the device and update it.
de: Beispielsweise kann ein mit einem Gateway verbundenes Gerät in der Regel die Firmware nicht selbst herunterladen. In diesem Fall fängt der Gerätemanagementagent des Gateways die Anforderung zum Herunterladen der Firmware ab und lädt die Firmware in den eigenen Speicher herunter. Wenn dann das Gerät die Anweisung zum Durchführen des Upgrades erhält, sendet der Gerätemanagementagent des Gateways die Firmware per Push-Operation an das Gerät und führt die Aktualisierung durch.
ja: 例えば、ゲートウェイに接続されたデバイス自体がファームウェアをダウンロードできるようになる可能性はわずかです。そのようなケースでは、ゲートウェイのデバイス管理エージェントがファームウェアをダウンロードするリクエストを代行受信し、独自のストレージにダウンロードします。その後、デバイスにアップグレードを実行するようにとの指示が与えられると、ゲートウェイのデバイス管理エージェントはファームウェアをデバイスにプッシュして更新します。
pt_br: Por exemplo, é improvável que um dispositivo conectado a um gateway poderá fazer download do firmware sozinho. Neste caso, o agente de gerenciamento de dispositivos do gateway interceptará a solicitação de download do firmware e executará o download em seu próprio armazenamento. Em seguida, o dispositivo é instruído a executar o upgrade, o agente de gerenciamento de dispositivo do gateway enviará por push o firwmare para o dispositivo e o atualizará.
zh_cn: 例如，连接到网关的设备不太可能会自行下载固件。在此情况下，网关的设备管理代理程序将拦截下载固件的请求，并将其下载到自己的存储器。然后，当设备收到执行升级的指示时，网关的设备管理代理程序会将固件推送到该设备并进行更新。
zh_tw: 例如，連接至閘道的裝置不太可能自己下載韌體。在此情況下，閘道的裝置管理代理程式即會截取下載韌體的要求，並將韌體下載至它自己的儲存體。然後，在系統指示裝置執行升級時，閘道的裝置管理代理程式即會將韌體推送至裝置並更新它。

source: This section contains information on how gateways (and attached devices) can connect to the Internet of Things Platform Device Management service using Java and perform device management operations like firmware update, location update, and diagnostics update.
de: Dieser Abschnitt enthält Informationen dazu, wie Gateways (und angeschlossene Geräte) eine Verbindung zum Gerätemanagementservice von Internet of Things Platform über Java herstellen und Gerätemanagementoperationen wie Firmware-, Positions- und Diagnose-Updates ausführen können.
ja: このセクションには、Java を使用してゲートウェイ (および接続されているデバイス) を Internet of Things Platform デバイス管理サービスに接続する方法や、ファイアウォールの更新やロケーションの更新、診断の更新などのデバイス管理操作を実行する方法に関する情報が記載されています。
pt_br: Esta seção contém informações sobre como os gateways (e dispositivos conectados) podem se conectar ao serviço Internet of Things Platform Device Management usando Java e executar operações de gerenciamento de dispositivos como atualização de firmware, atualização de local e atualização de diagnósticos.
zh_cn: 本部分包含的信息包括网关（和已连接设备）如何使用 Java 连接到“Internet of Things Platform 设备管理”服务以及执行设备管理操作，例如固件更新、位置更新和诊断更新。
zh_tw: 本節包含閘道（及所連接的裝置）如何才能使用 Java 來連接至「Internet of Things Platform 裝置管理」服務，並執行裝置管理作業（如韌體更新、位置更新以及診斷程式更新）的相關資訊。

source: Create DeviceData
de: DeviceData erstellen
ja: DeviceData の作成
pt_br: Crie DeviceData
zh_cn: 创建 DeviceData
zh_tw: 建立 DeviceData

source: The `device model <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ describes the metadata and management characteristics of a device or a gateway. The device database in the IBM Watson Internet of Things Platform is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the IBM Watson Internet of Things Platform, the device database is updated, making the information available to applications.
de: Vom Gerätemodell <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ werden die Gerätemetadaten und Managementeigenschaften eines Geräts oder Gateways beschrieben. Die Gerätedatenbank in IBM Watson Internet of Things Platform ist die Hauptquelle für Geräteinformationen. Von Anwendungen und verwalteten Geräte können Aktualisierungen an die Datenbank gesendet werden, zum Beispiel zur Position oder zum Fortschritt eines Firmware-Updates. Sobald diese Aktualisierungen von IBM Watson Internet of Things Platform empfangen werden, wird die Gerätedatenbank aktualisiert und die Informationen werden den Anwendungen zur Verfügung gestellt.
ja: `デバイス・モデル <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ とは、デバイスまたはゲートウェイのメタデータおよび管理特性を記述するものです。IBM Watson Internet of Things Platform において、デバイス・データベースはデバイス情報のマスター・ソースです。アプリケーションおよび管理対象デバイスは、場所やファームウェア更新の進行状況などの更新情報をデータベースに送信できます。IBM Watson Internet of Things Platform がこのような更新情報を受け取ると、デバイス・データベースが更新され、アプリケーションでそれらの情報を使用できるようになります。
pt_br: O modelo do dispositivo <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ descreve os metadados e as características de gerenciamento de um dispositivo ou de um gateway. O banco de dados do dispositivo no IBM Watson Internet of Things Platform é a principal fonte de informações sobre o dispositivo. Os aplicativos e dispositivos gerenciados podem enviar atualizações para o banco de dados, como um local ou o progresso de uma atualização de firmware. Quando essas atualizações são recebidas pelo IBM Watson Internet of Things Platform, o banco de dados do dispositivo é atualizado, tornando as informações disponíveis aos aplicativos.
zh_cn: `设备模型 <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ 描述了设备或网关的元数据和管理特征。IBM Watson Internet of Things Platform 中的设备数据库是设备信息的主要来源。应用程序和受管设备可以向数据库发送更新（例如，位置或固件更新进度）。IBM Watson Internet of Things Platform 收到这些更新后，设备数据库将进行更新，这样应用程序便可以使用这些信息。
zh_tw: `裝置模型 <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ 說明裝置或閘道的 meta 資料及管理性質。IBM Watson Internet of Things Platform 中的裝置資料庫是裝置資訊的主要來源。應用程式及受管理裝置能夠傳送更新至資料庫，如：位置或韌體更新的進度。IBM Watson Internet of Things Platform 收到這些更新之後，即會更新裝置資料庫，讓資訊可供應用程式使用。

source: The device model in the WIoTP client library is represented as DeviceData and to create a DeviceData one needs to create the following objects,
de: Das Gerätemodell in der WIoTP-Clientbibliothek wird als DeviceData und zum Erstellen von DeviceData dargestellt, das zur Erstellung der folgenden Objekte erforderlich ist.
ja: WIoTP クライアント・ライブラリーのデバイス・モデルは DeviceData として表されます。DeviceData を作成するには、以下のオブジェクトを作成する必要があります。
pt_br: O modelo de dispositivo na biblioteca do cliente WIoTP é representado como DeviceData e para criar um DeviceData, é preciso criar os objetos a seguir,
zh_cn: WIoTP 客户机库中的设备模型以 DeviceData 表示，要创建 DeviceData，用户需要创建以下对象：
zh_tw: WIoTP 用戶端程式庫中的裝置模型會以 DeviceData 代表，若要建立 DeviceData，則需要建立下列物件：

source: DeviceInfo (Optional)
ja: DeviceInfo (オプション)
pt_br: DeviceInfo (Opcional)
zh_cn: DeviceInfo（可选）
zh_tw: DeviceInfo（選用）

source: DeviceLocation (Optional, required only if the device wants to be notified about the location set by the application through Watson IoT Platform API)
de: DeviceLocation (optional, nur erforderlich, wenn das Gerät eine Benachrichtigung über die Position erhalten soll, die von der Anwendung über die Watson IoT Platform-API festgelegt wird)
ja: DeviceLocation (オプション、Watson IoT Platform API を使用してアプリケーションが設定したロケーションについてデバイスに通知する場合にのみ必須です)
pt_br: DeviceLocation (Opcional, necessário somente se o dispositivo desejar ser notificado sobre o local configurado pelo aplicativo por meio da API do Watson IoT Platform)
zh_cn: DeviceLocation（可选，仅当设备想要通过 Watson IoT Platform API 接收有关应用程序所设定位置的通知时为必需)
zh_tw: DeviceLocation（選用，只有在裝置想要透過 Watson IoT Platform API 收到有關應用程式設定的位置之通知時才為必要項目）

source: DeviceFirmware (Optional)
ja: DeviceFirmware (オプション)
pt_br: DeviceFirmware (Opcional)
zh_cn: DeviceFirmware（可选）
zh_tw: DeviceFirmware（選用）

source: DeviceMetadata (optional)
ja: DeviceMetadata (オプション)
pt_br: DeviceMetadata (opcional)
zh_cn: DeviceMetadata（可选)
zh_tw: DeviceMetadata（選用）

source: The following code snippet shows how to create the object DeviceInfo along with DeviceMetadata with sample data:
de: Das folgende Code-Snippet zeigt die Erstellung des Objekts DeviceInfo zusammen mit dem Objekt DeviceMetadata mit Beispieldaten:
ja: 以下のコード・スニペットは、サンプル・データを使用してオブジェクト DeviceInfo を DeviceMetadata と一緒に作成する方法を示しています。
pt_br: O fragmento de código a seguir mostra como criar o DeviceInfo do objeto junto com o DeviceMetadata com dados de amostra:
zh_cn: 以下代码片段显示如何使用样本数据创建对象 DeviceInfo 以及 DeviceMetadata：
zh_tw: 下列程式碼 Snippet 顯示如何使用取樣資料，建立物件 DeviceInfo 及 DeviceMetadata：

source: The following code snippet shows how to create the DeviceData object with the above created DeviceInfo and DeviceMetadata objects:
de: Das folgende Code-Snippet zeigt die Erstellung der DeviceData zusammen mit den oben erstellten DeviceInfo- und DeviceMetadata-Objekten:
ja: 以下のコード・スニペットは、DeviceData オブジェクトを、上記で作成した DeviceInfo オブジェクトおよび DeviceMetadata オブジェクトと一緒に作成する方法を示しています。
pt_br: O fragmento de código a seguir mostra como criar o objeto DeviceData com os objetos DeviceInfo e DeviceMetadata criados anteriormente:
zh_cn: 以下代码片段显示如何通过上面创建的 DeviceInfo 和 DeviceMetadata 对象来创建 DeviceData 对象：
zh_tw: 下列程式碼 Snippet 顯示如何使用上方建立的 DeviceInfo 及 DeviceMetadata 物件來建立 DeviceData 物件：

source: Each gateway and attached devices must have its own DeviceData to represent itself in the Platform. In the case of gateway, the DeviceData will be passed to the library as part of constructing the ManagedGateway instance, and in the case of attached device, the DeviceData will be passed as part of the sendDeviceManageRequest().
de: Jedes Gateway und die angeschlossenen Geräte müssen über eigene DeviceData-Objekte verfügen, die sie in der Plattform darstellen. Bei einem Gateway wird DeviceData im Rahmen der Erstellung der ManagedGateway-Instanz an die Bibliothek übergeben; bei einem angeschlossenen Gerät wird DeviceData als Teil der Anforderung sendDeviceManageRequest() übergeben.
ja: 各ゲートウェイおよび接続されているデバイスには、Platform でそれらを表すための独自の DeviceData が必要です。ゲートウェイの場合、DeviceData は ManagedGateway インスタンスを構成する処理の一部としてライブラリーに渡されます。接続されているデバイスの場合、DeviceData は sendDeviceManageRequest() の一部として渡されます。
pt_br: Cada gateway e dispositivos anexos deve ter seu próprio DeviceData para representar a si mesmo no Platform. No caso do gateway, o DeviceData será transmitido para a biblioteca como parte da construção da instância ManagedGateway. No caso do dispositivo anexo, o DeviceData será transmitido como parte de sendDeviceManageRequest().
zh_cn: 每个网关和已连接设备都必须具有自己的 DeviceData 以在该 Platform 中表示自身。对于网关，会在构造 ManagedGateway 实例的过程中将 DeviceData 传递到库，对于已连接设备，会作为 sendDeviceManageRequest() 的一部分传递 DeviceData。
zh_tw: 每個閘道及所連接的裝置皆必須具有它自己的 DeviceData，用於在平台中代表它自己。若為閘道，則會將 DeviceData 作為建構 ManagedGateway 實例的一部分傳遞至程式庫；若為連接的裝置，則會將 DeviceData 作為 sendDeviceManageRequest() 的一部分來傳遞。

source: Construct ManagedGateway
de: ManagedGateway erstellen
ja: ManagedGateway の構成
pt_br: Construir ManagedGateway
zh_cn: 构造 ManagedGateway
zh_tw: 建構 ManagedGateway

source: ManagedGateway - A gateway class that connects the gateway as managed gateway to IBM Watson Internet of Things Platform and enables the gateway to perform one or more Device Management operations for itself and attached devices. Also the ManagedGateway instance can be used to do normal gateway operations like publishing gateway events, attached device events and listening for commands from application.
de: ManagedGateway - Eine Gateway-Klasse, die das Gateway als verwaltetes Gateway mit IBM Watson Internet of Things Platform verbindet und es dem Gateway ermöglicht, eine oder mehrere Gerätemanagementoperationen für sich und angeschlossene Geräte auszuführen. Darüber hinaus kann die ManagedGateway-Instanz dazu verwendet werden, normale Gateway-Operationen auszuführen, wie z. B. das Publizieren von Gateway-Ereignissen oder Ereignissen für angeschlossene Geräte und die Empfangsbereitschaft für Befehle von Anwendungen.
ja: ManagedGateway - ゲートウェイを管理対象ゲートウェイとして IBM Watson Internet of Things Platform に接続して、ゲートウェイがそれ自体のためおよび接続されているデバイスのために 1 つ以上のデバイス管理操作を実行できるようにするゲートウェイ・クラス。また、ManagedGateway インスタンスを使用して、ゲートウェイ・イベントや接続されているデバイス・イベントのパブリッシュ、およびアプリケーションからのコマンドの listen などの、通常のゲートウェイ操作を行うこともできます。
pt_br: ManagedGateway - Uma classe de gateway que conecta o gateway como gateway gerenciado ao IBM Watson Internet of Things Platform e permite que o gateway execute uma ou mais operações de Gerenciamento de dispositivo para si mesmo e os dispositivos anexos. Além disso, a instância ManagedGateway pode ser usada para fazer operações de gateway normais, como publicar eventos de gateway, eventos de dispositivos anexos e o atendimento a comandos do aplicativo.
zh_cn: ManagedGateway - 这是一个网关类，用于将网关作为受管网关连接到 IBM Watson Internet of Things Platform，并使网关能够为自身和已连接设备执行一个或多个设备管理操作。ManagedGateway 实例还可以用于执行普通的网关操作，例如发布网关事件、已连接设备事件和侦听来自应用程序的命令。
zh_tw: ManagedGateway - 一種閘道類別，可將閘道作為受管理閘道連接至 IBM Watson Internet of Things Platform，並允許閘道為它自己以及連接的裝置執行一項以上「裝置管理」作業。此外，ManagedGateway 實例也可用來執行一般閘道作業，如發佈閘道事件、連接的裝置事件以及接聽來自應用程式的指令。

source: ManagedGateway exposes 2 different constructors to support different user patterns,
de: ManagedGateway stellt 2 verschiedene Konstruktoren zur Unterstützung unterschiedlicher Benutzermuster bereit
ja: ManagedGateway は、異なる複数のユーザー・パターンをサポートする 2 つの異なるコンストラクターを公開します。
pt_br: ManagedGateway expõe 2 construtores diferentes para suportar diferentes padrões do usuário,
zh_cn: ManagedGateway 提供 2 种不同的构造方法，用于支持不同的用户模式。
zh_tw: ManagedGateway 會利用 2 個不同的建構子來支援不同的使用者型樣。

source: **Constructor One**
de: **Konstruktor 1**
ja: **コンストラクター 1**
pt_br: **Construtor Um**
zh_cn: **构造方法 1**
zh_tw: **建構子一**

source: Constructs a ManagedGateway instance by accepting the DeviceData and the following properties,
de: Erstellung einer ManagedGateway-Instanz durch Akzeptieren der DeviceData und der folgenden Eigenschaften
ja: DeviceData と以下のプロパティーを受け入れることにより、ManagedGateway インスタンスを構成します。
pt_br: Constrói uma instância ManagedGateway aceitando o DeviceData e as propriedades a seguir,
zh_cn: 通过接受 DeviceData 和以下属性来构造 ManagedGateway 实例：
zh_tw: 透過接受 DeviceData 及下列內容，來建構 ManagedGateway 實例：

source: Organization-ID - Your organization ID.
de: Organisations-ID - Ihre Organisations-ID.
ja: Organization-ID - 組織 ID。
pt_br: Organization-ID - O ID da organização.
zh_cn: Organization-ID - 贵组织的标识。
zh_tw: Organization-ID - 組織 ID。

source: Gateway-Type - The type of your gateway device.
de: Gateway-Typ - Der Typ des Gateway-Geräts.
ja: Gateway-Type - ゲートウェイ・デバイスのタイプ。
pt_br: Gateway-Type - O tipo do seu dispositivo de gateway.
zh_cn: Gateway-Type - 网关设备的类型。
zh_tw: Gateway-Type - 閘道裝置的類型。

source: Gateway-ID - The ID of your gateway device.
de: Gateway-ID - Die ID des Gateway-Geräts.
ja: Gateway-ID - ゲートウェイ・デバイスの ID。
pt_br: Gateway-ID - O ID do seu dispositivo de gateway.
zh_cn: Gateway-ID - 网关设备的标识。
zh_tw: Gateway-ID - 閘道裝置的 ID。

source: Authentication-Method - Method of authentication (The only value currently supported is "token").
de: Authentifizierungsmethode - Die Methode der Authentifizierung (der einzige derzeit unterstützte Wert ist "token").
ja: Authentication-Method - 認証方式 (現在サポートされている値は "token" のみ)。
pt_br: Authentication-Method - O método de autenticação (o único valor atualmente suportado é "token").
zh_cn: Authentication-Method - 认证方法（当前唯一支持的值为“token”）。
zh_tw: Authentication-Method - 鑑別的方法（目前唯一支援的值是 "token"）。

source: Authentication-Token - API key token
de: Authentifizierungstoken - API-Schlüsseltoken
ja: Authentication-Token - API キー・トークン
pt_br: Authentication-Token - O token da chave de API
zh_cn: Authentication-Token - API 密钥令牌
zh_tw: Authentication-Token - API 金鑰記號

source: All these properties are required to interact with the IBM Watson Internet of Things Platform.
de: Alle diese Eigenschaften sind für die Interaktion mit IBM Watson Internet of Things Platform erforderlich.
ja: これらのプロパティーはすべて、IBM Watson Internet of Things Platform と対話するために必要です。
pt_br: Todas essas propriedades são necessárias para interagir com o IBM Watson Internet of Things Platform.
zh_cn: 需要所有这些属性才能与 IBM Watson Internet of Things Platform 交互。
zh_tw: 需要所有這些內容，才能與 IBM Watson Internet of Things Platform 互動。

source: The following code shows how to create a ManagedGateway instance:
de: Der folgende Code zeigt Ihnen die Erstellung einer ManagedGateway-Instanz:
ja: 以下のコードでは、ManagedGateway インスタンスの作成方法を示しています。
pt_br: O código a seguir mostra como criar uma instância ManagedGateway:
zh_cn: 以下代码显示如何创建 ManagedGateway 实例：
zh_tw: 下列程式碼顯示如何建立 ManagedGateway 實例：

source: **Constructor Two**
de: **Konstruktor Zwei**
ja: **コンストラクター 2**
pt_br: **Construtor Dois**
zh_cn: **构造方法 2**
zh_tw: **建構子二**

source: Construct a ManagedGateway instance by accepting the DeviceData and the MqttClient instance. This constructor requires the DeviceData to be created with additional device attributes like Device Type and Device Id as follows:
de: Erstellung einer ManagedGateway-Instanz durch Akzeptieren der DeviceData- und der MqttClient-Instanz. Für diesen Konstruktor ist erforderlich, dass DeviceData mit zusätzlichen Geräteattributen (wie Gerätetyp und Geräte-ID) wie folgt erstellt wird:
ja: DeviceData および MqttClient インスタンスを受け入れることにより、ManagedGateway インスタンスを構成します。以下のとおり、このコンストラクターについては、デバイス・タイプやデバイス ID などの追加のデバイス属性を使用して、DeviceData を作成する必要があります。
pt_br: Construa uma instância ManagedGateway aceitando o DeviceData e a instância MqttClient. Este construtor requer que os DeviceData sejam criados com atributos de dispositivo adicionais, como Tipo de Dispositivo e ID de Dispositivo, conforme a seguir:
zh_cn: 通过接受 DeviceData 和 MqttClient 实例来构造 ManagedGateway 实例。该构造方法要求使用其他设备属性（如设备类型和设备标识）来创建 DeviceData，如下所示：
zh_tw: 透過接受 DeviceData 及 MqttClient 實例，來建構 ManagedGateway 實例。此建構子需要 DeviceData 以「裝置類型」及「裝置 ID」等其他裝置屬性建立，如下所示：

source: Note this constructor helps the custom device users to create a ManagedGateway instance with the already created and connected MqttClient instance to take advantage of device management operations. But we recommend the users to use the library for all the device functionalities.
de: Hinweis: diese Konstruktor hilft Benutzern von Hilfetexten Geräte, eine ManagedGateway-Instanz mit der bereits erstellten und verbundenen MqttClient-Instanz zu erstellen, um so die Operationen zum Gerätemanagement ausnutzen zu können. Wir empfehlen jedoch, dass Benutzer die Bibliothek für sämtliche Gerätefunktionalität verwenden.
ja: このコンストラクターは、既に作成および接続されている MqttClient インスタンスとともにカスタム・デバイス・ユーザーが ManagedGateway インスタンスを作成して、デバイス管理操作を利用できるようにします。しかし、ユーザーがすべてのデバイス機能用のライブラリーを使用することをお勧めします。
pt_br: Observe que este construtor ajuda os usuários de dispositivo customizado a criarem uma instância ManagedGateway com a instância MqttClient já criada e conectada para aproveitar as operações de gerenciamento de dispositivo. Mas nós recomendamos que os usuários utilizem a biblioteca para todas as funcionalidades do dispositivo.
zh_cn: 请注意，该构造方法有助于定制设备用户使用已创建和已连接的 MqttClient 实例来创建 ManagedGateway 实例，以利用设备管理操作。但我们建议用户对所有设备功能均使用该库。
zh_tw: 請注意，此建構子可協助自訂裝置使用者，使用已建立且連接的 MqttClient 實例來建立 ManagedGateway 實例，以利用裝置管理作業。但是，對於所有裝置功能，我們建議使用者使用程式庫。

source: Manage request - gateway
de: Managementanforderung - Gateway
ja: 管理リクエスト - ゲートウェイ
pt_br: Gerenciar solicitação - gateway
zh_cn: 管理请求 - 网关
zh_tw: 管理要求 - 閘道
