Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: de, ja, pt_br, zh_cn, zh_tw

source: If an error occurs during Firmware Update, updateStatus should be set to one of the error status values:
de: Wenn während des Firmware-Updates ein Fehler auftritt, muss für updateStatus einer der Fehlerstatuswerte festgelegt werden:
ja: ファームウェア更新中にエラーが発生した場合、updateStatus が以下のエラー状態値のいずれかになるように設定する必要があります。
pt_br: Caso ocorra um erro durante a atualização de firmware, updateStatus deve ser configurado com um dos valores de status de erro:
zh_cn: 如果“固件更新”期间出错，那么 updateStatus 应当设置为以下某个错误状态值：
zh_tw: 如果「韌體更新」期間發生錯誤，則 updateStatus 應設為其中一個錯誤狀態值：

source: A sample Firmware Update implementation for a Raspberry Pi device is shown below:
de: Eine Beispiel-Firmware-Update-Implementierung für ein Raspberry Pi-Gerät wird nachfolgend dargestellt:
ja: Raspberry Pi デバイスのファームウェア更新のサンプル実装を以下に示します。
pt_br: Uma amostra da implementação de atualização de firmware para um dispositivo Raspberry Pi é mostrada abaixo:
zh_cn: Raspberry Pi 设备的样本“固件更新”实现如下所示：
zh_tw: 下面顯示 Raspberry Pi 裝置的「韌體更新」實作範例：

source: **4. Add the handler to ManagedGateway**
de: **4. Hinzufügen des Handlers zu ManagedGateway**
ja: **4. ManagedGateway へのハンドラーの追加**
pt_br: **4. Incluir o manipulador no ManagedGateway**
zh_cn: **4. 向 ManagedGateway 添加处理程序**
zh_tw: **4. 將處理程式新增至 ManagedGateway**

source: The created handler needs to be added to the ManagedGateway instance so that the WIoTP client library invokes the corresponding method when there is a Firmware action request from IBM Watson Internet of Things Platform.
de: Der erstellte Handler muss zur ManagedGateway-Instanz hinzugefügt werden, damit die WIoTP-Clientbibliothek die entsprechende Methode aufruft, wenn eine Firmwareaktionsanforderung von IBM Watson Internet of Things Platform vorliegt.
ja: IBM Watson Internet of Things Platform からファームウェア操作リクエストが出されたときに WIoTP クライアント・ライブラリーが対応するメソッドを呼び出すように、作成されたハンドラーを ManagedGateway インスタンスに追加する必要があります。
pt_br: O manipulador criado precisa ser incluído na instância ManagedGateway para que a biblioteca do cliente WIoTP chame o método correspondente quando houver uma solicitação de Ação de firmware do IBM Watson Internet of Things Platform.
zh_cn: 已创建的处理程序需要添加到 ManagedGateway 实例，以便在收到来自 IBM Watson Internet of Things Platform 的固件操作请求时 WIoTP 客户机库会调用相应的方法。
zh_tw: 已建立的處理程式需要新增至 ManagedGateway 實例，以便 WIoTP 用戶端程式庫在 IBM Watson Internet of Things Platform 發出「韌體」動作要求時，呼叫對應的方法。

source: Refer to `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ for more information about the Firmware action.
de: Die `Seite <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ enthält weitere Informationen zur Firmwareaktion.
ja: ファームウェア操作について詳しくは、`このページ <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ を参照してください。
pt_br: Consulte `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ para ober mais informações sobre a Ação de firmware.
zh_cn: 请参阅 `此页面 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ 以了解有关固件操作的更多信息。
zh_tw: 如需韌體動作的相關資訊，請參閱 `此頁面 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__。

source: Device Actions
de: Geräteaktionen
ja: デバイス操作
pt_br: Ações do dispositivo
zh_cn: 设备操作
zh_tw: 裝置動作

source: The IBM Watson Internet of Things Platform supports the following device actions:
de: IBM Watson Internet of Things Platform unterstützt die folgenden Geräteaktionen:
ja: IBM Watson Internet of Things Platform は、以下のデバイス操作をサポートしています。
pt_br: O IBM Watson Internet of Things Platform suporta as ações de dispositivo a seguir:
zh_cn: IBM Watson Internet of Things Platform 支持以下设备操作：
zh_tw: IBM Watson Internet of Things Platform 支援下列裝置動作：

source: Reboot
de: Neu starten
ja: リブート
pt_br: Reinicialização
zh_cn: 重新引导
zh_tw: 重新啟動

source: Factory Reset
de: Zurücksetzen auf die Werkseinstellungen
ja: 工場出荷時設定にリセット
pt_br: Reconfiguração de Fábrica
zh_cn: 恢复工厂设置
zh_tw: 重設為原廠設定

source: The gateway needs to do the following activities to support Device Actions for itself and for the attached devices:
de: Das Gateway muss die folgenden Aktivitäten ausführen, damit Geräteaktionen für das Gateway selbst und für die angeschlossenen Geräte unterstützt werden:
ja: ゲートウェイは、それ自体および接続されているデバイスのデバイス操作をサポートするために、次のアクティビティーを行う必要があります。
pt_br: O gateway precisa fazer as atividades a seguir para suportar as Ações do dispositivo para si e para os dispositivos anexos:
zh_cn: 网关需要完成以下活动来支持自身以及已连接设备的设备操作：
zh_tw: 閘道需要為它自己以及連接的裝置執行下列活動，才能支援「裝置動作」：

source: **1. Inform server about the Device Actions support**
de: **1. Informieren des Servers über die Geräteaktionsunterstützung**
ja: **1. サーバーへのデバイス操作サポートの通知**
pt_br: **1. Informar o servidor sobre o suporte para ações de dispositivo**
zh_cn: **1. 向服务器发送有关设备操作支持的信息**
zh_tw: **1. 通知伺服器有關「裝置動作」支援**

source: In order to perform Reboot or Factory Reset action for itself and attached devices, the gateway needs to inform the IBM Watson Internet of Things Platform about the support first. This can be achieved by passing true value for supportDeviceActions parameter while sending the manage request.
de: Damit das Gateway eine Neustartaktion oder eine Aktion zum Zurücksetzen auf die Werkseinstellungen für das Gateway selbst und die angeschlossenen Geräte durchführen kann, muss es IBM Watson Internet of Things Platform zuerst über die Unterstützung informieren. Hierzu muss beim Senden der Managementanforderung der Wert 'true' für den Parameter supportDeviceActions angegeben werden.
ja: それ自体および接続されているデバイスのためにリブートや工場出荷時設定へのリセットのアクションを実行するには、まずゲートウェイがそのサポートについて IBM Watson Internet of Things Platform に通知する必要があります。これは、supportDeviceActions パラメーターに true の値を渡し、管理リクエストを送信することによって行うことができます。
pt_br: Para executar a ação Reinicialização ou Reconfiguração de fábrica para si e dispositivos anexos, o gateway precisa informar o IBM Watson Internet of Things Platform sobre o suporte primeiro. Isso pode ser atingido transmitindo o valor true para o parâmetro supportDeviceActions ao enviar a solicitação de gerenciamento.
zh_cn: 为了对自身和已连接设备执行重新引导或恢复出厂设置操作，网关首先需要将该支持通知给 IBM Watson Internet of Things Platform。可以通过在发送管理请求时针对 supportDeviceActions 参数传递 true 值来进行设置。
zh_tw: 為了為它自己以及連接的裝置執行「重新啟動」或「重設為原廠設定」動作，閘道需要先通知 IBM Watson Internet of Things Platform 有關支援狀況。在傳送管理要求時為 supportDeviceActions 參數傳遞 true 值，即可達成此目的。

source: The gateway can invoke the following method to inform the server about its device action support,
de: Das Gateway kann die folgende Methode aufrufen, um den Server über seine Geräteaktionsunterstützung zu informieren.
ja: ゲートウェイは、以下のメソッドを呼び出して、デバイス操作をサポートしていることをサーバーに通知できます。
pt_br: O gateway pode chamar o método a seguir para informar o servidor sobre seu suporte de ação do dispositivo.
zh_cn: 网关可以调用以下方法将设备操作支持通知给服务器：
zh_tw: 閘道可以呼叫下列方法來通知伺服器有關其裝置動作支援：

source: Similarly, the gateway can invoke the corresponding device method to inform the device action support of attached devices,
de: Ebenso kann das Gateway die entsprechende Methode für Geräte aufrufen, um den Server über die Geräteaktionsunterstützung der angeschlossenen Geräte zu informieren.
ja: 同様に、ゲートウェイは対応するデバイス・メソッドを呼び出して、接続されているデバイスがデバイス操作をサポートしていることを通知できます。
pt_br: Da mesma forma, o gateway pode chamar o método de dispositivo correspondente para informar o suporte de ação de dispositivo sobre os dispositivos anexos.
zh_cn: 同样地，网关可以调用对应的设备方法来通知已连接设备的设备操作支持。
zh_tw: 同樣，閘道可以呼叫對應的裝置方法來通知有關所連接裝置的裝置動作支援：

source: Once the support is informed to the DM server, the server then forwards the device action requests to the device.
de: Nachdem die Unterstützungsinformationen an den DM-Server gemeldet wurden, leitet der Server die Geräteaktionsanforderungen an das Gerät weiter.
ja: サポートしていることが DM サーバーにいったん通知されれば、デバイス操作リクエストをデバイスに転送します。
pt_br: Uma vez que o suporte é informado ao servidor DM, o servidor encaminha as solicitações de ação do dispositivo ao dispositivo.
zh_cn: 将支持通知给 DM 服务器之后，服务器便可以向设备转发设备操作请求。
zh_tw: 一旦向 DM 伺服器通知了支援狀況，伺服器即會將裝置動作要求轉遞至裝置。

source: **2. Create the Device Action Handler**
de: **2. Erstellen des Geräteaktionshandlers
ja: **2. デバイス操作ハンドラーの作成**
pt_br: **2. Criar o manipulador de ações de dispositivo**
zh_cn: **2. 创建设备操作处理程序**
zh_tw: **2. 建立裝置動作處理程式**

source: In order to support the device action, the gateway needs to create a handler and add it to managedGateway instance. The handler must extend a DeviceActionHandler class and provide implementation for the following methods:
de: Zur Unterstützung der Geräteaktion muss das Gateway einen Handler erstellen und diesen zur managedGateway-Instanz hinzufügen. Der Handler muss eine DeviceActionHandler-Klasse erweitern und die Implementierung für die folgenden Methoden bereitstellen:
ja: デバイス操作をサポートするために、ゲートウェイでハンドラーを作成し、それを managedGateway インスタンスに追加する必要があります。ハンドラーは DeviceActionHandler クラスを拡張し、以下のメソッドを実装する必要があります。
pt_br: Para suportar a ação do dispositivo, o gateway precisa criar um manipulador e incluí-lo na instância managedGateway. O manipulador deve ampliar uma classe DeviceActionHandler e fornecer a implementação dos seguintes métodos:
zh_cn: 为了支持设备操作，网关需要创建一个处理程序并将其添加到 managedGateway 实例。该处理程序必须扩展 DeviceActionHandler 类并实现以下方法：
zh_tw: 為了支援裝置動作，閘道需要建立處理程式，並將其新增至 managedGateway 實例。處理程式必須擴充 DeviceActionHandler 類別，並提供下列方法的實作：

source: **Note:** There must be only one handler added to the library for both the gateway and attached devices where the device action requests will be redirected. The implementation must create a thread (possibly a pool of threads) to handle multiple device action requests at the same time. A sample handler implementation with a threadpool is `demonstrated here <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
de: **Hinweis:** Es darf nur ein Handler für das Gateway und die angeschlossenen Geräte, an das bzw. die die Geräteaktionsanforderungen weitergeleitet werden, zur Bibliothek hinzugefügt werden. Die Implementierung muss einen Thread (möglicherweise einen Thread-Pool) erstellen, um mehrere gleichzeitige Geräteaktionsanforderungen zu verarbeiten. Ein Beispiel für eine Handlerimplementierung mit einem Thread-Pool ist `hier dargestellt <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
ja: **注**: デバイス操作のリクエストを転送するゲートウェイおよび接続されているデバイスの両方に対して、ライブラリーは 1 つのハンドラーだけを追加する必要があります。実装では、複数のデバイス操作リクエストを同時に処理するためのスレッド (おそらく複数のスレッドのプール) を作成する必要があります。スレッドプールのあるハンドラー実装のサンプルは、`ここに示されています <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__。
pt_br: **Nota:** deve haver somente um manipulador incluído na biblioteca para o gateway e os dispositivos anexos em que as solicitações de ação do dispositivo serão redirecionadas. A implementação deve criar um encadeamento (possivelmente um conjunto de encadeamentos) para manipular diversas solicitações de ação de dispositivo ao mesmo tempo. Uma implementação de manipulador de amostra com um conjunto de encadeamentos é `demonstrated here <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
zh_cn: **注**：对于网关和已连接设备，在将设备操作请求重定向到的库中，必须只能添加一个处理程序。该实现必须创建一个线程（可能是线程池）以同时处理多个设备操作请求。`此处演示了 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ 使用线程池的样本处理程序实现。
zh_tw: **附註**：只能為閘道及連接的裝置新增一個處理程式至程式庫（將在其中重新導向裝置動作要求）。實作必須建立執行緒（可能還要建立執行緒儲存區），才能同時處理多個裝置動作要求。具有執行緒儲存區的範例處理程式實作 `示範如下 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__。

source: **2.1 Sample implementation of handleReboot**
de: **2.1 Beispielimplementierung von handleReboot**
ja: **2.1 handleReboot のサンプル実装**
pt_br: **2.1 Implementação de amostra de handleReboot**
zh_cn: **2.1 handleReboot 的样本实现**
zh_tw: **2.1 handleReboot 的實作範例**

source: The implementation must create a separate thread and add a logic to reboot the gateway/attached device and report the status of the reboot via DeviceAction object. Upon receiving the request, the gateway first needs to inform the server about the support(or failure) before proceeding with the actual reboot. And if the sample can not reboot the device or any other error during the reboot, the gateway can update the status along with an optional message. A sample reboot implementation for a Raspberry Pi device is shown below (The below code doesn't include the threadpool part, refer to the `github location <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ for the complete implementation of a sample device action handler).
de: Die Implementierung muss einen separaten Thread erstellen und eine Logik hinzufügen, um das Gateway bzw. das angeschlossene Gerät neu zu starten und den Status des Neustarts über das DeviceAction-Objekt zu melden. Wenn das Gateway die Anforderung erhält, muss es zuerst den Server über die Unterstützung (oder einen entsprechenden Fehler) informieren, bevor es den eigentlichen Neustart fortsetzen kann. Und wenn mit dem Beispiel kein Neustart des Geräts möglich ist oder während des Neustarts ein anderer Fehler auftritt, kann das Gateway den Status aktualisieren und eine optionale Nachricht senden. Ein Beispiel für eine Neustartimplementierung für ein Raspberry Pi-Gerät ist nachfolgend dargestellt. (Der nachfolgend dargestellte Code enthält den Abschnitt für den Thread-Pool nicht. Die `GitHub-Position <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ veranschaulicht die vollständige Implementierung eines Beispielhandlers für eine Geräteaktion.)
ja: 実装では、別のスレッドを作成して、ゲートウェイおよび接続されているデバイスをリブートして DeviceAction オブジェクト経由でリブートの状況を報告するロジックを追加する必要があります。リクエストを受け取ると、ゲートウェイは実際のリブートを進める前に、まずサーバーにサポート (または失敗) について通知する必要があります。そしてサンプルがデバイスをリブートできないか、ブート中に他のエラーが生じた場合には、ゲートウェイが状況を更新して、オプションのメッセージを出すことができます。Raspberry Pi デバイスのリブート実装のサンプルが以下に示されています (以下のコードにはスレッドプールの部分が含まれていません。サンプルのデバイス操作ハンドラーの完全な実装については、`github ロケーション <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ を参照してください)。
pt_br: A implementação deve criar um encadeamento separado e incluir uma lógica para reinicializar o gateway/dispositivo anexo e relatar o status da reinicialização pelo objeto DeviceAction. Ao receber a solicitação, o gateway primeiro precisa informar o servidor sobre o suporte (ou falha) antes de continuar com a reinicialização real. E se a amostra não puder reinicializar o dispositivo ou qualquer outro erro durante a reinicialização, o gateway poderá atualizar o status com uma mensagem opcional. Uma implementação de reinicialização de amostra para um dispositivo Raspberry Pi é mostrada abaixo (o código abaixo não inclui a parte do conjunto de encadeamentos, consulte `github location <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ para obter a implementação completa de um manipulador de ação de dispositivo de amostra).
zh_cn: 该实现必须创建单独的线程和添加逻辑来重新引导网关/已连接设备，并通过 DeviceAction 对象报告重新引导的状态。接收请求时，网关首先需要将支持（或失败）通知给服务器，然后才能继续执行实际的重新引导操作。如果样本无法重新引导设备或者重新引导期间发生任何其他错误，网关可以更新状态并返回可选消息。以下显示了 Raspberry Pi 设备的样本重新引导实现（以下代码不包含线程池部分，请参阅 `github 位置 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ 以了解有关样本设备操作处理程序的完整实现）。
zh_tw: 實作必須建立個別執行緒並新增邏輯以將閘道/連接的裝置重新啟動，並透過 DeviceAction 物件報告重新啟動的狀態。收到要求時，閘道首先會通知伺服器有關支援（或失敗）狀況，然後再繼續執行實際的重新啟動。如果範例無法將裝置重新啟動或在重新啟動期間發生任何其他錯誤，則閘道可以更新狀態並顯示選用的訊息。以下所示為 Raspberry Pi 裝置的範例重新啟動實作（下面的程式碼不包含執行緒儲存區部分，如需範例裝置動作處理程式的完整實作，請參閱 `github 位置 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__。

source: The complete code can be found in the device management sample `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
de: Den vollständigen Code finden Sie im Gerätemanagementbeispiel `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
ja: コード全体は、デバイス管理サンプル `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ にあります。
pt_br: O código completo pode ser localizado na amostra de gerenciamento de dispositivo `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
zh_cn: 完整的代码可在设备管理样本 `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ 中找到。
zh_tw: 完整的程式碼位於裝置管理範例 `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__。

source: **2.2 Sample implementation of handleFactoryReset**
de: **2.2 Beispielimplementierung von handleFactoryReset**
ja: **2.2 handleFactoryReset のサンプル実装**
pt_br: **2.2 Implementação de amostra de handleFactoryReset**
zh_cn: **2.2 handleFactoryReset 的样本实现**
zh_tw: **2.2 handleFactoryReset 的實作範例**

source: The implementation must create a separate thread and add a logic to reset the gateway/attached device to factory settings and report the status of the reset via DeviceAction object. Upon receiving the request, the gateway first needs to inform the server about the support(or failure) before proceeding with the actual reset. The skeleton of the Factory Reset implementation is shown below:
de: Die Implementierung muss einen separaten Thread erstellen und eine Logik hinzufügen, um das Gateway bzw. das angeschlossene Gerät auf die Werkseinstellungen zurückzusetzen und den Status der Zurücksetzung über das DeviceAction-Objekt zu melden. Wenn das Gateway die Anforderung erhält, muss es zuerst den Server über die Unterstützung (oder einen entsprechenden Fehler) informieren, bevor es den eigentlichen Zurücksetzungsvorgang fortsetzen kann. Das Gerüst der Implementierung zum Zurücksetzen auf die Werkseinstellungen wird nachfolgend dargestellt:
ja: 実装では、別のスレッドを作成して、ゲートウェイおよび接続されているデバイスを工場出荷時設定にリセットして DeviceAction オブジェクト経由でリセットの状況を報告するロジックを追加する必要があります。リクエストを受け取ると、ゲートウェイは実際のリセットを進める前に、まずサーバーにサポート (または失敗) について通知する必要があります。工場出荷時設定にリセット実装のスケルトンを以下に示します。
pt_br: A implementação deve criar um encadeamento separado e incluir uma lógica para reconfigurar o gateway/dispositivo anexo para configurações de fábrica e relatar o status da reconfiguração pelo objeto DeviceAction. Ao receber a solicitação, o gateway primeiro precisa informar o servidor sobre o suporte (ou falha) antes de continuar com a reconfiguração real. A estrutura básica da implementação da reconfiguração de fábrica é mostrada abaixo:
zh_cn: 该实现必须创建单独的线程并添加逻辑以将网关/已连接设备重置为出厂设置，并通过 DeviceAction 对象报告重置状态。接收请求时，网关首先需要将支持（或失败）通知给服务器，然后才能继续执行实际的重置操作。下面显示了“恢复出厂设置”实现的框架：
zh_tw: 實作必須建立個別執行緒並新增邏輯以將閘道/連接的裝置重設為原廠設定，並透過 DeviceAction 物件報告重設的狀態。收到要求時，閘道首先會通知伺服器有關支援（或失敗）狀況，然後再繼續執行實際的重設。「重設為原廠設定」實作的架構如下所示：

source: **3. Add the handler to ManagedGateway**
de: **3. Hinzufügen des Handlers zu ManagedGateway**
ja: **3. ManagedGateway へのハンドラーの追加**
pt_br: **3. Incluir o manipulador no ManagedGateway**
zh_cn: **3. 向 ManagedGateway 添加处理程序**
zh_tw: **3. 將處理程式新增至 ManagedGateway**

source: The created handler needs to be added to the ManagedGateway instance so that the WIoTP client library invokes the corresponding method when there is a device action request for this gateway or attached devices, from IBM Watson Internet of Things Platform.
de: Der erstellte Handler muss zur ManagedGateway-Instanz hinzugefügt werden, damit die WIoTP-Clientbibliothek die entsprechende Methode aufruft, wenn eine Geräteaktionsanforderung für dieses Gateway oder angeschlossene Geräte von IBM Watson Internet of Things Platform vorliegt.
ja: IBM Watson Internet of Things Platform からこのゲートウェイまたは接続されているデバイスのデバイス操作リクエストが出されたときに WIoTP クライアント・ライブラリーが対応するメソッドを呼び出すように、作成されたハンドラーを ManagedGateway インスタンスに追加する必要があります。
pt_br: O manipulador criado precisa ser incluído na instância ManagedGateway para que a biblioteca do cliente WIoTP chame o método correspondente quando houver uma solicitação de ação de dispositivo para esse gateway ou dispositivos anexos, do IBM Watson Internet of Things Platform.
zh_cn: 已创建的处理程序需要添加到 ManagedGateway 实例，以便在收到来自 IBM Watson Internet of Things Platform 的针对此网关或已连接设备的设备操作请求时，WIoTP 客户机库会调用相应的方法。
zh_tw: 已建立的處理程式需要新增至 ManagedGateway 實例，以便 WIoTP 用戶端程式庫在 IBM Watson Internet of Things Platform 針對此閘道或連接的裝置發出裝置動作要求時，呼叫對應的方法。

source: Refer to `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ for more information about the Device Action.
de: Die `Seite <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ enthält weitere Informationen zur Geräteaktion.
ja: デバイス操作について詳しくは、`このページ <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ を参照してください。
pt_br: Consulte `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ para obter mais informações sobre a Ação do dispositivo.
zh_cn: 请参阅 `此页面 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ 以了解有关设备操作的更多信息。
zh_tw: 如需裝置動作的相關資訊，請參閱 `此頁面 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__。

source: Listen for Device attribute changes
de: Empfangsbereit für Geräteattributänderungen sein
ja: デバイス属性の変更の listen
pt_br: Atender às mudanças de atributo do dispositivo
zh_cn: 侦听设备属性更改
zh_tw: 接聽裝置屬性變更
