Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java.po
Languages: it

source: Java for Gateway Developers
it: Java per gli sviluppatori del gateway

source: See `iot-java <https://github.com/ibm-messaging/iot-java>`_ in GitHub
it: Consultare `iot-java <https://github.com/ibm-messaging/iot-java>`_ in GitHub

source: Constructor
it: Costruttore

source: The constructor builds the Gateway client instance, and accepts a Properties object containing the following definitions:
it: Il costruttore crea l'istanza client gateway e accetta un oggetto Proprietà contenente le seguenti definizioni:

source: org - Your organization ID.
it: org - L'ID organizzazione.

source: type - The type of your Gateway device.
it: type - Il tipo di dispositivo gateway.

source: id - The ID of your Gateway.
it: id - L'ID gateway.

source: auth-method - Method of authentication (The only value currently supported is "token").
it: auth-method - Metodo di autenticazione (Il solo valore attualmente supportato è "token").

source: auth-token - API key token.
it: auth-token - Token chiave API.

source: The Properties object creates definitions which are used to interact with the Watson Internet of Things Platform module.
it: L'oggetto Proprietà crea le definizioni utilizzate per interagire con il modulo Internet di Watson of Things Platform.

source: The following code snippet shows how to construct the GatewayClient instance,
it: Il seguente frammento di codice mostra in che modo creare l'istanza GatewayClient,

source: Using a configuration file
it: Tramite file di configurazione

source: Instead of including a Properties object directly, you can use a configuration file containing the name-value pairs for Properties. If you are using a configuration file containing a Properties object, use the following code format.
it: Invece di includere un oggetto Proprietà direttamente, è possibile utilizzare un file di configurazione contenente le coppie nome-valore per Proprietà. Se si utilizza un file di configurazione contenente un oggetto Proprietà, utilizzare seguente il formato di codice.

source: The Gateway device configuration file must be in the following format:
it: Il file di configurazione del dispositivo gateway deve avere il seguente formato:

source: Connecting to the Watson Internet of Things Platform
it: Connessione a Watson Internet of Things Platform

source: Connect to the Watson Internet of Things Platform by calling the *connect* function.
it: Connettersi a Watson Internet of Things Platform chiamando la funzione *connect*

source: After the successful connection to the IBM Watson IoT Platform, the Gateway client can perform the following operations,
it: Una volta eseguita correttamente la connessione a IBM Watson IoT Platform, il client gateway può eseguire le seguenti operazioni,

source: Publish events for itself and on behalf of devices connected behind the Gateway.
it: Pubblicare eventi autonomamente e per conto di dispositivi connessi dietro il gateway.

source: Subscribe to commands for itself and on behalf of devices behind the Gateway.
it: Effettuare la sottoscrizione ai comandi autonomamente e per conto dei dispositivi dietro il gateway.

source: Register devices using the Watson IoT Platform API
it: Registrare i dispositivi utilizzando l'API Watson IoT Platform

source: There are different ways to register the devices behind the Gateway to IBM Watson IoT Platform,
it: Esistono due differenti modi per registrare i dispositivi dietro il gateway in IBM Watson IoT Platform,

source: **Auto registration**: The device gets added automatically in IBM Watson IoT Platform when Gateway publishes any event/subscribes to any commands for the devices connected to it.
it: **Auto registration**: il dispositivo viene aggiunto automaticamente a IBM Watson IoT Platform quando il gateway pubblica eventi o effettua la sottoscrizione ai comandi per i dispositivi ad esso connessi.

source: **API**: The Watson IoT Platform API can be used to register the devices to the Watson IoT Platform.
it: **API**: l'API Watson IoT Platform può essere utilizzata per registrare i dispositivi in Watson IoT Platform.

source: The Watson IoT Platform API can be used to register the devices (that are connected to the Gateway) to the Watson IoT Platform. The APIClient simplifies the interactions with Watson IoT Platform API. Get the APIClient instance by invoking the api() method as follows,
it: L'API Watson IoT Platform API può essere utilizzata per registrare i dispositivi (che sono connessi al gateway) in Watson IoT Platform. APIClient semplifica le interazioni con l'API Watson IoT Platform. Ottenere l'istanza APIClient richiamando il metodo api() come di seguito riportato,

source: Once you get the handle of APIClient, you can add the devices. Following code snippet shows how to add a device to a Gateway in Watson IoT Platform,
it: Una volta acquisita la gestione di APIClient, è possibile aggiungere i dispositivi. Il seguente frammento di codice mostra in che modo aggiungere un dispositivo ad un gateway in Watson IoT Platform,

source: The gwDeviceId and gwDeviceType are the Gateway properties to which this device will be attached to when its registered.
it: GwDeviceId e gwDeviceType sono le proprietà del gateway a cui questo dispositivo sarà collegato durante la sua registrazione.

source: Publishing events
it: Pubblicazione degli eventi

source: Events are the mechanism by which Gateways/devices publish data to the Watson IoT Platform. The Gateway/device controls the content of the event and assigns a name for each event it sends.
it: Gli eventi sono il meccanismo tramite cui i gateway/dispositivi pubblicano i dati in Watson IoT Platform. Il gateway/dispositivo controlla il contenuto dell'evento e assegna un nome ad ogni evento che invia.

source: **The Gateway can publish events from itself and on behalf of any device connected via the Gateway**.
it: **Il gateway può pubblicare gli eventi autonomamente e per conto dei dispositivi connessi mediante il gateway**.

source: When an event is received by the IBM Watson IoT Platform the credentials of the connection on which the event was received are used to determine from which Gateway the event was sent. With this architecture it is impossible for a Gateway to impersonate another device.
it: Quando IBM Watson IoT Platform riceve un evento, verranno utilizzate le credenziali della connessione su cui si è ricevuto l'evento al fine di determinare da quale dispositivo è stato inviato l'evento. Con questa architettura non è possibile per un gateway impersonare un altro dispositivo.

source: Events can be published at any of the three `quality of service levels <../messaging/mqtt.html#/>`__ defined by the MQTT protocol. By default events will be published as qos level 0.
it: Gli eventi possono essere pubblicati in uno qualsiasi dei tre `livelli di QoS (quality of service) <../messaging/mqtt.html#/>`__ definiti dal protocollo MQTT. Per impostazione predefinita gli eventi verranno pubblicati al livello qos 0.

source: Publish Gateway event using default quality of service
it: Pubblicare l'evento gateway utilizzando il livello Qos predefinito

source: Publish Gateway event using user-defined quality of service
it: Pubblicare l'evento gateway utilizzando il livello Qos definito dall'utente

source: Events can be published at higher MQTT quality of service levels, but these events may take slower than QoS level 0, because of the extra confirmation of receipt.
it: Gli eventi possono essere pubblicati con livelli di QoS (quality of service) MQTT più elevati, ma tali eventi potrebbero impiegare più tempo rispetto a un livello di QoS pari a 0, a causa della conferma aggiuntiva della ricezione.

source: Publishing events from devices
it: Pubblicazione degli eventi dai dispositivi

source: The Gateway can publish events on behalf of any device connected via the Gateway by passing the appropriate typeId and deviceId based on the origin of the event:
it: Il gateway può pubblicare gli eventi per conto del dispositivo connesso mediante il gateway passando gli appropriati typeId e deviceId in base all'origine dell'evento.

source: One can use the overloaded publishDeviceEvent() method to publish the device event in the desired quality of service. Refer to `MQTT Connectivity for Gateways <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ documentation to know more about the topic structure used.
it: Si può utilizzare il metodo publishDeviceEvent() sottoposto a overload per pubblicare l'evento del dispositivo a livello Qos desiderato. Fare riferimento alla documentazione 'Connettività MQTT per i gateway <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ per saperne di più sulla struttura dell'argomento utilizzato.

source: Handling commands
it: Gestione dei comandi

source: The Gateway can subscribe to commands directed at the gateway itself and to any device connected via the gateway. When the Gateway client connects, it automatically subscribes to any commands for this Gateway. But to subscribe to any commands for the devices connected via the Gateway, use one of the overloaded subscribeToDeviceCommands() method, for example,
it: Il gateway può effettuare la sottoscrizione ai comandi diretti al gateway stesso e ai dispositivi connessi mediante il gateway. Quando si connette il client gateway, effettua automaticamente la sottoscrizione ai comandi per questo gateway. Ma per effettuare la sottoscrizione ai comandi per i dispositivi connessi mediante il gateway, utilizzare uno dei metodi subscribeToDeviceCommands() sottoposto a overload, per esempio,

source: To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
it: Per elaborare comandi specifici è necessario registrare un metodo di callback del comando. I messaggi vengono restituiti come un'istanza della classe comando che ha le seguenti proprietà:

source: deviceType - The device type for which the command is received.
it: deviceType - Il tipo di dispositivo per cui si riceve il comando.

source: deviceId - The device id for which the command is received, Could be the Gateway or any device connected via the Gateway.
it: deviceId - L'ID dispositivo per cui si è ricevuto il comando. Potrebbe essere il gateway o un dispositivo connesso mediante il gateway.

source: payload - The command payload.
it: payload - Il payload del comando.

source: format - The format of the command payload, currently only JSON format is supported in the Java Client Library.
it: format - Il formato del payload del comando, attualmente è supportato solo il formato JSON in Java Client Library.

source: command - The name of the command.
it: command - Il nome del comando.

source: timestamp - The org.joda.time.DateTime when the command is sent.
it: timestamp - Org.joda.time.DateTime quando il comando viene inviato.

source: A sample implementation of the Command callback is shown below,
it: Un'implementazione di esempio del callback del comando è riportata di seguito

source: Once the Command callback is added to the GatewayClient, the processCommand() method is invoked whenever any command is published on the subscribed criteria, The following snippet shows how to add the command call back into GatewayClient instance,
it: Una volta che è stato aggiunto il callback del comando a GatewayClient, viene richiamato il metodo processCommand() ogni volta che il comando viene pubblicato in base ai criteri sottoscritti. Il seguente frammento di codice mostra in che modo aggiungere il callback del comando nell'istanza GatewayClient,

source: Overloaded methods are available to control the command subscription.
it: I metodi sottoposti a overload sono disponibili per controllare la sottoscrizione ai comandi.

source: List Devices Connected through the Gateway
it: Elenco dei dispositivi connessi tramite il gateway

source: Invoke the method getDevicesConnectedThroughGateway() to retrieve all devices that are connected through the specified gateway(typeId, deviceId) to Watson IoT Platform:
it: Richiamare il metodo getDevicesConnectedThroughGateway() per recuperare tutti i dispositivi connessi attraverso il gateway specificato (typeId, deviceId) a Watson IoT Platform:

source: Examples
it: Esempi:

source: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - This Java project contains 3 samples, which will help one to connect their own Gateway and devices behind the Gateway to IBM Watson Internet of Things Platform. All the samples use the Java Client Library for IBM Watson IoT Platform, that simplifies the Gateway interactions with the Platform.
it: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - Questo progetto Java contiene 3 esempi, che consentiranno di connettere il proprio Gateway ed i dispositivi protetti dal gateway a IBM Watson Internet of Things Platform. Tutti gli esempi utilizzano la libreria client Java per IBM Watson IoT Platform, che semplifica le interazioni del Gateway con la piattaforma.

source: Recipes
it: Istruzioni specifiche

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__ that explains how to connect your Gateway and devices behind the Gateway to IBM Watson Internet of Things Platform with the sample present in this github project.
it: Fare riferimento alla `pagina <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__ che illustra come connettere il gateway ed i dispositivi protetti dal gateway a IBM Watson Internet of Things Platform con l'esempio presente in questo progetto github.

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ that explains how to connect your Gateway as managed device in IBM Watson Internet of Things Platform and perform one or more device management operations.
it: Fare riferimento alla `pagina <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ che illustra come connettere il gateway come dispositivo gestito in IBM Watson Internet of Things Platform ed eseguire una o più operazioni di gestione del dispositivo.
