Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: de, ja, pt_br, zh_cn, zh_tw

source: This WIoTP client library updates the corresponding objects whenever there is an update request from the IBM Watson Internet of Things Platform, these update requests are initiated by the application either directly or indirectly (Firmware Update) via the IBM Watson Internet of Things Platform ReST API. Apart from updating these attributes, the library provides a mechanism where the gateway can be notified whenever a device attribute is updated.
de: Diese WIoTP-Clientbibliothek aktualisiert die entsprechenden Objekte immer dann, wenn eine Aktualisierungsanforderung von IBM Watson Internet of Things Platform vorliegt. Diese Aktualisierungsanforderungen werden von der Anwendung entweder direkt oder indirekt (Firmware-Update) über die REST-API von IoT Platform initiiert. Neben der Aktualisierung dieser Attribute bietet die Bibliothek einen Mechanismus bei dem das Gateway benachrichtigt werden kann, wann immer ein Geräteattribut aktualisiert wird.
ja: この WIoTP クライアント・ライブラリーは、IBM Watson Internet of Things Platform から更新リクエストが送られるたびに、対応するオブジェクトを更新します。このような更新リクエストは、アプリケーションから直接開始されるか、IBM Watson Internet of Things Platform の ReST API を使用して間接的に開始されます (ファームウェア更新)。ライブラリーは、これらの属性を更新するだけでなく、デバイス属性の更新時にゲートウェイに通知できるようにするための機構も提供します。
pt_br: Esta biblioteca do cliente WIoTP atualiza os objetos correspondentes sempre que há uma solicitação de atualização a partir do IBM Watson Internet of Things Platform; essas solicitações de atualização são iniciadas pelo aplicativo seja direta ou indiretamente (Atualização de firmware) pela API REST do IBM Watson Internet of Things Platform. Além de atualizar esses atributos, a biblioteca fornece um mecanismo em que o gateway pode ser notificado sempre que um atributo de dispositivo for atualizado.
zh_cn: 该 WIoTP 客户机库会在收到来自 IBM Watson Internet of Things Platform 的更新请求时更新对应的对象，这些更新请求是由应用程序直接或通过 IBM Watson Internet of Things Platform ReST API 间接（固件更新）启动的。除更新这些属性外，该库还提供一种机制，使网关能够在设备属性已更新时得到通知。
zh_tw: 只要 IBM Watson Internet of Things Platform 發出更新要求，此 WIoTP 用戶端程式庫便會更新對應的物件，而這些更新要求是由應用程式透過 IBM Watson Internet of Things Platform ReST API，直接或間接（「 韌體更新」）起始。除了更新這些屬性之外，程式庫提供的機制還可在更新裝置屬性時通知閘道。

source: Attributes that can be updated by this operation are location, metadata, device information and firmware of the gateway/attached devices.
de: Durch diese Operation können die Attribute für Position, Metadaten, Gerätedaten und Firmware des Gateways bzw. der angeschlossenen Geräte aktualisiert werden.
ja: この操作によって更新できる属性は、ゲートウェイや接続されているデバイスのロケーション、メタデータ、デバイス情報、およびファームウェアです。
pt_br: Os atributos que podem ser atualizados por esta operação são local, metadados, informações sobre o dispositivo e firmware do gateway/dispositivos anexos.
zh_cn: 此操作可以更新的属性包括网关/已连接设备的位置、元数据、设备信息和固件。
zh_tw: 可透過此作業更新的屬性為位置、meta 資料、裝置資訊以及閘道/所連接裝置的韌體。

source: In order to get notified, the gateway needs to add a property change listener on those objects that it is interested.
de: Damit eine Benachrichtigung erfolgen kann, muss das Gateway einen Listener für Eigenschaftsänderungen bei den Objekten hinzufügen, die von Interesse sind.
ja: 通知を受けるには、ゲートウェイは、対象となるオブジェクトに対するプロパティー変更リスナーを追加する必要があります。
pt_br: Para ser notificado, o gateway precisa incluir um listener de mudança de propriedade nesses objetos que são de seu interesse.
zh_cn: 要获取通知，网关需要对感兴趣的对象添加属性更改侦听器。
zh_tw: 為了取得通知，閘道需要在其感興趣的物件上，新增內容變更接聽器。

source: Also, the gateway needs to implement the propertyChange() method where it receives the notification. A sample implementation is as follows:
de: Darüber hinaus, muss das Gateway die Methode propertyChange() implementieren; dort erhält es die Benachrichtigung. Folgende Beispielimplementierung:
ja: また、ゲートウェイは、通知を受け取る propertyChange() メソッドを実装する必要もあります。サンプル実装は、次のとおりです。
pt_br: Além disso, o gateway precisa implementar o método propertyChange() quando recebe a notificação. A seguir é mostrada uma implementação de amostra:
zh_cn: 另外，网关还需要实现 propertyChange() 方法，在此接收通知。样本实现如下：
zh_tw: 此外，閘道還需要在其接收通知的位置，實作 propertyChange() 方法。實作範例如下所示：

source: Refer to `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ for more information about updating the device attributes.
de: Die `Seite <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ enthält weitere Informationen zur Aktualisierung der Geräteattribute.
ja: デバイス属性の更新について詳しくは、`このページ <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ を参照してください。
pt_br: Consulte `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ para obter mais informações sobre atualizar os atributos de dispositivo.
zh_cn: 请参阅 `此页面 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ 以了解有关更新设备属性的更多信息。
zh_tw: 如需更新裝置屬性的相關資訊，請參閱 `此頁面 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__。

source: Examples
de: Beispiele
ja: 例
pt_br: Exemplos
zh_cn: 示例
zh_tw: 範例

source: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - Gateway Device Management(DM) capabilities are demonstrated in this sample by managing the Arduino Uno device through the Raspberry Pi Gateway. If you do not have Raspberry Pi and Arduino UNO, don’t worry, you can still follow the sample to connect your device as a gateway and manage one or more attached devices.
de: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - In diesem Beispiel werden Gerätemanagementfunktionen für Gateways veranschaulicht, indem das Arduino Uno-Gerät über das Raspberry Pi-Gateway verwaltet wird. Wenn Sie nicht über Raspberry Pi und Arduino UNO verfügen, können Sie das Beispiel trotzdem zur Veranschaulichung für das Verbinden eines Geräts als Gateway und das Verwalten eines oder mehrerer angeschlossener Geräte verwenden.
ja: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - Gateway Device Management(DM) 機能は、このサンプルでは、Raspberry Pi ゲートウェイによって Arduino Uno デバイスを管理することにより示されます。Raspberry Pi と Arduino UNO がない場合でも、サンプルに従ってデバイスをゲートウェイとして接続し、接続されている 1 つ以上のデバイスを管理することができますのでご安心ください。
pt_br: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - Os recursos do Gateway Device Management(DM) são demonstrados nesta amostra, gerenciando o dispositivo Arduino Uno por meio do Gateway Raspberry Pi. Se você não tiver o Raspberry Pi e Arduino UNO, não se preocupe, ainda será possível seguir a amostra para conectar seu dispositivo como um gateway e gerenciar um ou mais dispositivos anexos.
zh_cn: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - 在此样本中，通过 Raspberry Pi 网关管理 Arduino Uno 设备，演示了网关设备管理 (DM) 功能。如果您没有 Raspberry Pi 和 Arduino UNO，不必担心，仍可以根据此样本将设备作为网关进行连接，然后管理一个或多个已连接设备。
zh_tw: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - 在本範例中，將透過 Raspberry Pi 閘道來管理 Arduino Uno 裝置，從而示範「閘道裝置管理 (DM)」功能。如果您沒有 Raspberry Pi 及 Arduino UNO，請勿擔心，您仍可遵循此範例，將自己的裝置當作閘道來連接，並管理一個以上連接的裝置。

source: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - A home gateway sample that manages few attached home devices like, Lights, Switches, Elevator, Oven and OutdoorTemperature.
de: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - Dieses Beispiel veranschaulicht die Verwaltung einiger angeschlossener Geräte im Haus durch ein Gateway, z. B. für Licht, Schalter, Aufzug, Herd und Außentemperatur.
ja: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - 接続された少数のホーム・デバイス (照明、スイッチ、エレベーター、オーブン、外気温など) を管理するホーム・ゲートウェイ・サンプル。
pt_br: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - Uma amostra de gateway inicial que gerencia alguns dispositivos iniciais anexos como Lights, Switches, Elevator, Oven e OutdoorTemperature.
zh_cn: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - 该家用网关样本管理几个已连接家用设备，例如电灯、开关、电梯、烤箱和室外温度。
zh_tw: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - 家用閘道範例，用於管理少數連接的家用裝置，如燈光、交換器、電梯、烤箱及 OutdoorTemperature。

source: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - A sample implementation of FirmwareHandler.
de: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - Beispielimplementierung von FirmwareHandler.
ja: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - FirmwareHandler のサンプル実装。
pt_br: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - Uma implementação de amostra do FirmwareHandler.
zh_cn: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - FirmwareHandler 的样本实现。
zh_tw: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - FirmwareHandler 的範例實作。

source: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - A sample implementation of DeviceActionHandler.
de: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - Beispielimplementierung von DeviceActionHandler.
ja: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - DeviceActionHandler のサンプル実装。
pt_br: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - Uma implementação de amostra do DeviceActionHandler.
zh_cn: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - DeviceActionHandler 的样本实现。
zh_tw: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - DeviceActionHandler 的範例實作。

source: Recipe
de: Anleitung
ja: レシピ
pt_br: Fórmula
zh_cn: 诀窍
zh_tw: 秘訣

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ that shows how to connect Raspberry Pi as Managed Gateway to IBM Watson IoT Platform and manage the attached devices. For example, update Arduino Uno device with a new sketch program, reboot Arduino Uno using the Watson IoT Platform device management protocol and etc..
de: `Die Anleitung <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ enthält eine Beschreibung dazu, wie Raspberry Pi als verwaltetes Gateway mit IBM Watson IoT Platform verbunden wird und wie die angeschlossenen Geräte verwaltet werden. Z. B. wird das Arduino Uno-Gerät mit einem neuen Skizzenprogramm aktualisiert, Arduino Uno wird mithilfe des Watson IoT Platform-Gerätemanagementprotokolls neu gestartet usw.
ja: Raspberry Pi デバイスを管理対象ゲートウェイとして IBM Watson IoT Platform に接続し、接続されているデバイスを管理する方法を示す、`レシピ <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ を参照してください。例えば、新しいスケッチ・プログラムによって Arduino Uno デバイスを更新したり、Watson IoT Platform デバイス管理プロトコルを使用して Arduino Uno をリブートしたりします。
pt_br: Consulte `the recipe <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ que mostra como conectar o Raspberry Pi como Gateway gerenciado ao IBM Watson IoT Platform e gerenciar os dispositivos anexos. Por exemplo, atualize o dispositivo Arduino Uno com um novo programa de rascunho, reinicialize o Arduino Uno usando o protocolo de gerenciamento de dispositivo do Watson IoT Platform e etc..
zh_cn: 请参阅 `诀窍 <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__，其中显示了如何将 Raspberry Pi 作为受管设备连接到 IBM Watson IoT Platform 并管理已连接设备。例如，使用新的 sketch 程序更新 Arduino Uno 设备，使用 Watson IoT Platform 设备管理协议重新引导 Arduino Uno 等等。
zh_tw: 請參閱 `秘訣 <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__，該秘訣顯示如何將 Raspberry Pi 作為「受管理閘道」連接至 IBM Watson IoT Platform，並管理所連接的裝置。例如，使用新的概略圖程式來更新 Arduino Uno 裝置、使用 Watson IoT Platform 裝置管理通訊協定將 Arduino Uno 重新啟動等。
