Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: de, ja, pt_br, zh_cn, zh_tw

source: The gateway can invoke sendGatewayManageRequest() method to participate in device management activities. The manage request will initiate a connect request internally if the device is not connected to the IBM Watson Internet of Things Platform already:
de: Das Gateway kann die Methode sendGatewayManageRequest() zur Teilnahme an den Gerätemanagementaktivitäten aufrufen. Die Managementanforderung initiiert intern eine Verbindungsanforderung, wenn das Gerät noch nicht mit IBM Watson Internet of Things Platform verbunden ist:
ja: ゲートウェイは、sendGatewayManageRequest() メソッドを呼び出して、デバイス管理アクティビティーに参加することができます。デバイスが IBM Watson Internet of Things Platform にまだ接続していない場合は、管理リクエストによって内部的に接続リクエストが開始されます。
pt_br: O gateway pode chamar o método sendGatewayManageRequest() para participar de atividades de gerenciamento de dispositivo. A solicitação de gerenciamento iniciará uma solicitação de conexão internamente se o dispositivo não estiver conectado ainda ao IBM Watson Internet of Things Platform:
zh_cn: 网关可通过调用 sendGatewayManageRequest() 方法来参与设备管理活动。如果设备尚未连接到 IBM Watson Internet of Things Platform，那么管理请求将在内部发出一个连接请求：
zh_tw: 閘道可以呼叫 sendGatewayManageRequest() 方法來參與裝置管理活動。如果裝置尚未連接至 IBM Watson Internet of Things Platform，則管理要求會在內部起始連接要求：

source: As shown, this method accepts following 3 parameters,
de: Wie dargestellt akzeptiert diese Methode die 3 folgenden Parameter.
ja: 示されているように、このメソッドは以下の 3 つのパラメーターを受け入れます。
pt_br: Conforme mostrado, este método aceita seguindo 3 parâmetros,
zh_cn: 如下所示，此方法接受以下 3 个参数：
zh_tw: 如同所示，此方法接受下列 3 個參數：

source: *lifetime* The length of time in seconds within which the gateway must send another **Manage** request in order to avoid being reverted to an unmanaged device and marked as dormant. If set to 0, the managed gateway will not become dormant. When set, the minimum supported setting is 3600 (1 hour).
de: *lifetime* Der Zeitraum in Sekunden, in dem das Gateway eine weitere Anforderung **Verwalten** senden muss, damit es nicht in den Status eines nicht verwalteten Geräts versetzt und als 'ruhend' gekennzeichnet wird. Wenn der Wert 0 festgelegt wird, wechselt das verwaltete Gerät nicht in den Ruhestatus. Wird ein Wert festgelegt, ist der unterstützte Mindestwert 3600 (1 Stunde).
ja: *lifetime* ゲートウェイが次の「**管理**」リクエストを送信しなければならない制限時間を秒数で指定します。これを過ぎると非管理対象デバイスに戻り、「休止」のマークが付けられます。「0」に設定すると、管理対象ゲートウェイは休止状態になりません。これを設定する場合、サポートされる最小設定値は 3600 (1 時間) です。
pt_br: *lifetime* A duração de tempo em segundos na qual o gateway deve enviar outra solicitação **Manage** para evitar ser revertido para um dispositivo não gerenciado e marcado como inativo. Se configurado como 0, o gateway gerenciado não se tornará inativo. Quando configurado, a configuração mínima suportada será de 3600 (1 hora).
zh_cn: *lifetime* 以秒为单位表示的时间长度，在此期间内，网关必须发送另一个 **Manage** 请求，以避免还原为非受管设备并被标记为休眠。如果设置为 0，受管设备将不会变为休眠。设置此字段时，支持的最低设置为 3600（1 小时）。
zh_tw: *lifetime* 以秒為單位的時間長度，閘道必須在此期間內傳送另一個 **Manage** 要求，才能避免回復成未受管理的裝置並標示為休眠。如果設為 0，受管理閘道就不會變成休眠。若已設定，則支援的最小設定值為 3600（1 小時）。

source: *supportFirmwareActions* Tells whether the gateway supports firmware actions or not. The gateway must add a firmware handler to handle the firmware requests.
de: *supportFirmwareActions* Gibt an, ob das Gateway Firmwareaktionen unterstützt. Für das Gateway muss ein Firmware-Handler zur Bearbeitung der Firmwareanforderungen hinzugefügt werden.
ja: *supportFirmwareActions* ゲートウェイがファームウェア操作をサポートするかどうかを指定します。ファームウェアのリクエストを処理するには、ゲートウェイはファームウェア・ハンドラーを追加する必要があります。
pt_br: *supportFirmwareActions* Informa se o gateway suporta ações de firmware ou não. O gateway deve incluir um manipulador de firmware para manipular as solicitações de firmware.
zh_cn: *supportFirmwareActions* 表明网关是否支持固件操作。网关必须添加固件处理程序才能处理固件请求。
zh_tw: *supportFirmwareActions* 說明閘道是否支援韌體動作。閘道必須新增韌體處理程式才能處理韌體要求。

source: *supportDeviceActions* Tells whether the gateway supports Device actions or not. The gateway must add a Device action handler to handle the reboot and factory reset requests.
de: *supportDeviceActions* Gibt an, ob das Gateway Geräteaktionen unterstützt. Für das Gateway muss ein Geräteaktionshandler zur Bearbeitung der Anforderungen für den Neustart und das Zurücksetzen auf Werkseinstellungen hinzugefügt werden.
ja: *supportDeviceActions* ゲートウェイがデバイス操作をサポートするかどうかを指定します。リブートや工場出荷時設定へのリセットのリクエストを処理するには、ゲートウェイはデバイス操作ハンドラーを追加する必要があります。
pt_br: *supportDeviceActions* Informa se o gateway suporta ações de Dispositivo ou não. O gateway deve incluir um manipulador de ação do Dispositivo para manipular as solicitações de reinicialização e reconfiguração de fábrica.
zh_cn: *supportDeviceActions* 表明网关是否支持设备操作。网关必须添加设备操作处理程序才能处理重新引导和恢复出厂设置请求。
zh_tw: *supportDeviceActions* 說明閘道是否支援裝置動作。閘道必須新增裝置動作處理程式才能處理重新啟動及重設為原廠設定要求。

source: Manage request - attached devices
de: Managementanforderung - angeschlossene Geräte
ja: 管理リクエスト - 接続されているデバイス
pt_br: Solicitação de gerenciamento - dispositivos anexos
zh_cn: 管理请求 - 已连接设备
zh_tw: 管理要求 - 連接的裝置

source: The gateway can invoke sendDeviceManageRequest() method to make the attached devices participate in the device management activities.
de: Das Gateway kann die Methode sendDeviceManageRequest() aufrufen, um die Teilnahme der angeschlossenen Geräte an den Gerätemanagementaktivitäten zu veranlassen.
ja: ゲートウェイは、sendDeviceManageRequest() メソッドを呼び出して、接続されているデバイスがデバイス管理アクティビティーに参加するようにすることができます。
pt_br: O gateway pode chamar o método sendDeviceManageRequest() para fazer os dispositivos anexos participarem das atividades de gerenciamento de dispositivo.
zh_cn: 网关可以调用 sendDeviceManageRequest() 方法，使已连接设备参与设备管理活动。
zh_tw: 閘道可以呼叫 sendDeviceManageRequest() 方法，讓連接的裝置參與裝置管理活動。

source: As shown, this method accepts the details of the attached device apart from the lifetime and device/firmware support parameters. The gateway can also use the overloaded sendDeviceManageRequest() method to specify the DeviceData for the attached device.
de: Wie dargestellt akzeptiert diese Methode die Details des angeschlossenen Geräts zusätzlich zu den Parametern für den Zeitraum und für die Geräte-/Firmwareunterstützung. Das Gateway kann auch die überladene Methode sendDeviceManageRequest() für die Angabe von DeviceData für das angeschlossene Gerät verwendet.
ja: 示されているように、このメソッドは、制限時間のパラメーターやデバイス/ファームウェアのサポートのパラメーターとは別に、接続されているデバイスの詳細を受け入れます。ゲートウェイは、多重定義の sendDeviceManageRequest() メソッドを使用して、接続されているデバイスの DeviceData を指定することもできます。
pt_br: Como mostrado, este método aceita os detalhes do dispositivo anexo separados do tempo de vida e dos parâmetros de suporte a dispositivo/firmware. O gateway também pode usar o método sendDeviceManageRequest() sobrecarregado para especificar o DeviceData para o dispositivo anexo.
zh_cn: 如下所示，除了 lifetime 和 device/firmware 支持参数之外，此方法还接受已连接设备的详细信息。网关还可以使用重载 sendDeviceManageRequest() 方法来指定已连接设备的 DeviceData。
zh_tw: 如同所示，除了生命期限及裝置/韌體支援參數以外，此方法還會接受所連接裝置的詳細資料。閘道還可以使用超載的 sendDeviceManageRequest() 方法，為連接的裝置指定 DeviceData。

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__ for more information about the manage operation.
de: Die `Dokumentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__ enthält weitere Informationen zur Verwaltungsoperation.
ja: 管理操作について詳しくは、`資料 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__ を参照してください。
pt_br: Consulte a `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__ para obter mais informações sobre a operação de gerenciamento.
zh_cn: 请参阅 `文档 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__，以了解有关管理操作的更多信息。
zh_tw: 如需管理作業的相關資訊，請參閱 `文件 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__。

source: Unmanage request - gateway
de: Anforderung zum Beenden der Verwaltung - Gateway
ja: 管理解除リクエスト - ゲートウェイ
pt_br: Solicitação de cancelar gerenciamento - gateway
zh_cn: 取消管理请求 - 网关
zh_tw: 取消管理要求 - 閘道

source: A gateway can invoke sendGatewayUnmanageRequet() method when it no longer needs to be managed. The IBM Watson Internet of Things Platform will no longer send new device management requests for this gateway and all device management requests from the gateway (only for the gateway and not for the attached devices) will be rejected other than a **Manage** request.
de: Ein Gateway kann die Methode sendGatewayUnmanageRequet() aufrufen, wenn es nicht mehr verwaltet werden muss. IBM Watson Internet of Things Platform sendet keine neuen Gerätemanagementanforderungen für dieses Gateway mehr. Alle Gerätemanagementanforderungen des Gateways (nur für das Gateway, nicht für die angeschlossenen Geräte) mit Ausnahme der Anforderung **Verwalten** werden zurückgewiesen.
ja: ゲートウェイは、管理される必要がなくなったときに sendGatewayUnmanageRequet() メソッドを呼び出すことができます。IBM Watson Internet of Things Platform は新しいデバイス管理リクエストをこのゲートウェイに送信しなくなり、このゲートウェイからのすべてのデバイス管理リクエスト (ゲートウェイに対するものだけで、接続されているデバイスに対するものではない) は「**管理**」リクエストを除いて拒否されます。
pt_br: Um gateway pode chamar o método sendGatewayUnmanageRequet() quando não precisa mais ser gerenciado. O IBM Watson Internet of Things Platform não enviará mais novas solicitações de gerenciamento de dispositivo para esse gateway e todas as solicitações de gerenciamento de dispositivo do gateway (somente para o gateway e não para os dispositivos anexos) serão rejeitadas diferente de uma solicitação **Manage**.
zh_cn: 当网关不再需要接受管理时，它可以调用 sendGatewayUnmanageRequet() 方法。IBM Watson Internet of Things Platform 将不再发送针对此网关的新设备管理请求，除了 **Manage** 请求，来自此网关的所有设备管理请求（仅针对该网关，而不是已连接设备）都将被拒绝。
zh_tw: 當閘道不再需要管理時，可呼叫 sendGatewayUnmanageRequet() 方法。IBM Watson Internet of Things Platform 將不再傳送針對此閘道的新裝置管理要求，且除了 **Manage** 要求以外，來自此閘道的所有裝置管理要求（僅針對閘道，而非針對連接的裝置）都會遭到拒絕。

source: Unmanage request - attached devices
de: Anforderung zum Beenden der Verwaltung - angeschlossene Geräte
ja: 管理解除リクエスト - 接続されているデバイス
pt_br: Solicitação de cancelar gerenciamento - dispositivos anexos
zh_cn: 取消管理请求 - 已连接设备
zh_tw: 取消管理要求 - 連接的裝置

source: The gateway can invoke sendDeviceUnmanageRequet() method to move the attached device from managed state to unmanaged state. The IBM Watson Internet of Things Platform will no longer send new device management requests for this device and all device management requests from the gateway for this attached device will be rejected other than a **Manage** request.
de: Das Gateway kann die Methode sendDeviceUnmanageRequet() aufrufen, um das angeschlossene Gerät vom Status 'verwaltet' in den Status 'nicht verwaltet' zu versetzen. IBM Watson Internet of Things Platform sendet keine neuen Gerätemanagementanforderungen für dieses Gerät mehr. Alle Gerätemanagementanforderungen des Gateways für dieses angeschlossene Gerät mit Ausnahme der Anforderung **Verwalten** werden zurückgewiesen.
ja: ゲートウェイは、sendDeviceUnmanageRequet() メソッドを呼び出して、接続されているデバイスを管理状態から管理解除状態に移行させることができます。IBM Watson Internet of Things Platform は、新しいデバイス管理リクエストをこのデバイスに送信しなくなり、ゲートウェイからのこの接続されているデバイスのすべてのデバイス管理リクエストは「**管理**」リクエストを除いて拒否されるようになります。
pt_br: O gateway pode chamar o método sendDeviceUnmanageRequet() para mover o dispositivo anexo do estado gerenciado para o estado não gerenciado. O IBM Watson Internet of Things Platform não enviará mais novas solicitações de gerenciamento de dispositivo para esse dispositivo e todas as solicitações de gerenciamento de dispositivo do gateway para esse dispositivo anexo serão rejeitadas diferente de uma solicitação **Manage**.
zh_cn: 网关可以调用 sendDeviceUnmanageRequet() 方法将已连接设备从受管状态更改为非受管状态。IBM Watson Internet of Things Platform 将不再发送针对此设备的新设备管理请求，除了 **Manage** 请求，来自网关的该已连接设备的所有设备管理请求都将被拒绝。
zh_tw: 閘道可以呼叫 sendDeviceUnmanageRequet() 方法，以將連接的裝置從受管理狀態移至未受管理狀態。IBM Watson Internet of Things Platform 將不再傳送針對此裝置的新裝置管理要求，且除了 **Manage** 要求以外，來自此閘道的針對此連接裝置的所有裝置管理要求都會遭到拒絕。

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__ for more information about the Unmanage operation.
de: Die `Dokumentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__ enthält weitere Informationen zur Operation für das Beenden der Verwaltung.
ja: 管理解除の操作について詳しくは、`資料 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__ を参照してください。
pt_br: Consulte `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__ para obter mais informações sobre a operação de Cancelar gerenciamento.
zh_cn: 请参阅 `文档 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__，以了解有关取消管理操作的更多信息。
zh_tw: 如需取消管理作業的相關資訊，請參閱 `文件 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__。

source: Location update - gateway
de: Positionsaktualisierung - Gateway
ja: ロケーションの更新 - ゲートウェイ
pt_br: Atualização de local - gateway
zh_cn: 位置更新 - 网关
zh_tw: 位置更新 - 閘道

source: Gateways that can determine their location can choose to notify the IBM Watson Internet of Things Platform about location changes. The gateway can invoke one of the overloaded updateLocation() method to update the location of the device.
de: Bei Gateways, die ihre Position bestimmen können, kann festgelegt werden, dass IBM Watson Internet of Things Platform über Positionsänderungen informiert wird. Das Gateway kann eine der überladenen Methoden des Typs updateLocation() aufrufen, um die Position des Geräts zu aktualisieren.
ja: ロケーションを判別できるゲートウェイでは、ロケーションの変更を IBM Watson Internet of Things Platform に通知することを選択できます。ゲートウェイは、多重定義されたいずれかの updateLocation() メソッド呼び出して、デバイスのロケーションを更新することができます。
pt_br: Os gateways que podem determinar seu local podem escolher notificar o IBM Watson Internet of Things Platform sobre as mudanças de local. O gateway pode chamar um método updateLocation() sobrecarregado para atualizar o local do dispositivo.
zh_cn: 可以确定其位置的网关可以选择将位置更改通知给 IBM Watson Internet of Things Platform。网关可以调用其中一种重载 updateLocation() 方法来更新设备位置。
zh_tw: 可以判斷其位置的閘道可以選擇通知 IBM Watson Internet of Things Platform 有關其位置變更。閘道可以呼叫其中一個超載的 updateLocation() 方法來更新裝置位置。

source: Location update - attached devices
de: Positionsaktualisierung - angeschlossene Geräte
ja: ロケーションの更新 - 接続されているデバイス
pt_br: Atualização de local - dispositivos anexos
zh_cn: 位置更新 - 已连接设备
zh_tw: 位置更新 - 連接的裝置

source: The gateway can invoke corresponding device method updateDeviceLocation() to update the location of the attached devices. The overloaded method can be used to specify the measuredDateTime and etc..
de: Das Gateway kann die entsprechende Methode updateDeviceLocation() aufrufen, um die Position der angeschlossenen Geräte zu aktualisieren. Die überladene Methode kann dazu verwendet werden, measuredDateTime usw. anzugeben.
ja: ゲートウェイは、対応するデバイス・メソッド updateDeviceLocation() を呼び出して、接続されているデバイスのロケーションを更新できます。多重定義されたメソッドを使用して、measuredDateTime その他を指定できます。
pt_br: O gateway pode chamar o método de dispositivo updateDeviceLocation() correspondente para atualizar o local dos dispositivos anexos. O método sobrecarregado pode ser usado para especificar o measuredDateTime e etc..
zh_cn: 网关可以调用对应的设备方法 updateDeviceLocation() 来更新已连接设备的位置。重载方法可以用于指定 measuredDateTime 等。
zh_tw: 閘道可以呼叫對應的裝置方法 updateDeviceLocation() 來更新所連接裝置的位置。超載方法可用於指定 measuredDateTime 等。

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ for more information about the Location update.
de: Die `Dokumentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ enthält weitere Informationen zur Positionsaktualisierung.
ja: ロケーションの更新について詳しくは、`資料 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ を参照してください。
pt_br: Consulte a `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ para obter mais informações sobre a atualização do Local.
zh_cn: 请参阅 `文档 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__，以了解有关位置更新的更多信息。
zh_tw: 如需位置更新的相關資訊，請參閱 `文件 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__。

source: Append/Clear ErrorCodes - gateway
de: Hinzufügen/Löschen von Fehlercodes - Gateway
ja: ErrorCodes の付加/クリア - ゲートウェイ
pt_br: Anexar/limpar ErrorCodes - gateway
zh_cn: 追加/清除错误代码 - 网关
zh_tw: 附加/清除 ErrorCodes - 閘道

source: Gateways can choose to notify the IBM Watson Internet of Things Platform about changes in their error status. The gateway can invoke addErrorCode() method to add the current errorcode to Watson IoT Platform.
de: Gateways können angeben, dass IBM Watson Internet of Things Platform über Änderungen ihres Fehlerstatus informiert werden soll. Das Gateway kann die Methode addErrorCode() aufrufen, um den aktuellen Fehlercode zu Watson IoT Platform hinzuzufügen.
ja: ゲートウェイはエラー状況の変化について IBM Watson Internet of Things Platform に通知することを選択できます。ゲートウェイは、addErrorCode() メソッドを呼び出して、現在のエラー・コードを Watson IoT Platform に追加できます。
pt_br: Os gateways podem escolher notificar o IBM Watson Internet of Things Platform sobre mudanças em seus status de erro. O gateway pode chamar o método addErrorCode() para incluir o código de erro atual no Watson IoT Platform.
zh_cn: 网关可以选择将自己的错误状态更改通知给 IBM Watson Internet of Things Platform。网关可以调用 addErrorCode() 方法将当前错误代码添加到 Watson IoT Platform。
zh_tw: 閘道可以選擇通知 IBM Watson Internet of Things Platform 有關其錯誤狀態的變更。閘道可以呼叫 addErrorCode() 方法，來將現行錯誤碼新增至 Watson IoT Platform。

source: Also, the ErrorCodes of gateway can be cleared from IBM Watson Internet of Things Platform by calling the clearErrorCodes() method as follows:
de: Darüber hinaus können die Fehlercodes von Gateways aus IBM Watson Internet of Things Platform gelöscht werden, indem die Methode clearErrorCodes() wie folgt aufgerufen wird:
ja: また、次のように clearErrorCodes() メソッドを呼び出すことにより、IBM Watson Internet of Things Platform からゲートウェイの ErrorCodes をクリアすることもできます。
pt_br: Além disso, o ErrorCodes do gateway pode ser limpo do IBM Watson Internet of Things Platform chamando o método clearErrorCodes() como a seguir:
zh_cn: 此外，还可以调用 clearErrorCodes() 方法从 IBM Watson Internet of Things Platform 中清除网关的错误代码，如下所示：
zh_tw: 此外，呼叫 clearErrorCodes() 方法即可從 IBM Watson Internet of Things Platform 清除閘道的 ErrorCodes，如下所示：

source: Append/Clear ErrorCodes - attached devices
de: Hinzufügen/Löschen von Fehlercodes - angeschlossene Geräte
ja: ErrorCodes の付加/クリア - 接続されているデバイス
pt_br: Anexar/limpar ErrorCodes - dispositivos anexos
zh_cn: 追加/清除错误代码 - 已连接设备
zh_tw: 附加/清除 ErrorCodes - 連接的裝置

source: Similarly, the gateway can invoke the corresponding device method to add/clear the errorcodes of the attached devices,
de: Ebenso kann das Gateway die entsprechende Methode für Geräte aufrufen, um die Fehlercodes der angeschlossenen Geräte hinzuzufügen bzw. zu löschen.
ja: 同様に、ゲートウェイは対応するデバイス・メソッドを呼び出して、接続されているデバイスのエラー・コードを追加/クリアすることができます。
pt_br: Da mesma forma, o gateway pode chamar o método de dispositivo correspondente para incluir/limpar os códigos de erro dos dispositivos anexos,
zh_cn: 同样地，网关可以调用对应的设备方法来添加/清除已连接设备的错误代码。
zh_tw: 同樣，閘道可以呼叫對應的裝置方法來新增/清除所連接裝置的錯誤碼：

source: Append/Clear Log messages - gateway
de: Hinzufügen/Löschen von Protokollnachrichten - Gateway
ja: ログ・メッセージの付加/クリア - ゲートウェイ
pt_br: Anexar/limpar mensagens de log - gateway
zh_cn: 追加/清除日志消息 - 网关
zh_tw: 附加/清除日誌訊息 - 閘道

source: Gateways can choose to notify the IBM Watson Internet of Things Platform about changes by adding a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data. The gateways can invoke addGatewayLog() method to send log messages,
de: Gateways können angeben, dass IBM Watson Internet of Things Platform über Änderungen informiert werden soll, indem ein neuer Protokolleintrag hinzugefügt wird. Ein Protokolleintrag umfasst eine Protokollnachricht, ihre Zeitmarke und optional base64-codierte binäre Diagnosedaten. Die Gateways können die Methode addGatewayLog() zum Senden von Protokollnachrichten aufrufen.
ja: ゲートウェイは、新規ログ項目を追加することにより、変化について IBM Watson Internet of Things Platform に通知することを選択できます。ログ・エントリーには、ログ・メッセージ、タイム・スタンプと重大度、およびオプションで base64 でエンコードしたバイナリー診断データが含まれます。ゲートウェイは、addGatewayLog() メソッドを呼び出してログ・メッセージを送信できます。
pt_br: Os gateways podem escolher notificar o IBM Watson Internet of Things Platform sobre mudanças incluindo uma nova entrada de log. A entrada de log inclui mensagens de log, seus registros de data e hora e de gravidade, bem como dados diagnósticos binários opcionais codificados em base64. Os gateways podem chamar o método addGatewayLog() para enviar mensagens de log,
zh_cn: 网关可以选择通过添加新日志条目将更改通知给 IBM Watson Internet of Things Platform。日志条目包括日志消息、消息的时间戳记和严重性，以及采用 base64 编码的二进制诊断数据（可选）。网关可以调用 addGatewayLog() 方法来发送日志消息。
zh_tw: 閘道可以選擇透過新增日誌項目來通知 IBM Watson Internet of Things Platform 有關變更。日誌項目包括日誌訊息、其時間戳記和嚴重性，以及可能包含 base64 編碼的二進位診斷資料。閘道可以呼叫 addGatewayLog() 方法來傳送日誌訊息：

source: Also, the log messages can be cleared from IBM Watson Internet of Things Platform by calling the clearLogs() method as follows:
de: Darüber hinaus können die Protokollnachrichten aus IBM Watson Internet of Things Platform gelöscht werden, indem die Methode clearLogs() wie folgt aufgerufen wird:
ja: また、次のように clearLogs() メソッドを呼び出すことにより、IBM Watson Internet of Things Platform からログ・メッセージをクリアすることもできます。
pt_br: Além disso, as mensagens de log podem ser limpas do IBM Watson Internet of Things Platform chamando o método clearLogs() como a seguir:
zh_cn: 此外，还可以调用 clearLogs() 方法从 IBM Watson Internet of Things Platform 中清除日志消息，如下所示：
zh_tw: 此外，呼叫 clearLogs() 方法即可從 IBM Watson Internet of Things Platform 清除日誌訊息，如下所示：

source: Append/Clear Logs - attached devices
de: Hinzufügenn/Löschen von Protokollen - angeschlossene Geräte
ja: ログの付加/クリア - 接続されているデバイス
pt_br: Anexar/limpar logs - dispositivos anexos
zh_cn: 追加/清除日志 - 已连接设备
zh_tw: 附加/清除日誌 - 連接的裝置

source: Similarly, the gateway can invoke the corresponding device method to add/clear the Logs of the attached devices,
de: Ebenso kann das Gateway die entsprechende Methode für Geräte aufrufen, um die Protokolle der angeschlossenen Geräte hinzuzufügen bzw. zu löschen.
ja: 同様に、ゲートウェイは対応するデバイス・メソッドを呼び出して、接続されているデバイスのログを追加/クリアすることができます。
pt_br: Da mesma forma, o gateway pode chamar o método de dispositivo correspondente para incluir/limpar os Logs dos dispositivos anexos,
zh_cn: 同样地，网关可以调用对应的设备方法来添加/清除已连接设备的日志。
zh_tw: 同樣，閘道可以呼叫對應的裝置方法來新增/清除所連接裝置的日誌：

source: and to clear the Logs of attached devices, invoke the clearDeviceLogs() method with the details of the attached device,
de: Zum Löschen der Protokolle von angeschlossenen Geräten muss die Methode clearDeviceLogs() mit den Details des jeweiligen angeschlossenen Geräts aufgerufen werden.
ja: そして、接続されているデバイスのログをクリアするためには、接続されているデバイスの詳細を指定して clearDeviceLogs() メソッドを呼び出します。
pt_br: e para limpar os Logs dos dispositivos anexos, chame o método clearDeviceLogs() com os detalhes do dispositivo anexo,
zh_cn: 要清除已连接设备的日志，请使用已连接设备的详细信息来调用 clearDeviceLogs() 方法：
zh_tw: 若要清除所連接裝置的日誌，請使用所連接裝置的詳細資料來呼叫 clearDeviceLogs() 方法：
