Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: de, ja, pt_br, zh_cn, zh_tw

source: The device diagnostics operations are intended to provide information on gateway/device errors, and does not provide diagnostic information relating to the devices connection to the IBM Watson Internet of Things Platform.
de: Die Operationen zur Gerätediagnose sollen Informationen zu Gateway- bzw. Gerätefehlern bereitstellen und nicht Diagnoseinformationen zur Geräteverbindung zu IBM Watson Internet of Things Platform.
ja: デバイス診断操作の目的はゲートウェイ/デバイス・エラー情報を提供することです。デバイスと IBM Watson Internet of Things Platform の接続に関連した診断情報はここでは提供されません。
pt_br: As operações de diagnósticos de dispositivo são destinadas a fornecer informações sobre erros de gateway/dispositivo e não fornecem informações de diagnóstico em relação à conexão de dispositivos ao IBM Watson Internet of Things Platform.
zh_cn: 设备诊断操作用于提供有关网关/设备错误的信息，而不提供与 IBM Watson Internet of Things Platform 的设备连接相关的诊断信息。
zh_tw: 裝置診斷作業的目的是提供閘道/裝置錯誤的相關資訊，但不會提供與 IBM Watson Internet of Things Platform 的裝置連線相關的診斷資訊。

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ for more information about the Diagnostics operation.
de: Die `Dokumentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ enthält weitere Informationen zur Diagnoseoperation.
ja: 診断操作について詳しくは、`資料 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ を参照してください。
pt_br: Consulte `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ para obter mais informações sobre a operação Diagnósticos.
zh_cn: 请参阅 `文档 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__，以了解有关诊断操作的更多信息。
zh_tw: 如需診斷作業的相關資訊，請參閱 `文件 <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__。

source: Firmware Action
de: Firmwareaktion
ja: ファームウェア操作
pt_br: Ação de firmware
zh_cn: 固件操作
zh_tw: 韌體動作

source: The firmware update process is separated into two distinct actions:
de: Der Firmware-Update-Prozess untergliedert sich in zwei wesentliche Aktionen:
ja: ファームウェア更新プロセスは、2 つの別個の操作に分かれています。
pt_br: O processo de atualização de firmware é separado em duas ações distintas:
zh_cn: 固件更新过程分为以下两个不同的操作：
zh_tw: 韌體更新程序分為兩個不同的動作：

source: Downloading Firmware
de: Herunterladen der Firmware
ja: ファームウェアのダウンロード
pt_br: Download do firmware
zh_cn: 下载固件
zh_tw: 下載韌體

source: Updating Firmware.
de: Aktualisieren der Firmware
ja: ファームウェアの更新。
pt_br: Atualização do firmware.
zh_cn: 更新固件
zh_tw: 更新韌體。

source: The gateway needs to do the following activities to support Firmware Action for itself and for the attached devices:
de: Das Gateway muss die folgenden Aktivitäten ausführen, damit Firmwareaktionen für das Gateway selbst und für die angeschlossenen Geräte unterstützt werden:
ja: ゲートウェイは、それ自体および接続されているデバイスのファームウェア操作をサポートするために、次のアクティビティーを行う必要があります。
pt_br: O gateway precisa fazer as atividades a seguir para suportar a Ação de firmware para si e para os dispositivos anexos:
zh_cn: 网关需要完成以下活动来支持自身以及已连接设备的固件操作：
zh_tw: 閘道需要為它自己以及連接的裝置執行下列活動，才能支援「韌體動作」：

source: **1. Construct DeviceFirmware Object (Optional)**
de: **1. Erstellen eines DeviceFirmware-Objekts (optional)**
ja: **1. DeviceFirmware オブジェクトの構成 (オプション)**
pt_br: **1. Construir Objeto DeviceFirmware (Opcional)**
zh_cn: **1. 构造 DeviceFirmware 对象（可选）**
zh_tw: **1. 建構 DeviceFirmware 物件（選用）**

source: In order to perform Firmware action, the gateway can optionally construct a DeviceFirmware object for itself and for attached devices and add it to DeviceData as follows:
de: Zum Ausführen einer Firmwareaktion kann das Gateway optional ein DeviceFirmware-Objekt für das Gateway selbst und für angeschlossene Geräte erstellen und wie folgt zum Objekt DeviceData hinzufügen:
ja: ファームウェア操作を実行するには、次のように、ゲートウェイはオプションでそれ自体および接続されているデバイス用に DeviceFirmware オブジェクトを構成し、それを DeviceData に追加します。
pt_br: Para executar a ação de firmware, o gateway pode construir opcionalmente um objeto DeviceFirmware para si e para os dispositivos anexos e incluí-lo no DeviceData como a seguir:
zh_cn: 为了执行固件操作，网关可以选择为自身以及已连接设备构造 DeviceFirmware 对象，然后将其添加到 DeviceData，如下所示：
zh_tw: 為了執行「韌體」動作，閘道可以選擇性地為它自己以及連接的裝置建構 DeviceFirmware 物件，並將其新增至 DeviceData，如下所示：

source: And in the case of attached devices, the constructed DeviceData can be passed to the library while sending the manage request. i.e
de: Bei angeschlossenen Geräten kann das erstellte DeviceData-Objekt an die Bibliothek weitergeleitet werden, während die Managementanforderung gesendet wird. D. h.
ja: そして接続されているデバイスの場合、管理リクエストを送信する際に、構成された DeviceData をライブラリーに渡すことができます。つまり、
pt_br: E, no caso de dispositivos anexos, o DeviceData construído pode ser transmitido para a biblioteca ao enviar a solicitação de gerenciamento. Por exemplo
zh_cn: 对于已连接设备，构造的 DeviceData 可以在发送管理请求时传递到库。即
zh_tw: 若為連接的裝置，則可在傳送管理要求時將建構的 DeviceData 傳遞至程式庫。例如

source: The DeviceFirmware object represents the current firmware of the gateway or attached device and will be used to report the status of the Firmware Download and Firmware Update actions to IBM Watson Internet of Things Platform. In case this DeviceFirmware object is not constructed by the gateway, the library creates an empty object and reports the status to Watson IoT Platform.
de: Das DeviceFirmware-Objekt stellt die aktuelle Firmware des Gateways oder des angeschlossenen Geräts dar und wird dazu verwendet, den Status der Firmware-Download- und Firmware-Update-Aktionen an IBM Watson Internet of Things Platform zu melden. Falls dieses DeviceFirmware-Objekt nicht vom Gateway erstellt wird, erstellt die Bibliothek ein leeres Objekt und meldet den Status an Watson IoT Platform.
ja: DeviceFirmware オブジェクトは、ゲートウェイまたは接続されているデバイスの現在のファームウェアを表しており、IBM Watson Internet of Things Platform にファームウェア・ダウンロード・アクションおよびファームウェア更新アクションの状況を報告するために使用されます。この DeviceFirmware オブジェクトがゲートウェイによって構成されていない場合、ライブラリーは空のオブジェクトを作成して、状況を Watson IoT Platform に報告します。
pt_br: O objeto DeviceFirmware representa o firmware atual do gateway ou dispositivo anexo e será usado para relatar o status das ações de Download de firmware e Atualização de firmware ao IBM Watson Internet of Things Platform. No caso desse objeto DeviceFirmware não ser construído pelo gateway, a biblioteca criará um objeto vazio e relatará o status ao Watson IoT Platform.
zh_cn: DeviceFirmware 对象表示网关或已连接设备的当前固件，并且用于向 IBM Watson Internet of Things Platform 报告“固件下载”和“固件更新”操作的状态。库会创建一个空对象并向 Watson IoT Platform 报告状态，以防发生网关没有构造此 DeviceFirmware 对象的情况。
zh_tw: DeviceFirmware 物件代表閘道或所連接裝置的現行韌體，用來向 IBM Watson Internet of Things Platform 報告「韌體下載」及「韌體更新」動作的狀態。如果閘道未建構此 DeviceFirmware 物件，則程式庫會建立空物件並向 Watson IoT Platform 報告狀態。

source: **2. Inform the server about the Firmware action support**
de: **2. Informieren des Servers über die Firmware-Aktionsunterstützung**
ja: **2. サーバーへのファームウェア操作サポートの通知**
pt_br: **2. Informar o servidor sobre o suporte da ação de firmware**
zh_cn: **2. 向服务器发送有关固件操作支持的信息**
zh_tw: **2. 通知伺服器有關韌體動作支援**

source: The gateway/attached devices needs to set the firmware action flag to true in order for the server to initiate the firmware request. This can be achieved by passing true value for supportFirmwareActions parameter while sending the manage request.
de: Für das Gateway bzw. die angeschlossenen Geräte muss für das Firmwareaktionsflag 'true' festgelegt werden, damit der Server die Firmwareanforderung initiieren kann. Hierzu muss beim Senden der Managementanforderung der Wert 'true' für den Parameter supportFirmwareActions angegeben werden.
ja: サーバーがファームウェア・リクエストを開始するには、ゲートウェイや接続されているデバイスが、ファームウェア操作フラグを true に設定する必要があります。これは、supportFirmwareActions パラメーターに true の値を渡し、管理リクエストを送信することによって行うことができます。
pt_br: O gateway/dispositivos anexos precisam configurar a sinalização de ação de firmware como true para que o servidor inicie a solicitação de firmware. Isso pode ser atingido transmitindo o valor true para o parâmetro supportFirmwareActions ao enviar a solicitação de gerenciamento.
zh_cn: 网关/已连接设备需要将固件操作标记设置为 true，以便服务器发出固件请求。可以通过在发送管理请求时针对 supportFirmwareActions 参数传递 true 值来进行设置。
zh_tw: 閘道/連接的裝置需要將韌體動作旗標設為 true，伺服器才能起始韌體要求。在傳送管理要求時為 supportFirmwareActions 參數傳遞 true 值，即可達成此目的。

source: The gateway can invoke the following method to inform the server about its firmware support,
de: Das Gateway kann die folgende Methode aufrufen, um den Server über seine Firmwareunterstützung zu informieren.
ja: ゲートウェイは、以下のメソッドを呼び出して、ファームウェアをサポートしていることをサーバーに通知できます。
pt_br: O gateway pode chamar o método a seguir para informar o servidor sobre seu suporte de firmware.
zh_cn: 网关可以调用以下方法将固件支持通知给服务器：
zh_tw: 閘道可以呼叫下列方法來通知伺服器有關其韌體支援：

source: Similarly, the gateway can invoke the corresponding device method to inform the firmware support of attached devices,
de: Ebenso kann das Gateway die entsprechende Methode für Geräte aufrufen, um den Server über die Firmwareunterstützung der angeschlossenen Geräte zu informieren.
ja: 同様に、ゲートウェイは対応するデバイス・メソッドを呼び出して、接続されているデバイスがファームウェアをサポートしていることを通知できます。
pt_br: Da mesma forma, o gateway pode chamar o método de dispositivo correspondente para informar o suporte de firmware sobre os dispositivos anexos,
zh_cn: 同样地，网关可以调用对应的设备方法来通知已连接设备的固件支持。
zh_tw: 同樣，閘道可以呼叫對應的裝置方法來通知有關所連接裝置的韌體支援：

source: Once the support is informed to the DM server, the server then forwards the firmware actions to the gateway for the gateway itself/attached devices.
de: Nachdem die Unterstützungsinformationen an den DM-Server gemeldet wurden, leitet der Server die Firmwareaktionen für das Gateway selbst und die angeschlossenen Geräte an das Gateway weiter.
ja: サポートしていることが DM サーバーにいったん通知されれば、サーバーはゲートウェイ自体や接続されているデバイスのファームウェア操作をゲートウェイに転送します。
pt_br: Uma vez que o suporte é informado ao servidor DM, o servidor encaminha as ações de firmware ao gateway para o próprio gateway/dispositivos anexos.
zh_cn: 将支持通知给 DM 服务器之后，服务器便可以将网关自身/已连接设备的固件操作转发到网关。
zh_tw: 一旦向 DM 伺服器通知了支援狀況，伺服器即會將韌體動作轉遞至閘道本身/所連接裝置的閘道。

source: **3. Create the Firmware Action Handler**
de: **3. Erstellen des Firmwareaktionshandlers
ja: **3. ファームウェア操作ハンドラーの作成**
pt_br: **3. Criar o manipulador de ações de firmware**
zh_cn: **3. 创建固件操作处理程序**
zh_tw: **3. 建立韌體動作處理程式**

source: In order to support the Firmware action, the gateway needs to create a handler and add it to managedGateway. The handler must extend a DeviceFirmwareHandler class and implement the following methods:
de: Zur Unterstützung der Firmwareaktion muss das Gateway einen Handler erstellen und diesen zu managedGateway hinzufügen. Der Handler muss eine DeviceFirmwareHandler-Klasse erweitern und die folgenden Methoden implementieren:
ja: ファームウェア操作をサポートするために、ゲートウェイでハンドラーを作成し、それを managedGateway に追加する必要があります。ハンドラーは DeviceFirmwareHandler クラスを拡張し、以下のメソッドを実装する必要があります。
pt_br: Para suportar a Ação de firmware, o gateway precisa criar um manipulador e incluí-lo no managedGateway. O manipulador deve ampliar uma classe DeviceFirmwareHandler e implementar os seguintes métodos:
zh_cn: 为了支持固件操作，网关需要创建一个处理程序并将其添加到 managedGateway。该处理程序必须扩展 DeviceFirmwareHandler 类并实现以下方法：
zh_tw: 為了支援「韌體」動作，閘道需要建立處理程式，並將其新增至 managedGateway。處理程式必須擴充 DeviceFirmwareHandler 類別，並實作下列方法：

source: **Note**: There must be only one handler added to the library for both the gateway and attached devices where the firmware download/update requests will be redirected. The implementation must create a thread (possibly a pool of threads) to handle multiple firmware requests at the same time. A sample handler implementation with a threadpool is `demonstrated here <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__
de: **Hinweis**: Es darf nur ein Handler für das Gateway und die angeschlossenen Geräte, an das bzw. die die Firmware-Download-/-Updateanforderungen weitergeleitet werden, zur Bibliothek hinzugefügt werden. Die Implementierung muss einen Thread (möglicherweise einen Thread-Pool) erstellen, um mehrere gleichzeitige Firmwareanforderungen zu verarbeiten. Ein Beispiel für eine Handlerimplementierung mit einem Thread-Pool ist `hier dargestellt <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__
ja: **注**: ファームウェアのダウンロード/更新のリクエストを転送するゲートウェイおよび接続されているデバイスの両方に対して、ライブラリーは 1 つのハンドラーだけを追加する必要があります。実装では、複数のファームウェア・リクエストを同時に処理するためのスレッド (おそらく複数のスレッドのプール) を作成する必要があります。スレッドプールのあるハンドラー実装のサンプルは、`ここに示されています <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__
pt_br: **Nota**: deve haver somente um manipulador incluído na biblioteca para ambos os dispositivos de gateway e anexos em que as solicitações de download/atualização de firmware serão redirecionadas. A implementação deve criar um encadeamento (possivelmente um conjunto de encadeamentos) para manipular diversas solicitações de firmware ao mesmo tempo. Uma implementação de manipulador de amostra com um conjunto de encadeamentos é demonstrada aqui <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__
zh_cn: **注**：对于网关和已连接设备，在将固件下载/更新请求重定向到的库中，必须只能添加一个处理程序。该实现必须创建一个线程（可能是线程池）以同时处理多个固件请求。`此处演示了 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__使用线程池的样本处理程序实现
zh_tw: **附註**：只能為閘道及連接的裝置新增一個處理程式至程式庫（將在其中重新導向韌體下載/更新要求）。實作必須建立執行緒（可能還要建立執行緒儲存區），才能同時處理多個韌體要求。具有執行緒儲存區的範例處理程式實作 `示範如下 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__

source: **3.1 Sample implementation of downloadFirmware**
de: **3.1 Beispielimplementierung von downloadFirmware**
ja: **3.1 downloadFirmware のサンプル実装**
pt_br: **3.1 Implementação de amostra de downloadFirmware**
zh_cn: **3.1 downloadFirmware 的样本实现**
zh_tw: **3.1 downloadFirmware 實作範例**

source: The implementation must add a logic to download the firmware and report the status of the download via DeviceFirmware object. If the Firmware Download operation is successful, then the state of the firmware to be set to DOWNLOADED and UpdateStatus should be set to SUCCESS.
de: Die Implementierung muss eine Logik hinzufügen, um die Firmware herunterzuladen und den Status des Downloads über das Objekt DeviceFirmware zu melden. Wenn die Firmware-Downloadoperation erfolgreich ist, muss der Status der Firmware auf DOWNLOADED gesetzt werden, und UpdateStatus muss auf SUCCESS gesetzt werden.
ja: 実装では、ファームウェアをダウンロードして DeviceFirmware オブジェクト経由でダウンロードの状況を報告するロジックを追加する必要があります。ファームウェア・ダウンロード操作が正常に完了した場合、ファームウェアの状態を DOWNLOADED に設定する必要があり、UpdateStatus を SUCCESS に設定する必要があります。
pt_br: A implementação deve incluir uma lógica para fazer download do firmware e relatar o status do download pelo objeto DeviceFirmware. Se a operação de download do firmware for bem-sucedida, o estado do firmware será configurado como DOWNLOADED e UpdateStatus será configurado como SUCCESS.
zh_cn: 该实现必须添加用于下载固件的逻辑，并且通过 DeviceFirmware 对象报告下载的状态。如果“固件下载”操作成功，那么固件的状态将会设置为 DOWNLOADED，UpdateStatus 应设置为 SUCCESS。
zh_tw: 實作必須新增邏輯以下載韌體，並透過 DeviceFirmware 物件報告下載的狀態。如果「韌體下載」作業順利完成，則韌體的狀態會設為 DOWNLOADED，而 UpdateStatus 應設為 SUCCESS。

source: If an error occurs during Firmware Download the state should be set to IDLE and updateStatus should be set to one of the error status values:
de: Wenn während des Firmware-Downloads ein Fehler auftritt, muss der Status auf IDLE gesetzt werden und für updateStatus muss einer der Fehlerstatuswerte festgelegt werden:
ja: ファームウェア・ダウンロード中にエラーが発生した場合、状態を IDLE に設定する必要があり、updateStatus が以下のエラー状態値のいずれかになるように設定する必要があります。
pt_br: Caso ocorra um erro durante o download do firmware, o estado deve ser configurado como IDLE e updateStatus deve ser configurado como um dos valores de status de erro:
zh_cn: 如果“固件下载”期间出错，那么 state 应当设置为 IDLE，updateStatus 应当设置为以下某个错误状态值：
zh_tw: 如果「韌體下載」期間發生錯誤，則狀態應設為 IDLE，而 updateStatus 應設為其中一個錯誤狀態值：

source: A sample Firmware Download implementation is shown below, (The below code doesn't include the threadpool part, refer to the `github sample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ for the complete implementation of the FirmwareHandler).
de: Ein Beispiel für eine Firmware-Download-Implementierung ist nachfolgend dargestellt. (Der nachfolgend dargestellte Code enthält den Abschnitt für den Thread-Pool nicht. Das `GitHub-Beispiel <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ veranschaulicht die vollständige Implementierung von FirmwareHandler.)
ja: ファームウェア・ダウンロード実装のサンプルが以下に示されています。(以下のコードにはスレッドプールの部分が含まれていません。FirmwareHandler の完全な実装については、`github サンプル <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ を参照してください。)
pt_br: Uma implementação de Download de firmware de amostra é mostrada abaixo, (o código abaixo não inclui a parte do conjunto de encadeamentos, consulte a amostra `github <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ para a implementação completa do FirmwareHandler).
zh_cn: 以下显示了样本固件下载实现（以下代码不包含线程池部分，请参阅 `github 样本 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__，以了解完整的 FirmwareHandler 实现）。
zh_tw: 以下所示為範例「韌體下載」實作（下面的程式碼不包含執行緒儲存區部分，如需 FirmwareHandler 的完整實作，請參閱 `github 範例 <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__）。

source: Gateway can check the integrity of the downloaded firmware image using the verifier and report the status back to IBM Watson Internet of Things Platform. The verifier can be set by the gateway during the startup (while creating the DeviceFirmware Object) or as part of the Download Firmware request by the application. A sample code to verify the same is below:
de: Das Gateway kann die Integrität des heruntergeladenen Firmware-Images prüfen, indem die Prüffunktion verwendet und der Status zurück an IBM Watson Internet of Things Platform gemeldet wird. Die Prüffunktion kann von dem Gateway beim Start (beim Erstellen des DeviceFirmware-Objekts) oder als Teil der Download-Firmware-Anforderung von der Anwendung festgelegt werden. Nachfolgend ein Beispielcode zur Überprüfung:
ja: ゲートウェイでは、ダウンロードしたファームウェア・イメージの整合性をベリファイヤーを使用して検査し、その状況を IBM Watson Internet of Things Platform に報告できます。ベリファイヤーは、開始時 (DeviceFirmware オブジェクトの作成中) にゲートウェイで設定することもできますし、アプリケーションでファームウェア・ダウンロード・リクエストの一部として設定することもできます。同一性を検証するサンプル・コードを以下に示します。
pt_br: O gateway pode verificar a integridade da imagem de firmware transferida por download usando o verificador e relatar o status novamente para o IBM Watson Internet of Things Platform. O verificador pode ser configurado pelo gateway durante a inicialização (ao criar o Objeto DeviceFirmware) ou como parte da solicitação de Download de firmware pelo aplicativo. A seguir é mostrado um código de amostra para fazer essa verificação:
zh_cn: 网关可使用验证器检查已下载固件映像的完整性，并将状态报告给 IBM Watson Internet of Things Platform。验证器可由网关在启动期间（创建 DeviceFirmware 对象时）设置，也可以作为“下载固件”请求的组成部分由应用程序设置。用于验证是否一致的样本代码如下：
zh_tw: 閘道可使用驗證器來檢查已下載韌體映像檔的完整性，並將狀態回報給 IBM Watson Internet of Things Platform。驗證器可由閘道在啟動期間（建立「DeviceFirmware 物件」時）進行設定，或者由應用程式當作「下載韌體」要求的一部分進行設定。驗證相同的範例程式碼如下：

source: The complete code can be found in the gateway management sample `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__.
de: Den vollständigen Code finden Sie im Gatewaymanagementbeispiel `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__.
ja: コード全体は、ゲートウェイ管理サンプル `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ にあります。
pt_br: O código completo pode ser localizado na amostra de gerenciamento de gateway `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__.
zh_cn: 完整的代码可以在网关管理样本 `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__中找到。
zh_tw: 完整的程式碼位於閘道管理範例 `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__。

source: **3.2 Sample implementation of updateFirmware**
de: **3.2 Beispielimplementierung von updateFirmware**
ja: **3.2 updateFirmware のサンプル実装**
pt_br: **3.2 Implementação de amostra de updateFirmware**
zh_cn: **3.2 updateFirmware 的样本实现**
zh_tw: **3.2 updateFirmware 實作範例**

source: The implementation must create a separate thread and add a logic to install the downloaded firmware and report the status of the update via DeviceFirmware object. If the Firmware Update operation is successful, then the state of the firmware should to be set to IDLE and UpdateStatus should be set to SUCCESS.
de: Die Implementierung muss einen separaten Thread erstellen und eine Logik hinzufügen, um die heruntergeladene Firmware zu installieren und den Status der Aktualisierung über das DeviceFirmware-Objekt zu melden. Wenn die Firmware-Update-Operation erfolgreich ist, muss der Status der Firmware auf IDLE gesetzt werden, und UpdateStatus muss auf SUCCESS gesetzt werden.
ja: 実装では、別のスレッドを作成して、ダウンロードされたファームウェアをインストールして DeviceFirmware オブジェクト経由で更新の状況を報告するロジックを追加する必要があります。ファームウェア更新操作が正常に完了した場合、ファームウェアの状態を IDLE に設定する必要があり、UpdateStatus を SUCCESS に設定する必要があります。
pt_br: A implementação deve criar um encadeamento separado e incluir uma lógica para instalar o firmware transferido por download e relatar o status da atualização pelo objeto DeviceFirmware. Se a operação de atualização de firmware for bem-sucedida, o status do firmware deve ser configurado como IDLE e UpdateStatus deve ser configurado como SUCCESS.
zh_cn: 该实现必须创建单独的线程和添加逻辑来安装下载的固件，并通过 DeviceFirmware 对象报告更新的状态。如果“固件更新”操作成功，那么固件的状态应当设置为 IDLE，UpdateStatus 应当设置为 SUCCESS。
zh_tw: 實作必須建立個別執行緒並新增邏輯以安裝已下載的韌體，並透過 DeviceFirmware 物件報告更新的狀態。如果「韌體更新」作業順利完成，則韌體的狀態應設為 IDLE，而 UpdateStatus 應設為 SUCCESS。
