Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/mqtt.po
Languages: it, ja, zh_cn

source: If your managed gateway uses a durable subscription (cleansession=false) you need to be aware that device management commands sent to your gateway while it is offline will be reported as failed operations, however, when the gateway later connects those requests will be actioned by the gateway.
it: Se il gateway gestito utilizza una sottoscrizione duratura (cleansession=false) bisogna essere consapevoli che i comandi di gestione dispositivo inviati al gateway mentre questo non è in linea, verranno segnalate come operazioni non riuscite, tuttavia, quando il gateway, in un secondo momento, si connette attiverà tali richieste.
ja: 管理対象ゲートウェイで永続サブスクリプションを使用する (cleansession=false) 場合は、オフライン時にゲートウェイに送信されたデバイス管理コマンドが、失敗した操作として報告されますが、それらのリクエストは、後でゲートウェイが接続したときに処理されることに注意してください。
zh_cn: 如果受管网关使用持久预订 (cleansession=false)，那么需要注意，在网关脱机时向其发送的设备管理命令将报告为失败操作，但在网关稍后连接时，网关将会处理这些请求。

source: When handling failures it is important to take this into account if you are using durable subscriptions for your managed gateways.
it: Nel caso un cui la gestione ha esito negativo, è importante considerare se si stanno utilizzando sottoscrizioni durature per i gateway gestiti.
ja: 管理対象ゲートウェイで永続サブスクリプションを使用する場合は、失敗に対処する際に、この点を考慮する必要があります。
zh_cn: 在处理故障时，如果对受管网关使用的是持久预订，请务必将此考虑在内。

source: Topics
it: Argomenti
ja: トピック
zh_cn: 主题

source: A managed gateway is required to subscribe to two topics to handle requests and responses from IoT Platform:
it: Un gateway gestito deve effettuare la sottoscrizione a due argomenti per gestire le richieste e le risposte da IoT Platform:
ja: IoT Platform からのリクエストと応答を処理するために、管理対象ゲートウェイは以下の 2 つのトピックをサブスクライブする必要があります。
zh_cn: 受管网关需要预订两个主题以处理来自 IoT Platform 的请求和响应：

source: The managed gateway will subscribe to device management reponses on ``iotdm-1/type/<typeId>/id/<deviceId>/response/+``
it: Il gateway gestito effettuerà la sottoscrizione alle risposte della gestione dispositivo su ``iotdm-1/type/<typeId>/id/<deviceId>/response/+``
ja: 管理対象ゲートウェイは、``iotdm-1/type/<typeId>/id/<deviceId>/response/+`` でデバイス管理応答をサブスクライブします。
zh_cn: 受管网关将在“iotdm-1/type/<typeId>/id/<deviceId>/response/+”上预订设备管理响应

source: The managed gateway will subscribe to device management requests on ``iotdm-1/type/<typeId>/id/<deviceId>/+``
it: Il gateway gestito effettuerà la sottoscrizione alle richieste di gestione dispositivo su ``iotdm-1/type/<typeId>/id/<deviceId>/+``
ja: 管理対象ゲートウェイは、``iotdm-1/type/<typeId>/id/<deviceId>/+`` でデバイス管理リクエストをサブスクライブします。
zh_cn: 受管网关将在“iotdm-1/type/<typeId>/id/<deviceId>/+”上预订设备管理请求

source: A managed gateway will publish to two topics:
it: Un gateway gestito pubblicherà due argomenti:
ja: 管理対象ゲートウェイは、以下の 2 つのトピックにパブリッシュします。
zh_cn: 受管网关将发布到两个主题：

source: The managed gateway will publish device management responses on ``iotdevice-1/type/<typeId>/id/<deviceId>/response/``
it: Il gateway gestito pubblicherà le risposte di gestione dispositivo su ``iotdevice-1/type/<typeId>/id/<deviceId>/response/``
ja: 管理対象ゲートウェイは、``iotdevice-1/type/<typeId>/id/<deviceId>/response/`` にデバイス管理応答をパブリッシュします。
zh_cn: 受管网关将在“iotdevice-1/type/<typeId>/id/<deviceId>/response/”上发布设备管理响应

source: The managed gateway will publish device management requests on ``iotdevice-1/type/<typeId>/id/<deviceId>/``
it: Il gateway gestito pubblicherà le richieste di gestione dispositivo su ``iotdevice-1/type/<typeId>/id/<deviceId>/``
ja: 管理対象ゲートウェイは、``iotdevice-1/type/<typeId>/id/<deviceId>/`` にデバイス管理リクエストをパブリッシュします。
zh_cn: 受管网关将在“iotdevice-1/type/<typeId>/id/<deviceId>/”上发布设备管理请求

source: The gateway is able to process device management protocol messages for both itself and on behalf other connected devices by using the relevant <typeId> and <deviceId>.
it: Il gateway è in grado di elaborare i messaggi del protocollo di gestione dispositivo per se stesso e per conto di altri dispositivi connessi utilizzando <typeId> e <deviceId> pertinenti.
ja: ゲートウェイは、適切な <typeId> と <deviceId> を使用して、ゲートウェイ自体のデバイス管理プロトコル・メッセージを処理することも、接続している他のデバイスの代わりにデバイス管理プロトコル・メッセージを処理することもできます。
zh_cn: 网关能够通过使用相关的 <typeId> 和 <deviceId> 从其自身和代表其他已连接设备来处理设备管理协议消息。

source: Message Format
it: Formato messaggio
ja: メッセージの形式
zh_cn: 消息格式

source: All messages are sent in JSON format. There are two types of message.
it: Tutti i messaggi vengono inviati in formato JSON. Ci sono due tipi di messaggio.
ja: すべてのメッセージは JSON 形式で送信されます。メッセージには 2 つのタイプがあります。
zh_cn: 所有消息都以 JSON 格式进行发送。有两种类型的消息。

source: Request
it: Richiesta
ja: リクエスト
zh_cn: 请求

source: Requests are formatted as follows:
it: Le richieste vengono formattate come segue:
ja: リクエストのフォーマットは以下のとおりです。
zh_cn: 请求的格式如下：

source: ``d`` carries any data relevant to the request
it: ``d`` fornisce i dati pertinenti alla richiesta
ja: ``d`` は、リクエストに関連するデータです。
zh_cn: “d”传送与请求相关的所有数据

source: ``reqId`` is an identifier of the request, and must be copied into a response. If a response is not required, the field should be omitted.
it: ``reqId`` è un identificativo della richiesta e deve essere copiato in una risposta. Se non è richiesta una risposta, il campo deve essere omesso.
ja: ``reqId`` は、リクエストの ID であり、応答にコピーする必要があります。応答が不要な場合は、このフィールドを省略する必要があります。
zh_cn: “reqId”是请求的标识，必须复制到响应中。如果不需要响应，那么应省略此字段。

source: Response
it: Risposta
ja: 応答
zh_cn: 响应

source: Responses are formatted as follows:
it: Le risposte vengono formattate come segue:
ja: 応答のフォーマットは以下のとおりです。
zh_cn: 响应的格式如下：

source: "rc" is a result code of the original request.
it: "rc" è un codice di risultato della richiesta originale.
ja: "rc" は、元のリクエストの結果コードです。
zh_cn: “rc”是原始请求的结果代码。

source: ``message`` is an optional element with a text description of the response code.
it: ``message`` è un elemento facoltativo con una descrizione di testo del codice risposta.
ja: ``message`` はオプション要素で、応答コードのテキスト記述が入ります。
zh_cn: “message”是包含响应代码的文本描述的可选元素。

source: ``d`` is an optional data element accompanying the response.
it: ``d`` è un elemento dati facoltativo che accompagna la risposta.
ja: ``d`` は、応答に付随するオプションのデータ要素です。
zh_cn: “d”是伴随响应的可选数据元素。

source: ``reqId`` is the request ID of the original request. This is used to correlate responses with requests, and the device needs to ensure that all request IDs are unique. When responding to IoT Platform requests, the correct ``reqId`` value must be sent in the response.
it: ``reqId`` è l'ID richiesta della richiesta originale. Questo ID viene utilizzato per correlare le risposte alle richieste e il dispositivo deve accertarsi che tutti gli ID richiesta siano univoci. Quando si risponde alle richieste IoT Platform, è necessario inviare il valore corretto `reqId`` nella risposta.
ja: ``reqId`` は、元のリクエストのリクエスト ID です。この ID によって応答をリクエストと対応付けるため、デバイスはすべてのリクエスト ID を固有の ID にする必要があります。IoT Platform のリクエストに応答するときに、正しい ``reqId`` 値を応答に含めて送信する必要があります。
zh_cn: “reqId”是原始请求的请求标识。这用于将响应与请求相关联，并且设备需要确保所有请求标识都唯一。在对 IoT Platform 请求进行响应时，必须在响应中发送正确的“reqId”值。

source: device1
it: dispositivo1
