Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/mqtt.po
Languages: it, ja, zh_cn

source: MQTT Connectivity for Gateways
it: Connettività MQTT per i gateway
ja: MQTT ゲートウェイ接続
zh_cn: 网关的 MQTT 连接

source: MQTT client connection
it: Connessione client MQTT
ja: MQTT クライアント接続
zh_cn: MQTT 客户机连接

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for gateways in that organization.
it: Ogni organizzazione registrata dispone di un endpoint univoco che deve essere utilizzato durante la connessione dei client MQTT per i gateway in tale organizzazione.
ja: どの登録済み組織にも固有のエンドポイントがあり、その組織でゲートウェイの MQTT クライアントを接続する際には、そのエンドポイントを使用する必要があります。
zh_cn: 每个注册组织都具有唯一端点，在连接该组织中网关的 MQTT 客户机时必须使用此端点。

source: In the IoT Platform dashboard, devices and gateways which are connected directly to the IoT Platform display a status icon indicating that they are connected. The dashboard displays devices which are connected indirectly via a gateway as disconnected as it does not have any knowledge of a devices connectivity to the gateway.
it: Nel dashboard di IoT Platform, i dispositivi ed i gateway direttamente connessi a IoT Platform presentano un'icona di stato che indica che sono connessi. Il dashboard visualizza i dispositivi che sono collegati in modo indiretto, attraverso un gateway, come disconnessi, poiché ne non rileva lo stato della connessione al gateway.
ja: IoT Platform に直接接続されているデバイスやゲートウェイについては、それらが接続されていることを示す状況アイコンが IoT Platform ダッシュボードに表示されます。ゲートウェイに対するデバイス接続は認識されないため、ゲートウェイを介して間接的に接続されているデバイスは、切断されているものとしてダッシュボードに表示されます。
zh_cn: 在 IoT Platform 仪表板中，直接连接到 IoT Platform 的设备和网关会显示一个状态图标，用以指示它们已连接。对于通过网关间接连接的设备，该仪表板会将其显示为已断开连接，因为它未检测到关于设备连接到网关的任何信息。

source: Unencrypted client connection
it: Connessione client non codificata
ja: 非暗号化クライアント接続
zh_cn: 未加密客户机连接

source: Connect on port **1883**
it: Connessione alla porta **1883**
ja: ポート **1883** での接続
zh_cn: 在端口 **1883** 上连接

source: All information your gateway submits is being sent in plain text (including the authentication credentials for your gateway). We recommend the use of an encrypted connection whenever possible.
it: Tutte le informazioni inoltrate dal gateway sono inviate in chiaro (incluso le credenziali di autenticazione per il gateway). Si consiglia di utilizzare una connessione codificata ogni qualvolta sia possibile.
ja: ゲートウェイが送信するすべての情報は、プレーン・テキストで送信されます (ゲートウェイの認証資格情報を含む)。可能な限り、暗号化接続を使用することをお勧めします。
zh_cn: 网关提交的所有信息都以明文形式发送（包括网关的认证凭证）。我们建议尽可能使用加密连接。

source: Encrypted client connection
it: Connessione client codificata
ja: 暗号化クライアント接続
zh_cn: 加密客户机连接

source: Connect on port **8883** or **443** for websockets. In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
it: Connessione alla porta **8883** o **443** per websocket. In molte librerie client sarà necessario fornire il certificato pubblico del server nel formato pem. Il seguente file contiene l'intera catena certificato per \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
ja: Web ソケットのポート **8883** または **443** での接続。多くのクライアント・ライブラリーでは、サーバーの公開証明書を pem 形式で提供する必要があります。以下のファイルには、\*.messaging.internetofthings.ibmcloud.com: messaging.pem_ の証明書チェーン全体が含まれています。
zh_cn: 针对 Web 套接字，在端口 **8883** 或 **443** 上连接。在许多客户机库中，您将需要以 pem 格式提供服务器的公用证书。以下文件包含 \*.messaging.internetofthings.ibmcloud.com: messaging.pem_ 的整个证书链

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
it: È stato notato che alcune librerie client SSL non gestiscono domini con caratteri jolly, nel qual caso, se non è possibile modificare librerie, sarà necessario disattivare il controllo del certificato.
ja: SSL クライアント・ライブラリーの中には、ドメイン部分のワイルドカードを処理しないものがあります。その場合、ライブラリーを変更できないのであれば、証明書チェックをオフにするしかありません。
zh_cn: 经证实，一些 SSL 客户机库不会处理带通配符的域，在此情况下，如果无法更改库，那么您将需要关闭证书检查。

source: The IoT Platform requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
it: IoT Platform richiede TLS v1.2. Si consigliano le seguenti suite di cifratura: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 o AES128-GCM-SHA256 *(dal 1° giugno 2015)*.
ja: IoT Platform では TLS v1.2 が必要です。推奨される暗号スイートは次のとおり: ECDHE-RSA-AES256-GCM-SHA384、AES256-GCM-SHA384、ECDHE-RSA-AES128-GCM-SHA256、または AES128-GCM-SHA256 *(2015 年 6 月 1 日現在)
zh_cn: IoT Platform 需要 TLS v1.2。我们建议使用以下密码套件：ECDHE-RSA-AES256-GCM-SHA384、AES256-GCM-SHA384、ECDHE-RSA-AES128-GCM-SHA256 或 AES128-GCM-SHA256 *（自 2015 年 6 月 1 日起）*。

source: MQTT client identifier
it: Identificativo client MQTT
ja: MQTT クライアント ID
zh_cn: MQTT 客户机标识

source: A gateway must authenticate using a client ID in the following format:
it: Un gateway deve autenticarsi utilizzando l'ID client nel seguente formato:
ja: ゲートウェイは、以下の形式のクライアント ID を使用して認証する必要があります。
zh_cn: 网关必须使用以下格式的客户机标识进行认证：

source: **g** idenfities your client as a gateway
it: **g** identifica il client come un gateway
ja: **g** は、ゲートウェイとして使用するクライアントです
zh_cn: **g** 将客户机识别为网关

source: **orgId** is your unique organization ID, assigned when you sign up with the service. It will be a 6 character alphanumeric string.
it: **orgId** è l'ID organizzazione univoco assegnato quando ci si iscrive al servizio. Sarà una stringa di 6 caratteri alfanumerici.
ja: **orgId** は、サービス登録時に割り当てられる固有の組織 ID です。これは 6 文字の英数字ストリングです。
zh_cn: **orgId** 是在您注册服务时分配的唯一组织标识。它将是 6 字符字母数字字符串。

source: **typeId** is intended to be used as an identifier of the type of gateway connecting, it may be useful to think of this as analogous to a model number.
it: **typeId** è destinato ad essere utilizzato come un identificativo del tipo di gateway utilizzato per la connessione, può risultare utile considerarlo simile ad un numero di modello.
ja: **typeId** は、接続するゲートウェイのタイプ ID として使用するためのものであり、型式番号のようなものと考えることができます。
zh_cn: **typeId** 旨在用作进行连接的网关类型的标识，将其视为类似于型号可能会很有用。

source: **deviceId** must uniquely identify a gateway device across all gateways of a specific type, it may be useful to think of this as analogous to a serial number.
it: **deviceId** deve identificare univocamente un dispositivo gateway tra tutti i gateway di uno specifico tipo, può risultare utile considerarlo simile ad un numero seriale.
ja: **deviceId** は、特定のタイプのすべてのゲートウェイの間で 1 つのゲートウェイ・デバイスを一意的に識別するものでなければなりません。これは、シリアル番号のようなものと考えることができます。
zh_cn: **deviceId** 必须在特定类型的所有网关中唯一识别网关设备，将其视为类似于序列号可能会很有用。

source: You can use any scheme of your choice when assigning values for ``typeId`` and ``deviceId``, however the following restrictions apply to both:
it: È possibile utilizzare uno schema a propria scelta durante l'assegnazione dei valori per ``typeId`` e ``deviceId``, tuttavia le seguenti limitazioni si applicano ad entrambi:
ja: ``typeId`` と ``deviceId`` の値を割り当てるときには任意のスキームを使用できますが、どちらにも以下の制限が適用されます。
zh_cn: 在为“typeId”和“deviceId”分配值时，可以使用所选的任何方案，但两者均有以下限制：

source: Maximum length of 36 characters
it: Lunghezza massima di 36 caratteri
ja: 最大長 36 文字
zh_cn: 最大长度为 36 个字符

source: Must comprise only alpha-numeric characters (``a-z``, ``A-Z``, ``0-9``) and the following special characters:
it: Devono contenere solo caratteri alfanumerici (``a-z``, ``A-Z``, ``0-9``) e i seguenti caratteri speciali:
ja: 英数字 (``a-z``、``A-Z``、``0-9``) および以下の特殊文字のみで構成する必要があります。
zh_cn: 必须仅包含字母数字字符（“a-z”、“A-Z”和“0-9”）和以下特殊字符：

source: dash (``-``)
it: trattino (``-``)
ja: ダッシュ (``-``)
zh_cn: 短划线（“-”）

source: underscore (``_``)
it: sottolineatura (``_``)
ja: 下線 (``_``)
zh_cn: 下划线（“_”）

source: dot (``.``)
it: punto (``.``)
ja: ドット (``.``)
zh_cn: 点（“.”）

source: MQTT authentication
it: Autenticazione MQTT
ja: MQTT 認証
zh_cn: MQTT 认证

source: Username
it: Nome utente
ja: ユーザー名
zh_cn: 用户名

source: The service currently only supports token-based authentication for devices, as such there is only one valid username for gateways today.
it: Il servizio attualmente supporta per i dispositivi solo l'autenticazione basata su token pertanto ad oggi esiste solo un nome utente valido per i gateway.
ja: 現在、サービスがデバイスに対してサポートしているのはトークン・ベースの認証のみであるため、ゲートウェイの有効なユーザー名は 1 つのみです。
zh_cn: 服务当前仅支持针对设备进行基于令牌的认证，因此目前针对网关仅有一个有效用户名。

source: A value of ``use-token-auth`` indicates to the service that the authentication token for the gateway will be passed as the password for the MQTT connection.
it: Un valore di ``use-token-auth`` indica al servizio che il token di autenticazione per il gateway verrà passato come la password per la connessione MQTT.
ja: 値を ``use-token-auth`` にすると、ゲートウェイの認証トークンが MQTT 接続のパスワードとして渡されることをサービスに対して通知することになります。
zh_cn: 值“use-token-auth”向服务表明：网关的认证令牌将作为 MQTT 连接的密码进行传递。

source: Password
ja: パスワード
zh_cn: 密码

source: When using token based authentication submit the device authentication token as the password when making your MQTT connection.
it: Quando si utilizza l'autenticazione basata sul token, inoltrare il token di autenticazione del dispositivo come la password quando si effettua la connessione MQTT.
ja: トークン・ベースの認証を使用する場合、MQTT 接続時にデバイス認証トークンをパスワードとして送信します。
zh_cn: 如果使用基于令牌的认证，请在建立 MQTT 连接时，将设备认证令牌作为密码提交。

source: Publishing events
it: Pubblicazione degli eventi
ja: イベントのパブリッシング
zh_cn: 发布事件

source: A gateway can publish events from itself and on behalf of any device connected via the gateway by using the following topic and substituting in the appropriate ``typeId`` and ``deviceId`` based on the intended origin of the event:
it: Un gateway può pubblicare gli eventi autonomamente e per conto di un dispositivo connesso mediante il gateway utilizzando il seguente argomento e la sostituzione nell'appropriato ``typeId`` e ``deviceId`` in base all'origine dell'evento:
ja: ゲートウェイは、以下のトピックを使用し、イベントの生成元に基づいて ``typeId`` と ``deviceId`` を適切な値に置き換えることで、ゲートウェイ自体のイベントをパブリッシュすることも、ゲートウェイを経由して接続しているデバイスの代わりにイベントをパブリッシュすることもできます。
zh_cn: 通过使用以下主题并基于意向事件源在相应的“typeId”和“deviceId”中进行替换，网关可以从其自身发布事件，并可代表通过网关连接的任何设备发布事件：

source: Example
it: Esempio
ja: 例
zh_cn: 示例

source: Gateway 1
ja: ゲートウェイ 1
zh_cn: 网关 1

source: Device 1
it: Dispositivo 1
ja: デバイス 1
zh_cn: 设备 1

source: Gateway 1 can publish its own status events: ``iot-2/type/mygateway/id/gateway1/evt/status/fmt/json``
it: Il gateway 1 può pubblicare i propri eventi di stato: ``iot-2/type/mygateway/id/gateway1/evt/status/fmt/json``
ja: ゲートウェイ 1 が、ゲートウェイ自体のステータス・イベントをパブリッシュする場合は、``iot-2/type/mygateway/id/gateway1/evt/status/fmt/json`` になります。
zh_cn: 网关 1 可以发布自己的状态事件：“iot-2/type/mygateway/id/gateway1/evt/status/fmt/json”

source: Gateway 1 can publish status events on behalf of Device 1: ``iot-2/type/mydevice/id/device1/evt/status/fmt/json``
it: Il gateway 1 può pubblicare gli eventi di stato per conto del dispositivo 1: ``iot-2/type/mydevice/id/device1/evt/status/fmt/json``
ja: ゲートウェイ 1 が、デバイス 1 の代わりにステータス・イベントをパブリッシュする場合は、``iot-2/type/mydevice/id/device1/evt/status/fmt/json`` になります。
zh_cn: 网关 1 可以代表设备 1 发布状态事件：“iot-2/type/mydevice/id/device1/evt/status/fmt/json”

source: The message payload is limited to a maximum of 131072 bytes. Messages larger than this will be rejected.
it: Il payload dei messaggi è limitato ad un massimo di 131072 byte. I messaggi di dimensioni superiori a questo verranno respinti.
ja: メッセージ・ペイロードは最大 131072 バイトに制限されます。これより大きいメッセージは拒否されます。
zh_cn: 消息有效内容限制为最长 131072 个字节。将拒绝大于此大小的消息。

source: Subscribing to commands
it: Sottoscrizione ai comandi
ja: コマンドのサブスクライブ
zh_cn: 预订命令

source: A gateway can subscribe to commands directed at the gateway itself and to any device connected via the gateway by using the following topic and substituting in the appropriate ``typeId`` and ``deviceId``:
it: Un gateway può effettuare la sottoscrizione ai comandi diretti al gateway stesso e a qualsiasi dispositivo connesso mediante il gateway utilizzando il seguente argomento e la sostituzione nell'appropriato ``typeId`` e ``deviceId``:
ja: ゲートウェイは、以下のトピックを使用し、``typeId`` と ``deviceId`` を適切な値に置き換えることで、ゲートウェイ自体に対するコマンドをサブスクライブすることも、ゲートウェイを経由して接続しているデバイスに対するコマンドをサブスクライブすることもできます。
zh_cn: 通过使用以下主题并在相应的“typeId”和“deviceId”中进行替换，网关可以预订针对网关自身的命令和通过网关连接的任何设备：

source: The MQTT ``+`` wildcard can be used for ``typeId``, ``deviceId``, ``commandId`` and ``formatString`` to subscribe to multiple command sources.
it: MQTT ``+`` il carattere jolly possono essere utilizzati per ``typeId``, ``deviceId``, ``commandId`` e ``formatString`` per effettuare la sottoscrizione a più origini del comando.
ja: ``typeId``、``deviceId``、``commandId``、``formatString`` に MQTT の ``+`` ワイルドカードを使用すると、複数のコマンド・ソースをサブスクライブできます。
zh_cn: MQTT“+”通配符可用于“typeId”、“deviceId”、“commandId”和“formatString”，以预订多个命令源。

source: Gateway 1 can subscribe to commands directed at the gateway: ``iot-2/type/mygateway/id/gateway1/cmd/+/fmt/+``
it: Il gateway 1 può effettuare la sottoscrizione ai comandi diretti al gateway: ``iot-2/type/mygateway/id/gateway1/cmd/+/fmt/+``
ja: ゲートウェイ 1 が、ゲートウェイ自体に対するコマンドをサブスクライブする場合は、``iot-2/type/mygateway/id/gateway1/cmd/+/fmt/+`` になります。
zh_cn: 网关 1 可以预订针对网关的命令：“iot-2/type/mygateway/id/gateway1/cmd/+/fmt/+”

source: Gateway 1 can subscribe to commands sent to Device 1: ``iot-2/type/mydevice/id/device1/cmd/+/fmt/+``
it: Il gateway 1 può effettuare la sottoscrizione ai comandi inviati al dispositivo 1: ``iot-2/type/mydevice/id/device1/cmd/+/fmt/+``
ja: ゲートウェイ 1 が、デバイス 1 に送信されたコマンドをサブスクライブする場合は、``iot-2/type/mydevice/id/device1/cmd/+/fmt/+`` になります。
zh_cn: 网关 1 可以预订发送到设备 1 的命令：“iot-2/type/mydevice/id/device1/cmd/+/fmt/+”

source: Gateway 1 can subscribe any command sent to devices of type "mydevice": ``iot-2/type/mydevice/id/+/cmd/+/fmt/+``
it: Il gateway 1 può effettuare la sottoscrizione al comando inviato ai dispositivi di tipo "mydevice": ``iot-2/type/mydevice/id/+/cmd/+/fmt/+``
ja: ゲートウェイ 1 がタイプ "mydevice" のすべてのデバイスに対して送信されたすべてのコマンドをサブスクライブする場合は、``iot-2/type/mydevice/id/+/cmd/+/fmt/+`` になります。
zh_cn: 网关 1 可以预订发送到类型为“mydevice”的设备的任何命令：“iot-2/type/mydevice/id/+/cmd/+/fmt/+”

source: MQTT persistent sessions (cleansession=false) do not roam for devices which connect to gateways. What this means is that if a device connects to gateway A, then later connects to gateway B, it will not receive any messages that had been published to gateway A for that device while it was disconnected. A gateway owns the MQTT client and subscription, not the devices which are connected to the gateway.
it: Le sessioni persistenti MQTT (cleansession=false) non cercano i dispositivi connessi ai gateway. Ciò significa che se un dispositivo si connette al gateway A, e successivamente si collega al gateway B, non riceverà i messaggi ad esso indirizzati e pubblicati sul gateway A mentre era disconnesso. Un gateway è proprietario del client MQTT e della sottoscrizione, non dei dispositivi ad esso connessi.
ja: MQTT 持続セッション (cleansession=false) では、ゲートウェイに接続するデバイスに対するローミングは行われません。つまり、デバイスがゲートウェイ A に接続し、その後にゲートウェイ B に接続した場合、デバイスが切断されている間にデバイス宛てにゲートウェイ A に対してパブリッシュされたメッセージを、ゲートウェイは受け取りません。ゲートウェイが所有するのは、ゲートウェイに接続されたデバイスではなく、MQTT クライアントとサブスクリプションです。
zh_cn: 对于连接到网关的设备，MQTT 持久会话 (cleansession=false) 不会漫游。这意味着，如果某设备连接到网关 A，并在稍后连接到网关 B，那么它在断开连接期间不会收到已发布到网关 A 的任何消息。网关拥有 MQTT 客户机和预订，但没有与网关连接的设备。

source: Gateway auto-registration
it: Registrazione automatica del gateway
ja: ゲートウェイ自動登録
zh_cn: 网关自动注册

source: Gateway devices have the ability to automatically register devices which are connected to them. When a gateway publishes a message or subscribes to a topic on behalf of another device, that device will automatically be registered if it does not already exist.
it: I dispositivi gateway possono registrare automaticamente i dispositivi ad essi connessi. Quando un gateway pubblica un messaggio o effettua la sottoscrizione ad un argomento per conto di un altro dispositivo, tale dispositivo verrà registrato automaticamente se non esiste già.
ja: ゲートウェイ・デバイスは、自身に接続されているデバイスを自動的に登録することができます。ゲートウェイが別のデバイスの代わりにメッセージをパブリッシュするかトピックをサブスクライブすると、そのデバイスは、まだ存在しなければ自動的に登録されます。
zh_cn: 网关设备能够自动注册连接到自己的设备。当网关代表另一设备发布消息或预订主题时，如果该设备尚不存在，将自动注册该设备。

source: Registration requests from gateway devices are throttled to 128 pending requests at a time. If trying to connect many new devices to a gateway which have not previously been registered, then there may be some delay in the registration of the devices through the gateway.
it: Le richieste di registrazione dai dispositivi gateway vengono limitate a 128 richieste in sospeso alla volta. Se si prova a connettere ad un client molti nuovi dispositivi che non sono stati precedentemente registrati, può verificarsi un ritardo nella registrazione dei dispositivi attraverso il gateway.
ja: ゲートウェイ・デバイスからの登録リクエストは、保留中のリクエストが一度に 128 個を超えないように絞られます。まだ登録されていない新しいデバイスを多数ゲートウェイに接続しようとすると、ゲートウェイを介したデバイスの登録がある程度遅れる場合があります。
zh_cn: 来自网关设备的注册请求将调速为一次 128 个暂挂请求。如果尝试将许多先前尚未注册的新设备连接到某个网关，那么通过该网关注册这些设备可能会出现一些延迟。

source: If the gateway fails to automatically register a device, then it will not attempt to register that device again for a short period of time. Any messages or subscriptions from the failed device will be dropped during that time.
it: Se il gateway non riesce a registrare automaticamente un dispositivo, non prova ad eseguirne nuovamente la registrazione per un breve periodo di tempo. Durante tale periodo di tempo, i messaggi o le sottoscrizioni dal dispositivo con errore verranno rilasciati.
ja: ゲートウェイがデバイスの自動登録に失敗した場合、ゲートウェイは少しの間そのデバイスの登録を再試行しません。その間、失敗したデバイスからのメッセージやサブスクリプションはすべてドロップされます。
zh_cn: 如果网关未能自动注册某个设备，那么短期内将不会尝试再次注册该设备。来自失败设备的任何消息或预订在此期间内都将被删除。

source: Gateway notifications
it: Notifiche gateway
ja: ゲートウェイ通知
zh_cn: 网关通知

source: When errors occur during the validation of the publish or subscribe topic, or during automatic registration, a notification will be sent to the gateway device. A gateway can receive these notifications by subscribing to the following topic, substituting in its own ``typeId`` and ``deviceId``:
it: Quando si verificano degli errori durante la convalida dell'argomento di sottoscrizione o pubblicazione o durante la registrazione automatica, viene inviata una notifica al dispositivo gateway. Un gateway può ricevere tali notifiche effettuando la sottoscrizione al seguente argomento, sostituendo i propri ``typeId`` e ``deviceId``:
ja: パブリッシュ・トピックまたはサブスクライブ・トピックの検証中、あるいは自動登録中にエラーが発生した場合は、ゲートウェイ・デバイスに通知が送信されます。ゲートウェイは、次のトピックをサブスクライブし、自身の ``typeId`` および ``deviceId`` を置き換えることで、これらの通知を受信できます。
zh_cn: 验证发布或预订主题期间或者自动注册期间发生错误时，会向网关设备发送通知。网关通过预订以下主题并替换自己的“typeId”和“deviceId”来接收这些通知：

source: Messages received on the notify topic will have the following format:
it: I messaggi ricevuti nell'argomento di notifica avranno il seguente formato:
ja: 通知トピックで受け取るメッセージは、次の形式になります。
zh_cn: 通知主题上收到的消息将具有以下格式：

source: Request_Type: Either publish or subscribe
it: Request_Type: pubblicazione o sottoscrizione
ja: Request_Type: publish または subscribe
zh_cn: Request_Type：发布或预订

source: Timestamp: Time in ISO 8601 Format
it: Timestamp: Ora nel formato ISO 8601
ja: Timestamp: ISO 8601 形式の時刻
zh_cn: Timestamp：采用 ISO 8601 格式的时间

source: Topic: The request topic from the gateway
it: Topic: L'argomento di richiesta dal gateway
ja: Topic: ゲートウェイからのリクエスト・トピック
zh_cn: Topic：来自网关的请求主题

source: Device_Type: The device type from the topic
it: Device_Type: Il tipo di dispositivo dall'argomento
ja: Device_Type: トピックからのデバイス・タイプ
zh_cn: Device_Type：来自主题的设备类型

source: Device_Id: The device id from the topic
it: Device_Id: L'ID dispositivo dall'argomento
ja: Device_Id: トピックからのデバイス ID
zh_cn: Device_Id：来自主题的设备标识

source: ClientID: The client id of the request
it: ClientID: L'ID client della richiesta
ja: ClientID: リクエストのクライアント ID
zh_cn: ClientID：请求的客户机标识

source: RC: The return code
it: RC: Il codice di ritorno
ja: RC: 戻りコード
zh_cn: RC：返回码

source: Message: The error message
it: Message: Il messaggio di errore
ja: Message: エラー・メッセージ
zh_cn: Message：错误消息

source: Notifications a gateway may receive:
it: Notifiche che possono essere ricevute da un gateway:
ja: ゲートウェイが受け取る可能性がある通知:
zh_cn: 网关可能收到的通知：

source: Topic does not match with any allowed topic rules.
it: L'argomento non corrisponde ad alcuna regola di argomento consentita.
ja: トピックは許可されたどのトピック・ルールとも一致しません。
zh_cn: 主题与任何允许的主题规则均不匹配。

source: Device type is not valid.
it: Il tipo di dispositivo non è valido.
ja: デバイス・タイプが無効です。
zh_cn: 设备类型无效。

source: Device id is not valid.
it: L'ID dispositivo non è valido.
ja: デバイス ID が無効です。
zh_cn: 设备标识无效。

source: Maximum number of devices per gateway has been reached.
it: È stato raggiunto il numero massimo di dispositivi per gateway.
ja: ゲートウェイ当たりの最大デバイス数に達しました。
zh_cn: 已达到每个网关的最大设备数。

source: Maximum number of devices per organization has been reached.
it: È stato raggiunto il numero massimo di dispositivi per organizzazione.
ja: 組織当たりの最大デバイス数に達しました。
zh_cn: 已达到每个组织的最大设备数。

source: Failed to create device due to internal errors.
it: Impossibile creare il dispositivo a causa di errori interni.
ja: 内部エラーのためにデバイスを作成できませんでした。
zh_cn: 由于内部错误，无法创建设备。

source: Managed Gateways
it: Gateway gestiti
ja: 管理対象ゲートウェイ
zh_cn: 受管网关

source: Support for device lifecycle management is optional, the device management protocol used by IoT Platform utilises the same MQTT connection that your gateway already uses for events and command control.
it: Il supporto per la gestione del ciclo di vita del dispositivo è facoltativo, il protocollo di gestione dispositivo utilizzato da IoT Platform utilizza la stessa connessione MQTT che il gateway già utilizza per il controllo degli eventi e dei comandi.
ja: デバイス・ライフサイクル管理のサポートはオプションです。IoT Platform で使用するデバイス管理プロトコルは、ゲートウェイがイベントやコマンドの制御のために既に使用しているのと同じ MQTT 接続を使用します。
zh_cn: 对设备生命周期管理的支持是可选的，IoT Platform 所使用的设备管理协议利用您的网关已使用的同一 MQTT 连接进行事件和命令控制。

source: Quality of Service Levels and Clean Session
it: Livelli QoS (Quality of Service) e Sessione pulita
ja: サービス品質レベルとクリーン・セッション
zh_cn: 服务质量级别和清除会话

source: Managed gateways can publish messages with Quality of Service (QoS) level of 0 or 1. If QoS 1 is used, messages from the gateway will be queued if necessary. Messages from the gateway must not be retained messages.
it: I gateway gestiti possono pubblicare i messaggi con il livello Qos ( Quality of Service) pari a 0 o 1. Se viene utilizzato il livello QoS 1, i messaggi provenienti dal gateway verranno accodati, se necessario. I messaggi provenienti dal gateway non devono essere messaggi conservati.
ja: 管理対象ゲートウェイは、サービス品質 (QoS) レベルが 0 または 1 のメッセージをパブリッシュできます。QoS 1 を使用すると、そのゲートウェイからのメッセージが必要に応じてキューに入れられます。そのゲートウェイからのメッセージは、保存メッセージにしないでください。
zh_cn: 受管网关可以发布服务质量 (QoS) 级别为 0 或 1 的消息。如果使用 QoS 1，那么在必要时将对来自网关的消息进行排队。来自网关的消息不得是保留消息。

source: The IoT Platform publishes requests with a QoS level of 1 to support queuing of messages. In order to queue messages sent while a managed gateway is not connected, the device should use ``cleansession=false``.
it: IoT Platform pubblica le richieste con un livello QoS pari ad 1 per supportare l'accodamento dei messaggi. Per accodare i messaggi inviati mentre un gateway gestito non è connesso, il dispositivo dovrebbe utilizzare ``cleansession=false``.
ja: IoT Platform は、メッセージのキューイングをサポートするために QoS レベル 1 でリクエストをパブリッシュします。管理対象ゲートウェイが接続されていないときに送信されたメッセージをキューに入れる場合は、そのデバイスで ``cleansession=false`` を使用する必要があります。
zh_cn: IoT Platform 可发布 QoS 级别为 1 的请求以支持消息排队。为对受管网关未连接时发送的消息进行排队，设备应使用“cleansession=false”。
