Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/register/index.po
Languages: de, pt_br, zh_cn, zh_tw

source: Register
de: Registrieren
pt_br: Registrar
zh_cn: 注册
zh_tw: 登錄

source: Registering for an account on the Watson IoT platform and connecting your first device is simple and will take less than 10 minutes to complete.
de: Das Registrieren eines Accounts für Watson IoT Platform und das Verbinden des ersten Geräts beansprucht weniger als 10 Minuten.
pt_br: O registro de uma conta na plataforma Watson IoT e a conexão de seu primeiro dispositivo são simples e levarão menos de 10 minutos para serem concluídos.
zh_cn: 在 Watson IoT Platform 上注册帐户并连接到第一个设备非常简单，只需不到 10 分钟即可完成。
zh_tw: 在 Watson IoT Platform 上登錄帳戶，並連接您的第一個裝置很簡單，只需不到 10 分鐘的時間即可完成。

source: Create a Bluemix Account
de: Bluemix-Account erstellen
pt_br: Criar uma Conta do Bluemix
zh_cn: 创建 Bluemix 帐户
zh_tw: 建立 Bluemix 帳戶

source: First you will need to `register for a Bluemix account <https://console.ng.bluemix.net/registration/>`_. Once you have verified your e-mail address you should find yourself looking at an empty dashboard:
de: Zunächst müssen Sie einen eigenen Bluemix-Account registrieren (siehe `Register for a Bluemix account <https://console.ng.bluemix.net/registration/>`_). Sobald Ihre E-Mail-Adresse bestätigt ist, müsste ein leeres Dashboard angezeigt werden:
pt_br: Primeiro, você precisará `registrar-se para uma conta do Bluemix <https://console.ng.bluemix.net/registration/>`_. Depois de ter verificado seu endereço de e-mail, você deve se encontrar em um painel vazio:
zh_cn: 首先，您将需要 `注册 Bluemix 帐户 <https://console.ng.bluemix.net/registration/>`_。验证电子邮件地址后，首先会看到一个空白仪表板：
zh_tw: 首先，您將需要 `登錄 Bluemix 帳戶 <https://console.ng.bluemix.net/registration/>`_。已驗證您的電子郵件位址之後，您應該發現自己看著空的儀表板：

source: Choose your Region
de: Region auswählen
pt_br: Escolha sua Região
zh_cn: 选择区域
zh_tw: 選擇您的地區

source: Now, before you go any further you need to consider data soveriegnty and make a decision as to which of the available regions you want to register your service instance with. Currently the Watson IoT platform is available in two regions:
de: Vor den nächsten Schritten müssen Sie die Datenhoheit berücksichtigen und entscheiden, in welcher der verfügbaren Regionen Ihre Serviceinstanz registriert werden soll. Watson IoT Platform ist derzeit in den beiden folgenden Regionen verfügbar:
pt_br: Agora, antes de continuar, é preciso considerar a soberania dos dados e tomar uma decisão com relação a em qual das regiões disponíveis você deseja registrar sua instância de serviço. Atualmente, a plataforma Watson IoT está disponível em duas regiões:
zh_cn: 现在，在执行任何其他操作之前，需要考虑数据主权并决定要向哪些可用区域注册服务实例。目前，Watson IoT Platform 在两个区域中可用：
zh_tw: 現在，在可以進一步執行之前，您需要考量資料自主性並做出決策，決定要在哪個可用地區登錄您的服務實例。目前 Watson IoT Platform 可在下列兩個地區中使用：

source: United Kingom
de: Vereinigtes Königreich
pt_br: Reino Unido
zh_cn: 英国
zh_tw: 英國

source: United States
de: Vereinigte Staaten
pt_br: Estados Unidos
zh_cn: 美国
zh_tw: 美國

source: Data sovereignty is the concept that information which has been converted and stored in binary digital form is subject to the laws of the country in which it is located.
de: Die Datenhoheit legt fest, dass Informationen, die umgewandelt und in digitaler Form gespeichert wurden, den Gesetzen des Landes unterliegen, in dessen Hoheitsgebiet sie sich befinden.
pt_br: A soberania de dados é o conceito de que as informações que foram convertidas e armazenadas no formato digital binário estão sujeitas às leis do país no qual elas estão localizadas.
zh_cn: 数据主权是指已转换并以二进制数据格式存储的信息遵守其所在国家或地区的法律的概念。
zh_tw: 資料自主性是一種概念，表示已轉換並以二進位數位格式儲存的資訊受制於其所在國家的法律。

source: The region your Watson IoT platform instance will be provisioned in will be determined by the Bluemix region you are using. You can switch Bluemix regions via the controls in the top right corner of the Bluemix dashboard. You can also determine which region are currently have selected by the URL in your browser:
de: In welcher Region Ihre Instanz von Watson IoT Platform bereitgestellt wird, richtet sich nach der von Ihnen verwendeten Bluemix-Region. Zum Ändern der Bluemix-Region können Sie die Steuerelemente in der rechten oberen Ecke des Bluemix-Dashboards verwenden. Die URL in Ihrem Browser gibt ebenfalls Auskunft darüber, welche Region momentan ausgewählt ist:
pt_br: A região na qual sua instância da plataforma Watson IoT será provisionada será determinada pela região do Bluemix que você está usando. É possível alternar regiões do Bluemix por meio dos controles no canto superior direito do painel do Bluemix. Também é possível determinar qual região está selecionada atualmente pela URL em seu navegador:
zh_cn: 将供应 Watson IoT Platform 实例的区域取决于您使用的 Bluemix 区域。您可以通过 Bluemix 仪表板右上角的控件切换 Bluemix 区域。您也可以通过浏览器中的 URL 确定当前已选定的区域：
zh_tw: 將佈建 Watson IoT Platform 實例的地區，取決於您正在使用的 Bluemix 地區。您可以透過 Bluemix 儀表板右上角的控制項來切換 Bluemix 地區。您也可以透過瀏覽器中的 URL 來判斷目前已選取哪個地區：

source: United Kingdom: console.\ **eu-gb**\ .bluemix.net
de: Vereinigtes Königreich: console.\ **eu-gb**\ .bluemix.net
pt_br: Reino Unido: console.\ **eu-gb**\ .bluemix.net
zh_cn: 英国：console.\ **eu-gb**\ .bluemix.net
zh_tw: 英國：console.\ **eu-gb**\ .bluemix.net

source: United States: console.\ **ng**\ .bluemix.net
de: Vereinigte Staaten: console.\ **ng**\ .bluemix.net
pt_br: Estados Unidos: console.\ **ng**\ .bluemix.net
zh_cn: 美国：console.\ **ng**\ .bluemix.net
zh_tw: 美國：console.\ **ng**\ .bluemix.net

source: Provision a Watson IoT platform Service Instance
de: Watson IoT Platform-Serviceinstanz bereitstellen
pt_br: Provisione uma Instância de Serviço da plataforma Watson IoT
zh_cn: 供应 Watson IoT Platform 服务实例
zh_tw: 佈建 Watson IoT Platform 服務實例

source: From anywhere in the Bluemix dashboard click **catalog** in the top navigation, this will take you to a list of all services available on Bluemix.
de: Klicken Sie ausgehend von einer beliebigen Stelle im Bluemix-Dashboard auf '**catalog**' im oberen Navigationsbereich. Daraufhin wird eine Liste aller in Bluemix verfügbaren Services angezeigt.
pt_br: Em qualquer lugar no painel do Bluemix, clique em **catálogo** na navegação superior, isso o levará a uma lista de todos os serviços disponíveis no Bluemix.
zh_cn: 从 Bluemix 仪表板中的任意位置单击顶部导航中的 **目录**，这会将您引至 Bluemix 上可用的所有服务的列表。
zh_tw: 從 Bluemix 儀表板中的任何地方按一下頂端導覽中的 **型錄**，這將帶您至 Bluemix 上所有可用服務的清單。

source: Type ``Internet of Things`` into the search box at the top of the page to filter out all the other services.
de: Geben Sie ``Internet of Things`` in das Suchfeld oben auf der Seite ein, um alle anderen Services herauszufiltern.
pt_br: Digite ``Internet of Things`` na caixa de procura na parte superior da página para filtrar todos os outros serviços.
zh_cn: 在页面顶部的搜索框中输入“Internet of Things”以过滤除所有其他服务。
zh_tw: 將 ``Internet of Things`` 鍵入至頁面頂端的搜尋框，以過濾出所有其他服務。

source: Click ``View More`` on the **Watson IoT platform** service tile.
de: Klicken Sie auf ``Mehr anzeigen`` auf der Kachel für den Service **Watson IoT Platform**.
pt_br: Clique em ``Visualizar Mais`` no quadro de serviço **plataforma Watson IoT**.
zh_cn: 单击 **Watson IoT Platform ** 服务磁贴上的“查看更多”。
zh_tw: 按一下 **Watson IoT Platform** 服務磚上的「檢視更多」。

source: Optionally give your service instance a name (or simply accept the generated name)
de: Ordnen Sie Ihrer Serviceinstanz einen Namen zu (optional) oder übernehmen Sie einfach den generierten Namen.
pt_br: Opcionalmente, forneça um nome à sua instância de serviço (ou simplesmente aceite o nome gerado)
zh_cn: （可选）提供服务实例的名称（或直接接受生成的名称）
zh_tw: 選擇性地給與您的服務實例一個名稱（或只接受產生的名稱）

source: Click ``Create``
de: Klicken Sie auf ``Erstellen``.
pt_br: Clique em ``Criar``
zh_cn: 单击“创建”
zh_tw: 按一下「建立」

source: After a short delay you will find yourself the proud owner of an organization on the IBM Watson IoT platform.
de: Nach einer kurzen Wartezeit sind Sie stolzer Besitzer einer Organisation in IBM Watson IoT Platform.
pt_br: Após um curto atraso, você será o feliz proprietário de uma organização na plataforma IBM Watson IoT.
zh_cn: 片刻之后，您将在 IBM Watson IoT Platform 上发现自己成为自豪的组织所有者。
zh_tw: 在短暫延遲之後，您會發現自己是 IBM Watson IoT Platform 上自豪的組織擁有者。

source: Additional Setup and Experimentation
de: Weitere Einrichtung und versuchsweise Konfiguration
pt_br: Configuração e Experimentação Adicionais
zh_cn: 其他设置和实验
zh_tw: 其他設定和實驗

source: Click the ``Launch Dashboard`` button when viewing your new service instance within Bluemix, this will take you to your Watson IoT platform Dashboard.
de: Klicken Sie auf die Schaltfläche ``Dashboard starten``, während Ihre neue Serviceinstanz in Bluemix angezeigt wird, um Ihr Watson IoT Platform-Dashboard zu öffnen.
pt_br: Clique no botão ``Ativar Painel`` ao visualizar sua nova instância de serviço no Bluemix, isso levará você ao Painel da plataforma Watson IoT.
zh_cn: 在 Bluemix 内查看新服务实例时单击“启动仪表板”按钮，这会将您引至 Watson IoT Platform 仪表板。
zh_tw: 在 Bluemix 內檢視新的服務實例時按一下「啟動儀表板」按鈕，此動作會將您帶至「Watson IoT Platform 儀表板」。

source: Configure Access
de: Zugriff konfigurieren
pt_br: Configurar Acesso
zh_cn: 配置访问
zh_tw: 配置存取

source: You are currently accessing the dashboard through a 24 hour access token generated by Bluemix when you clicked ``Launch Dashboard``, when this expires you will need to return to Bluemix and relaunch the dashboard. I think we can all agree it's preferable not to have to do this, so let's promote you to a permanent member of the organization.
de: Momentan greifen Sie über ein Zugriffstoken mit einem Gültigkeitszeitraum von 24 Stunden auf das Dashboard zu, das von Bluemix generiert wurde, als Sie auf ``Dashboard starten`` geklickt haben. Nach Ablauf dieses Zugriffstokens müssen Sie das Dashboard in Bluemix erneut starten. Dieses Verfahren ist etwas umständlich und nicht sehr benutzerfreundlich. Daher sollten Sie zu einem permanenten Mitglied der Organisation hochgestuft werden.
pt_br: Você está acessando o painel atualmente por meio de um token de acesso 24 horas gerado pelo Bluemix quando clicou em ``Ativar Painel``, quando isto expirar, você precisará retornar ao Bluemix e reativar o painel. Acho que todos podemos concordar que é preferível não precisar fazer isso, então vamos promover você a um membro permanente da organização.
zh_cn: 您当前是通过在单击“启动仪表板”时 Bluemix 生成的 24 小时访问令牌来访问仪表板，当此访问令牌到期时，您将需要返回到 Bluemix 并重新启动仪表板。我认为，一般都会觉得执行此操作太麻烦，因此让我们将您升级为组织的永久成员。
zh_tw: 您目前透過按一下「啟動儀表板」時由 Bluemix 產生的 24 小時存取記號來存取儀表板，一旦到期，您將需要回到 Bluemix，並重新啟動儀表板。我認為我們都同意最好不必這樣做，就讓我們將您提升為組織的永久成員。

source: In the navigation menu select ``Access`` and then ``Guests``, you should see the e-mail address you signed up to Bluemix with in there and the expiration date for your session. Click the ``Promote`` button to set yourself up as a permanent member of the organization, your ID will disappear from the list, and can now be found under ``Access > Members``.
de: Wählen Sie im Navigationsmenü nacheinander die Optionen ``Zugriff`` und ``Gäste`` aus. Nun müssten die E-Mail-Adresse, mit der Sie sich bei Bluemix angemeldet haben, und das Ablaufdatum für Ihre Sitzung angezeigt werden. Klicken Sie auf die Schaltfläche ``Hochstufen``, um Ihre Benutzer-ID als permanentes Mitglied der Organisation zu deklarieren. Ihre Benutzer-ID wird aus der Liste entfernt und unter ``Zugriff > Mitglieder`` eingefügt.
pt_br: No menu de navegação, selecione ``Acessar`` e, em seguida, ``Guests``, você deverá ver o endereço de e-mail com o qual se inscreveu no Bluemix e a data de expiração para sua sessão. Clique no botão ``Promover`` para configurar a si mesmo como um membro permanente da organização, seu ID desaparecerá da lista e agora poderá ser encontrado em ``Acessar > Membros``.
zh_cn: 在导航菜单中，选择“访问”，然后选择“访客”，此时其中应显示您用于注册 Bluemix 的电子邮件地址和会话的到期日期。单击“升级”按钮以将您自身设置为组织的永久成员，您的标识将从列表中消失，并且现在可在“访问 > 成员”下找到。
zh_tw: 在導覽功能表中，選取「存取」，然後選取「來賓」，您應該在其中看到您註冊 Bluemix 時所使用的電子郵件位址，以及階段作業的到期日。按一下「提升」按鈕，將自己設為組織的永久成員，這時您的 ID 將從清單中消失，現在您可以在「存取 > 成員」下找到它。

source: Connect an Application
de: Anwendung verbinden
pt_br: Conecte um Aplicativo
zh_cn: 连接应用程序
zh_tw: 連接應用程式

source: Applications require an ``API key`` to connect to the service. Let's set one up. Navigate to ``Access > API Keys`` and click ``Generate API Key``. Take a note of your ``API Key`` and ``Authentication Token`` - you will need them shortly.
de: Anwendungen benötigen einen ``API-Schlüssel``, um die Verbindung zu dem Service herzustellen. Richten wir also einen API-Schlüssel ein. Navigieren Sie zu ``Zugriff > API-Schlüssel`` und klicken Sie auf ``API-Schlüssel generieren``. Notieren Sie Ihren ``API-Schlüssel`` und das ``Authentifizierungstoken``. Sie werden diese Angaben in Kürze benötigen.
pt_br: Os aplicativos requerem uma ``chave de API`` para se conectarem ao serviço. Vamos configurar uma. Navegue para ``Acessar > Chaves de API`` e clique em ``Gerar Chave de API``. Anote sua ``Chave de API`` e seu ``Token de Autenticação`` - você precisará deles em breve.
zh_cn: 应用程序需要“API 密钥”来连接到服务。让我们设置一个。浏览至“访问 > API 密钥”，然后单击“生成 API 密钥”。记录您的“API 密钥”和“认证令牌”，很快我们将需要使用它们。
zh_tw: 應用程式需要「API 金鑰」，才能連接至服務。讓我們設定一個。請導覽至「存取 > API 金鑰」，然後按一下「產生 API 金鑰」。記下您的「API 金鑰」和「鑑別記號」- 您很快就會需要它們。

source: Now we have an API key we want to run an application, the simpler the better.
de: Sie verfügen nun über einen API-Schlüssel zum Ausführen einer Anwendung (je einfacher, umso besser).
pt_br: Agora temos uma chave de API que desejamos para executar um aplicativo, quanto mais simples, melhor.
zh_cn: 现在，我们具有运行应用程序所需的 API 密钥，越简单越好。
zh_tw: 現在我們有了 API 金鑰，我們想要執行應用程式，越簡單越好。

source: The Watson IoT platform has client library support for multiple languages, but for the purpose of this getting started tutorial we're going to stick with Python. If you don't already have `Python <https://www.python.org/downloads/>`_ installed now is the time to do so.
de: Watson IoT Platform bietet Unterstützung für Clientbibliotheken in mehreren Sprachen. In den Lerntexten dieser Einführung bleiben wir der Einfachheit halber bei Python. Wenn `Python <https://www.python.org/downloads/>`_ in Ihrem System noch nicht installiert ist, sollten Sie dies jetzt nachholen.
pt_br: A plataforma Watson IoT possui suporte de biblioteca do cliente para vários várias linguagens, maspara o propósito deste tutorial de introdução, iremos nos ater ao Python. Se você ainda não tiver `Python <https://www.python.org/downloads/>`_ instalado, agora é o momento de fazer isso.
zh_cn: Watson IoT Platform 具有多种语言的客户机库支持，但出于此入门教程的目的，我们将坚持使用 Python。如果您尚未安装 `Python <https://www.python.org/downloads/>`_，现在便需要执行此安装。
zh_tw: Watson IoT Platform 具有多種語言的用戶端程式庫支援，但是基於此入門指導教學的目的，我們將沿用 Python。如果您還未安裝 `Python <https://www.python.org/downloads/>`_，請立即安裝。

source: Install the latest version of the Watson IoT platform python client library using pip
de: Installieren Sie die neueste Version der Python-Clientbibliothek für Watson IoT Platform unter Verwendung von Pip.
pt_br: Instale a versão mais recente da biblioteca do cliente Python da plataforma Watson IoT usando pip
zh_cn: 使用 pip 安装最新版本的 Watson IoT Platform Python 客户机库
zh_tw: 使用 pip 安裝最新版的 Watson IoT Platform Python 用戶端程式庫

source: Now, create a really simple application that will connect using the API key you just created:
de: Erstellen Sie nun eine einfache Anwendung, die mit dem von Ihnen erstellen API-Schlüssel eine Verbindung herstellt:
pt_br: Agora, crie um aplicativo realmente simples que se conectará usando a chave de API que você acabou de criar:
zh_cn: 现在，创建将使用您刚创建的 API 密钥进行连接的超简单应用程序：
zh_tw: 現在，使用您剛建立的 API 金鑰，建立一個將連接的真正簡單應用程式：

source: When you launch the application you will see nothing overly exciting
de: Wenn Sie die Anwendung starten, wird nichts Außergewöhnliches angezeigt.
pt_br: Ao ativar o aplicativo, você não verá nada muito emocionante
zh_cn: 启动应用程序时，将不会显示任何特别内容
zh_tw: 當啟動應用程式時，您將看不到任何極度使人興奮的事物

source: Connect a Device
de: Gerät verbinden
pt_br: Conectar um Dispositivo
zh_cn: 连接设备
zh_tw: 連接裝置

source: Before we can register a device we have to define a device type. A ``device type`` is intended to represent a group of devices that are identical, it can be useful to think of the ``device type`` as analogous to a model in the traditional model:serial identification scheme. Leave you application running to return to your Watson IoT platform Dashboard and navigate to ``Devices > Device Types``, click ``Create Type`` and enter ``python-sample`` as the name, all other fields are optional, so we're just going to skip past the rest of the options for the device type for now.
de: Vor dem Registrieren eines Geräts muss zunächst ein Gerätetyp definiert werden. Der ``Gerätetyp`` repräsentiert eine Gruppe identischer Geräte. Dabei entspricht der ``Gerätetyp`` ungefähr dem Modell im herkömmlichen Identifikationsschema 'Modell/Serie'. Ihre Anwendung wird weiterhin ausgeführt. Wechseln Sie nun in Ihr Watson IoT Platform-Dashboard und navigieren Sie zu ``Geräte > Gerätetypen``. Klicken Sie auf ``Typ erstellen`` und geben Sie als Name ``Python-Beispiel`` ein. Alle übrigen Optionen für den Gerätetyp sind optional und werden in diesem Beispiel zunächst ignoriert.
pt_br: Antes de poder registrar um dispositivo, precisamos definir um tipo de dispositivo. Um ``tipo de dispositivo`` destina-se a representar um grupo de dispositivos que são idênticos, pode ser útil pensar no ``tipo de dispositivo`` da mesma forma que um esquema de identificação tradicional de modelo:série. Deixe seu aplicativo em execução para retornar ao Painel da plataforma Watson IoT e navegue para ``Dispositivos > Tipos de Dispositivo``, clique em ``Criar Tipo`` e insira ``python-sample`` como o nome, todos os outros campos são opcionais, então vamos ignorar o restante das opções para o tipo de dispositivo por ora.
zh_cn: 我们必须先定义设备类型，然后才能注册设备。“设备类型”旨在表示一组相同的设备，在传统的“模型:序列标识”方案中，将“设备类型”视为类似于模型可能非常有用。保持运行应用程序以返回到 Watson IoT Platform 仪表板并浏览至“设备 > 设备类型”，单击“创建类型”并输入“python-sample”作为名称，所有其他字段都是可选的，因此我们将会暂时跳过设备类型的其余选项。
zh_tw: 在登錄裝置之前，我們必須定義裝置類型。「裝置類型」預期代表一組相同的裝置，將「裝置類型」想成類似於傳統型號：序號識別方法中的型號可能會有幫助。讓您的應用程式保持執行狀態，回到「Watson IoT Platform」儀表板，並導覽至「裝置 > 裝置類型」、按一下「裝置類型」，然後輸入 ``python-sample`` 作為名稱。所有其他欄位都是選用項目，因此我們目前將跳過裝置類型的其餘選項。

source: Now it's time to register a device of this type, navigate to ``Devices > Browse`` and click ``Add Device``, select the ``python-sample`` device type that we just created and click ``Next``. On the second panel enter a device ID of "MyFirstDevice" and click ``Next`` to continue through the guided creation process until you reach the ``Add`` button.
de: Als nächstes soll ein Gerät dieses Typs registriert werden. Navigieren Sie zu ``Geräte > Durchsuchen``, klicken Sie auf ``Gerät hinzufügen``, wählen Sie den Gerätetyp ``Python-Beispiel`` aus, den Sie eben erstellt haben, und klicken Sie auf ``Weiter``. Geben Sie im zweiten Fenster die Geräte-ID "MeinErstesGerät" ein, klicken Sie auf ``Weiter`` und führen Sie die nachfolgenden Schritte des Erstellungsprozesses aus, bis die Schaltfläche ``Hinzufügen`` angezeigt wird.
pt_br: Agora é hora de registrar um dispositivo deste tipo, navegue para ``Dispositivos > Procurar`` e clique em ``Incluir Dispositivo``, selecione o tipo de dispositivo ``python-sample`` que acabamos de criar e clique em ``Avançar``. No segundo painel, insira um ID de dispositivo " MyFirstDevice" e clique em ``Avançar`` para continuar pelo processo de criação guiado até acessar o botão ``Incluir``.
zh_cn: 现在，即可开始注册此类型的设备，浏览至“设备 > 浏览”，然后单击“添加设备”，选择刚创建的“python-sample”设备类型，然后单击“下一步”。在第二个面板上，输入设备标识“MyFirstDevice”，然后单击“下一步”以继续完成引导的创建过程，直至到达“添加”按钮。
zh_tw: 現在正是登錄此類型裝置的時候，請導覽至「裝置 > 瀏覽」並按一下「新增裝置」、選取我們剛建立的 ``python-sample`` 裝置類型，然後按「下一步」。在第二個畫面上，輸入 "MyFirstDevice" 的裝置 ID，然後按「下一步」，以繼續進行引導式的建立程序，直到您到達「新增」按鈕。

source: Once you click ``Add`` your device is registered and you will be presented with a generated ``authentication token`` for that device.
de: Nach dem Klicken auf ``Hinzufügen`` wird Ihr Gerät registriert und ein generiertes ``Authentifizierungstoken`` für das Gerät wird angezeigt.
pt_br: Ao clicar em ``Incluir``, seu dispositivo é registrado e você será apresentado a um ``token de autenticação`` gerado para esse dispositivo.
zh_cn: 一旦单击“完成”，便会注册您的设备并为您提供所生成的该设备的“认证令牌”。
zh_tw: 按一下「新增」之後，即會登錄您的裝置，並且將針對該裝置產生的「鑑別記號」呈現給您。

source: We're now going to take that authentication token and write a totally minimal device client in python.
de: Unter Verwendung dieses Authentifizierungstokens schreiben wir jetzt die Minimalversion eines Geräteclients in Python.
pt_br: Agora utilizaremos esse token de autenticação e gravaremos um cliente do dispositivo totalmente mínimo em python.
zh_cn: 现在，我们将采用该认证令牌并使用 Python 编写整体最小的设备客户机。
zh_tw: 現在我們將採用鑑別記號，並以 Python 撰寫完全最小的裝置用戶端。

source: When executed the device code will generate 10 events .. code::
de: Bei der Ausführung des Gerätecodes werden 10 Ereignisse (.. code::) generiert.
pt_br: Quando executado, o código do dispositivo gerará 10 eventos. código::
zh_cn: 在执行时，设备代码将生成 10 个事件 .. code::
zh_tw: 執行裝置程式碼時，將產生 10 個事件 .. code::

source: Returning to the terminal where your application is running you will be able to see the application is recieving and processing the events submitted by your device in real time.
de: In dem Terminal, auf dem Ihre Anwendung ausgeführt wird, können Sie nun sehen, dass die Anwendung die Ereignisse in Echtzeit empfängt und verarbeitet, die von Ihrem Gerät übermittelt werden.
pt_br: Retornando ao terminal onde seu aplicativo está em execução, você conseguirá ver que o aplicativo está recebendo e processando os eventos enviados por seu dispositivo em tempo real.
zh_cn: 返回到应用程序运行所在的终端，您将能够实时查看应用程序正在接收和处理设备提交的事件。
zh_tw: 回到您的應用程式執行所在的終端機，您將能夠即時看到應用程式正在接收和處理裝置所提交的事件。

source: Finally, if you return to the Watson IoT platform dashboard and scroll down to ``Device Events`` you will be able to see all the events that you just sent.
de: Wenn Sie nun zum Watson IoT Platform-Dashboard wechseln und nach unten zu ``Geräteereignisse`` blättern, werden alle Ereignisse angezeigt, die Sie eben gesendet haben.
pt_br: Finalmente, se você retornar ao painel da plataforma Watson IoT e rolar para baixo para ``Eventos de Dispositivo``, será capaz de ver todos os eventos que acabou de enviar.
zh_cn: 最后，如果返回到 Watson IoT Platform 仪表板并向下滚动到“设备事件”，那么将能够看到刚发送的所有事件。
zh_tw: 最後，如果回到 Watson IoT Platform 儀表板，並向下捲動至「裝置事件」，您將能夠看到您剛傳送的所有事件。

source: You can also examine the content of any of the events by selecting an event from the table.
de: Sie können auch den Inhalt eines bestimmten Ereignisses untersuchen, indem Sie das Ereignis in der Tabelle auswählen.
pt_br: Também é possível examinar o conteúdo de qualquer um dos eventos selecionando um evento na tabela.
zh_cn: 您也可以通过从表中选择事件来检查任何事件的内容。
zh_tw: 您也可以從表格中選取任一個事件，以檢查該事件的內容。
