Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/api.po
Languages: it, ja, zh_cn, zh_tw

source: HTTP API for Applications
it: API HTTP per le applicazioni
ja: アプリケーション用の HTTP API
zh_cn: 应用程序的 HTTP API
zh_tw: 適用於應用程式的 HTTP API

source: The IoT Platform API can be used to interact with your organization in the IoT Platform.
it: L'API della piattaforma IoT può essere utilizzata per interagire con l'organizzazione nella piattaforma IoT.
ja: IoT Platform API を使用すると、IoT Platform で組織と対話することができます。
zh_cn: 在 IoT Platform 中，可以使用 IoT Platform API 与贵组织进行交互。
zh_tw: IoT Platform API 可以用來在 IoT Platform 中與您的組織互動。

source: API Capabilities
it: Funzioni API
ja: API の機能
zh_cn: API 功能
zh_tw: API 功能

source: The IoT Platform API supports the following functionality for applications:
it: L'API della piattaforma IoT supporta le seguenti funzionalità per le applicazioni.
ja: IoT Platform API は、以下のアプリケーション用の機能をサポートしています。
zh_cn: IoT Platform API 针对应用程序支持以下功能：
zh_tw: IoT Platform API 支援應用程式的下列功能：

source: View organization details.
it: Visualizzare i dettagli dell'organizzazione.
ja: 組織の詳細を表示します。
zh_cn: 查看组织详细信息。
zh_tw: 檢視組織詳細資料。

source: Bulk device operations (list all, add, remove).
it: Operazioni dispositivo in massa (elenca tutti, aggiungi, rimuovi).
ja: デバイスの一括操作 (すべてリスト、追加、削除)。
zh_cn: 成批设备操作（列出所有、添加、移除）。
zh_tw: 大量裝置作業（全部列出、新增、移除）。

source: Device type operations (list all, create, delete, view details, update).
it: Operazioni per tipo di dispositivo (elenca tutti, crea, elimina, visualizza dettagli, aggiorna).
ja: デバイス・タイプの操作 (すべてリスト、作成、削除、詳細の表示、更新)。
zh_cn: 设备类型操作（列出所有、创建、删除、查看详细信息、更新）。
zh_tw: 裝置類型作業（全部列出、建立、刪除、檢視詳細資料、更新）。

source: Device operations (list devices, add, remove, view details, update, view location, view management information).
it: Le operazioni dispositivo (elencare dispositivi, aggiungerli, rimuoverli, visualizzarne i dettagli, aggiornarli, visualizzarne l'ubicazione, visualizzarne le informazioni di gestione).
ja: デバイス操作 (デバイスのリスト、追加、削除、詳細の表示、更新、ロケーションの表示、管理情報の表示)。
zh_cn: 设备操作（列出设备、添加、移除、查看详细信息、更新、查看位置、查看管理信息）。
zh_tw: 裝置作業（列出裝置、新增、移除、檢視詳細資料、更新、檢視位置、檢視管理資訊）。

source: Device diagnostic operations (clear log, retrieve logs, add log information, delete logs, get specific log, clear error codes, get device error codes, add an error code).
it: Le operazioni di diagnostica del dispositivo (cancellazione log, richiamo log, aggiunta informazioni log, eliminazione log, richiamo log specifico, cancellazione codici di errore, ottenimento codici di errore del dispositivo, aggiunta di un codice di errore).
ja: デバイス診断操作 (ログの消去、ログの取得、ログ情報の追加、ログの削除、特定のログの取得、エラー・コードの消去、デバイス・エラー・コードの取得、エラー・コードの追加)。
zh_cn: 设备诊断操作（清除日志、检索日志、添加日志信息、删除日志、获取特定日志、清除错误代码、获取设备错误代码、添加错误代码）。
zh_tw: 裝置診斷作業（清除日誌、擷取日誌、新增日誌資訊、刪除日誌、取得特定日誌、清除錯誤碼、取得裝置錯誤碼、新增錯誤碼）。

source: Connection problem determination (list device connection log events).
it: Determinazione problema di connessione (elencare eventi log connessione dispositivo).
ja: 接続の問題判別 (デバイス接続ログ・イベントのリスト)。
zh_cn: 连接问题确定（列出设备连接日志事件）。
zh_tw: 連線問題判斷（列出裝置連線日誌事件）。

source: Historical event retrieval (view events from all devices, view events from a device type, view events for a specific device).
it: Richiamo statistiche evento (visualizzazione eventi da tutti i dispositivi, visualizzazione eventi da un tipo di dispositivo, visualizzazione eventi per un dispositivo specifico).
ja: 履歴イベントの取得 (全デバイスのイベントの表示、1 つのデバイス・タイプのイベントの表示、特定のデバイスのイベントの表示)。
zh_cn: 历史事件检索（查看所有设备的事件、查看某种设备类型的事件、查看特定设备的事件）。
zh_tw: 擷取歷程事件（檢視所有裝置的事件、檢視某一裝置類型的事件、檢視特定裝置的事件）。

source: Device management request operations (list device management requests, initiate a request, clear request status, get details of a request, get list of request statuses for each affected device, get request status for a specific device).
it: Le operazioni di richiesta di gestione dispositivo (elencare richieste di gestione dispositivo, avviare una richiesta, cancellare lo stato della richiesta, richiamare i dettagli di una richiesta, ottenere l'elenco di stati della richiesta per ciascun dispositivo interessato, richiamare lo stato della richiesta per uno specifico dispositivo).
ja: デバイス管理リクエストの操作 (デバイス管理リクエストのリスト、リクエストの開始、リクエスト状況の消去、リクエストの詳細の取得、影響を受ける各デバイスのリクエスト状況のリストの取得、特定のデバイスのリクエスト状況の取得)。
zh_cn: 设备管理请求操作（列出设备管理请求、启动请求、清除请求状态、获取请求详细信息、获取每个受影响设备的请求状态列表、获取特定设备的请求状态）。
zh_tw: 裝置管理要求作業（列出裝置管理要求、起始要求、清除要求狀態、取得要求的詳細資料、取得每一個受影響裝置的要求狀態清單、取得特定裝置的要求狀態）。

source: Usage management (retrieve number of active devices over a period of time, retrieve amount of storage used by historical event data, retrieve total amount of data used).
it: Gestione utilizzo (richiamare il numero di dispositivi attivi in un determinato periodo di tempo, richiamare la quantità di spazio di archiviazione utilizzata dai dati evento cronologici, richiamare la quantità totale di dati utilizzati).
ja: 使用の管理 (ある期間のアクティブ・デバイス数の取得、履歴イベント・データで使用されているストレージ量の取得、使用されているデータ総量の取得)。
zh_cn: 使用情况管理（检索某段时间内的活动设备数、检索历史事件数据所用的存储量、检索已用数据总量）。
zh_tw: 使用情形管理（擷取一段時間內作用中的裝置數、擷取歷程事件資料所使用的儲存體量、擷取所使用的總資料量）。

source: Publish events on behalf of devices (beta)
it: Pubblicare gli eventi per conto dei dispositivi (beta)
ja: デバイスの代わりにイベントをパブリッシュする機能 (ベータ)
zh_cn: 代表设备发布事件（测试）
zh_tw: 代表裝置發佈事件（測試版）

source: Service status queries (retrieve service statuses for an organization).
it: Query dello stato del servizio (richiamare gli stati del servizio per un'organizzazione).
ja: サービス状況の照会 (ある組織のサービス状況の取得)。
zh_cn: 服务状态查询（为组织检索服务状态）。
zh_tw: 服務狀態查詢（擷取組織的服務狀態）。

source: IoT Platform API Version 2
it: API IoT Platform Versione 2
ja: IoT Platform API バージョン 2
zh_cn: IoT Platform API V2
zh_tw: IoT Platform API 第 2 版

source: The current version of the IoT Platform API is `version 2 <../swagger/v0002.html>`_. We strongly recommend that all users build their solutions based on the version 2 APIs.
it: La versione corrente di IoT Platform API è la`versione 2 <../swagger/v0002.html>`_. Si consiglia fortemente a tutti gli utenti di creare le loro soluzioni sulla base delle API versione 2.
ja: IoT Platform API の現行バージョンは、`バージョン 2 <../swagger/v0002.html>`_ です。すべてのユーザーがバージョン 2 の API に基づいてソリューションを作成することを強くお勧めします。
zh_cn: IoT Platform API 的最新版本为 `V2 <../swagger/v0002.html>`_。我们强烈建议所有用户基于 API V2 构建其解决方案。
zh_tw: IoT Platform API 的現行版本為 `第 2 版 <../swagger/v0002.html>`_。強烈建議所有使用者根據第 2 版 API 建置其解決方案。

source: IoT Platform API Version 1
it: API IoT Platform Versione 1
ja: IoT Platform API バージョン 1
zh_cn: IoT Platform API V1
zh_tw: IoT Platform API 第 1 版

source: `Version 1 <../swagger/v0001.html>`_ of the API is still supported, however it should now be considered a deprecated API, many features listed above are not available in the version 1 API.
it: `La versione 1 <../swagger/v0001.html>`_ dell'API è ancora supportata, tuttavia ora dovrebbe essere considera obsoleta, molte funzioni elencate sopra non sono disponibili nell'API versione 1.
ja: `バージョン 1 <../swagger/v0001.html>`_ の API はまだサポートされていますが、非推奨の API と見なされるようになりました。上記の機能の多くはバージョン 1 の API では利用できません。
zh_cn: 仍支持 API `<../swagger/v0001.html> V1`_，但是现在应将其视为不推荐使用的 API，以上列出的许多功能在 API V1 中不再提供。
zh_tw: 仍然支援 `第 1 版 <../swagger/v0001.html>`_ API，不過，現在應該將它視為已淘汰的 API，因為上面列出的許多功能無法在第 1 版 API 中使用。

source: Many of the API paths relating to devices have changed.
it: Molti dei percorsi API relativi ai dispositivi sono stati modificati.
ja: デバイスに関連する多くの API パスが変更されました。
zh_cn: 与设备相关的许多 API 路径都发生了更改。
zh_tw: 許多與裝置相關的 API 路徑已變更。

source: Version 1 of the API does not support any device type operations, other than listing all device types.
it: La versione 1 dell'API non supporta le operazioni tipo di dispositivo diverse dall'elenco di tutti i tipi di dispositivo.
ja: バージョン 1 の API では、全デバイス・タイプのリスト操作を除き、デバイス・タイプの操作がサポートされません。
zh_cn: 除了列出所有设备类型外，API V1 不支持任何其他设备类型操作。
zh_tw: 第 1 版 API 不支援列出所有裝置類型以外的任何裝置類型作業。

source: Operations related to device management, device management requests, diagnostic information, or location cannot be performed using version 1 of the API.
it: Le operazioni correlate alla gestione dispositivo, le richieste di gestione dispositivo, le informazioni di diagnostica o l'ubicazione non possono essere eseguite utilizzando la versione 1 dell'API.
ja: バージョン 1 の API では、デバイス管理、デバイス管理リクエスト、診断情報、およびロケーションに関連した操作は実行できません。
zh_cn: 使用 API V1 无法执行与设备管理、设备管理请求、诊断信息或位置相关的操作。
zh_tw: 與裝置管理、裝置管理要求、診斷資訊或位置相關的作業，無法使用第 1 版 API 來執行。
