Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/mqtt.po
Languages: ja, pt_br, zh_tw

source: client 3 connects as A:abc123:myApplication and subscribes to all device events now, instance 1, 2 and 3 will process the events shared amongst all three instances
ja: クライアント 3 が A:abc123:myApplication として接続し、すべてのデバイス・イベントをサブスクライブするようになる。インスタンス 1、2、および 3 は、3 つのインスタンスのすべての間で共有されたイベントを処理する
pt_br: O cliente 3 se conecta como A:abc123:myApplication e assina todos os eventos do dispositivo; agora, as instâncias 1, 2 e 3 processarão os eventos compartilhados entre as três instâncias
zh_tw: 用戶端 3 以 A:abc123:myApplication 連接且現在訂閱所有裝置事件，實例 1、2 及 3 將會處理在這三個實例之間共用的事件

source: clients 2 and 3 unsubscribe from all device events now, although instance 2 and 3 are still connected to the service, instance 1 will be receiving all device events published
ja: クライアント 2 および 3 がすべてのデバイス・イベントをアンサブスクライブするようになるが、インスタンス 2 および 3 はまだサービスに接続されている。インスタンス 1 が、パブリッシュされるすべてのデバイス・イベントを受け取る
pt_br: Os clientes 2 e 3 cancelam as assinaturas de todos os eventos do dispositivo; agora, embora as instâncias 2 e 3 ainda estejam conectadas ao serviço, a instância 1 receberá todos os eventos do dispositivo publicados
zh_tw: 用戶端 2 及 3 現在取消訂閱所有裝置事件，雖然實例 2 及 3 仍然連接至服務，但實例 1 會接收所有發佈的裝置事件
