Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/mqtt.po
Languages: ja, pt_br, zh_tw

source: MQTT Connectivity for Applications
ja: MQTT アプリケーション接続
pt_br: Conectividade MQTT para Aplicativos
zh_tw: 應用程式的 MQTT 連線功能

source: Client connection
ja: クライアント接続
pt_br: Conexão do cliente
zh_tw: 用戶端連線

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for applications in that organization.
ja: どの登録済み組織にも固有のエンドポイントがあり、その組織でアプリケーションの MQTT クライアントを接続する際には、そのエンドポイントを使用する必要があります。
pt_br: Cada organização registrada possui um terminal exclusivo que deve ser usado ao conectar clientes MQTT para aplicativos nessa organização.
zh_tw: 每一個已登錄的組織都有唯一的端點，當針對該組織中的應用程式連接 MQTT 用戶端時必須使用此端點。

source: Unencrypted client connection
ja: 非暗号化クライアント接続
pt_br: Conexão do cliente não criptografada
zh_tw: 未加密的用戶端連線

source: Connect on port **1883**
ja: ポート **1883** での接続
pt_br: Conectar à porta **1883**
zh_tw: 在埠 **1883** 連接

source: All information your application submits is being sent in plain text (including the API key and authentication token). We recommend the use of an encrypted connection whenever possible.
ja: アプリケーションから送られるすべての情報は、プレーン・テキストで送信されます (API キーや認証トークンを含む)。可能な限り、暗号化接続を使用することをお勧めします。
pt_br: Todas as informações que seu aplicativo envia estão sendo enviadas em texto simples (incluindo a chave de API e o token de autenticação). Recomendamos o uso de uma conexão criptografada sempre que possível.
zh_tw: 應用程式提交的所有資訊將以純文字傳送（包括 API 金鑰和鑑別記號）。我們建議盡可能使用加密連線。

source: Encrypted client connection
ja: 暗号化クライアント接続
pt_br: Conexão do cliente criptografada
zh_tw: 已加密的用戶端連線

source: Connect on port **8883** or **443** for websockets.
ja: Web ソケットのポート **8883** または **443** での接続
pt_br: Conectar à porta **8883** ou **443** para websockets.
zh_tw: 針對 Websocket，在埠 **8883** 或 **443** 連接。

source: In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
ja: 多くのクライアント・ライブラリーでは、サーバーの公開証明書を pem 形式で提供する必要があります。以下のファイルには、\*.messaging.internetofthings.ibmcloud.com: messaging.pem_ の証明書チェーン全体が含まれています。
pt_br: Em muitas bibliotecas de clientes, você precisará fornecer um certificado público do servidor no formato pem. O arquivo a seguir contém a sequência de certificados inteira para \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
zh_tw: 在許多用戶端程式庫中，您需要以 pem 格式提供伺服器的公用憑證。下列檔案包含 \*.messaging.internetofthings.ibmcloud.com: messaging.pem_ 的整個憑證鏈

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
ja: SSL クライアント・ライブラリーの中には、ドメイン部分のワイルドカードを処理しないものがあります。その場合、ライブラリーを変更できないのであれば、証明書チェックをオフにするしかありません。
pt_br: Algumas bibliotecas do cliente SSL demonstraram não manipular domínios com caractere curinga; neste caso, se você não puder mudar as bibliotecas, será necessário desativar a verificação de certificados.
zh_tw: 部分 SSL 用戶端程式庫已表明不處理含萬用字元的網域，在該情況下，如果您無法變更程式庫，則需要關閉憑證檢查。

source: The IoT Platform requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
ja: IoT Platform では TLS v1.2 が必要です。推奨される暗号スイートは次のとおり: ECDHE-RSA-AES256-GCM-SHA384、AES256-GCM-SHA384、ECDHE-RSA-AES128-GCM-SHA256、または AES128-GCM-SHA256 *(2015 年 6 月 1 日現在)
pt_br: O IoT Platform requer o TLS v1.2. Sugerimos os seguintes conjuntos de cifras: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 ou AES128-GCM-SHA256 *(a partir de 1 de junho de 2015)*.
zh_tw: IoT Platform 需要 TLS 1.2 版。我們建議使用下列密碼組合：ECDHE-RSA-AES256-GCM-SHA384、AES256-GCM-SHA384、ECDHE-RSA-AES128-GCM-SHA256 或 AES128-GCM-SHA256 *（從 2015 年 6 月 1 日開始）*。

source: MQTT client identifier
ja: MQTT クライアント ID
pt_br: Identificador de cliente MQTT
zh_tw: MQTT 用戶端 ID

source: An application must authenticate using a client ID in the following format:
ja: アプリケーションは、以下の形式のクライアント ID を使用して認証を行う必要があります。
pt_br: Um aplicativo deve autenticar usando um ID de cliente no seguinte formato:
zh_tw: 應用程式必須使用下列格式的用戶端 ID 進行鑑別：

source: **a** indicates the client is an application
ja: **a** は、クライアントがアプリケーションであることを示します
pt_br: **a** indica que o cliente é um aplicativo
zh_tw: **a** 指出用戶端是應用程式

source: **org\_id** is your unique 6 character organization ID, assigned when you sign up with the service
ja: **org\_id** は、サービス登録時に割り当てられる、6 文字の固有の組織 ID です。
pt_br: **org\_id** é seu ID da organização de 6 caracteres exclusivo, designado quando você se inscreve no serviço
zh_tw: **org\_id** 是 6 個字元的唯一組織 ID，當您註冊服務時會指派該 ID

source: **app\_id** is a user-defined unique string identifier for this client and must comprise only alpha-numeric characters (a-z, A-Z, 0-9) and the following special characters: dash (-), underscore (\_), dot (.)
ja: **app\_id** は、このクライアントの固有のユーザー定義ストリング ID です。英数字 (a-z、A-Z、0-9)、および特殊文字のダッシュ (-), 下線 (\_)、ドット (.) のみで構成されなければなりません。
pt_br: **app\_id** é um identificador de sequência exclusiva definido pelo usuário para este cliente e deve ser composto somente de caracteres alfanuméricos (a-z, A-Z, 0-9) e dos caracteres especiais a seguir: traço (-), sublinhado (\_), ponto (.)
zh_tw: **app\_id** 是此用戶端的使用者定義的唯一字串 ID，且只能包含英數字元（a-z、A-Z、0-9）及下列特殊字元：橫線 (-)、底線 (\_)、點 (.)。

source: **app\_id** has a maximum length of 36 characters
ja: **app\_id** の最大長は 36 文字です
pt_br: **app\_id** possui um comprimento máximo de 36 caracteres
zh_tw: **app\_id** 的長度上限為 36 個字元

source: When connecting to the Quickstart service no authentication is required
ja: Quickstart サービスに接続する際、認証は必要ありません
pt_br: Ao conectar ao serviço Quickstart, nenhuma autenticação é necessária
zh_tw: 連接至 Quickstart 服務時，不需要進行鑑別

source: An application does not need to be registered before it can connect
ja: 接続の前にアプリケーションを登録する必要はありません
pt_br: Um aplicativo não precisa ser registrado antes de poder se conectar
zh_tw: 應用程式不需要先登錄就可以連接

source: Only one MQTT client can connect using any given client ID. As soon as a second client in your organization connects using an **app\_id** that you have already connected the first client will be disconnected.
ja: 特定のクライアント ID を使用して接続できる MQTT クライアントは 1 つだけです。既に接続済みの **app\_id** を使用して組織内の第 2 のクライアントが接続すると、第 1 のクライアントは切断されます。
pt_br: Apenas um cliente MQTT pode se conectar usando qualquer ID de cliente fornecido. Assim que um segundo cliente em sua organização se conecta usando um **app\_id** ao qual você já se conectou, o primeiro cliente será desconectado.
zh_tw: 使用任何給定的用戶端 ID 只能連接一個 MQTT 用戶端。一旦您組織中有第二個用戶端使用您已連接的 **app\_id** 來進行連接，則第一個用戶端會中斷連接。

source: MQTT authentication
ja: MQTT 認証
pt_br: Autenticação MQTT
zh_tw: MQTT 鑑別

source: Applications require an API Key to connect into an organization. When an API Key is registered a token will be generated that must be used with that API key.
ja: アプリケーションが組織に接続するには API キーが必要です。API キーを登録すると、その API キーと共に使用する必要のあるトークンが生成されます。
pt_br: Os aplicativos requerem uma Chave API para se conectarem em uma organização. Quando uma Chave API é registrada, é gerado um token que deve ser usado com essa chave API.
zh_tw: 應用程式需要 API 金鑰來連接到組織。當登錄 API 金鑰時，會產生一個記號，它必須與 API 金鑰一起使用。

source: The API key will look something like this: a-**org\_id**-a84ps90Ajs
ja: API キーは、a-**org\_id**-a84ps90Ajs のような形式です
pt_br: A chave API será semelhante a esta: a-**org\_id**-a84ps90Ajs
zh_tw: API 金鑰與下列內容類似：a-**org\_id**-a84ps90Ajs

source: The token will look something like this: MP$08VKz!8rXwnR-Q*
ja: トークンは、MP$08VKz!8rXwnR-Q* のような形式です
pt_br: O token será semelhante a este: MP$08VKz!8rXwnR-Q*
zh_tw: 此記號與下列內容類似：MP$08VKz!8rXwnR-Q*

source: When making an MQTT connection using an API key the following applies:
ja: API キーを使用して MQTT 接続を確立する際には、以下の点が適用されます。
pt_br: Ao estabelecer uma conexão MQTT usando uma chave API, o seguinte se aplica:
zh_tw: 當使用 API 金鑰建立 MQTT 連線時，適用下列規定：

source: MQTT client ID: a:**org\id**:**app\_id**
ja: MQTT クライアント ID: a:**org\id**:**app\_id**
pt_br: ID do cliente MQTT: a:**org\id**:**app\_id**
zh_tw: MQTT 用戶端 ID：a:**org\id**:**app\_id**

source: MQTT username must be the API key: a-**org\_id**-a84ps90Ajs
ja: MQTT ユーザー名は API キーでなければなりません: a-**org\_id**-a84ps90Ajs
pt_br: O nome do usuário MQTT deve ser a chave API: a-**org\_id**-a84ps90Ajs
zh_tw: MQTT 使用者名稱必須是 API 金鑰：a-**org\_id**-a84ps90Ajs

source: MQTT password must be the authentication token: MP$08VKz!8rXwnR-Q*
ja: MQTT パスワードは認証トークンでなければなりません: MP$08VKz!8rXwnR-Q*
pt_br: A senha MQTT deve ser o token de autenticação: MP$08VKz!8rXwnR-Q*
zh_tw: MQTT 密碼必須是鑑別記號：MP$08VKz!8rXwnR-Q*

source: Publishing device events
ja: デバイス・イベントのパブリッシュ
pt_br: Publicando eventos de dispositivos
zh_tw: 發佈裝置事件

source: An application can publish events as if they came from any registered device.
ja: アプリケーションは、登録デバイスから発信されたようにしてイベントをパブリッシュすることができます。
pt_br: Um aplicativo pode publicar eventos como se eles viessem de qualquer dispositivo registrado.
zh_tw: 應用程式可當成事件是來自任何已登錄裝置來發佈事件。

source: Publish to topic iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
ja: パブリッシュ先トピック iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
pt_br: Publicar para o tópico iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
zh_tw: 發佈至主題 iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**

source: You may have a number of devices that are already generating bespoke data that you wish to send to the IoT Platform. One way to get that data into the service would be to write an application that processes the data and publishes it to the IoT Platform.
ja: 特別な仕様のデータを既に多数のデバイスで生成していて、そのデータを IoT Platform に送信したいというケースがあります。そのようなデータをサービスに取り込む方法の 1 つは、そのデータを処理して IoT Platform にパブリッシュするアプリケーションを作成することです。
pt_br: Você pode ter vários dispositivos que já estejam gerando dados bespoke que você deseja enviar ao IoT Platform. Uma maneira de obter esses dados no serviço seria gravar um aplicativo que processa os dados e os publica no IoT Platform.
zh_tw: 您可能有許多裝置已產生您要傳送至 IoT Platform 的預定資料。使該資料進入服務的方法之一是撰寫應用程式來處理該資料，並將它發佈至 IoT Platform。

source: The message payload is limited to a maximum of 131072 bytes. Messages larger than this will be rejected.
ja: メッセージ・ペイロードは最大 131072 バイトに制限されます。これより大きいメッセージは拒否されます。
pt_br: A carga útil da mensagem é limitada a um máximo de 131072 bytes. Mensagens maiores do que esta serão rejeitadas.
zh_tw: 訊息內容的位元組數上限為 131072 個位元組。大於此上限的訊息將遭到拒絕。

source: Publishing device commands
ja: デバイス・コマンドのパブリッシュ
pt_br: Publicando comandos de dispositivos
zh_tw: 發佈裝置指令

source: An application can publish a command to any registered device.
ja: アプリケーションは、登録デバイスに対してコマンドをパブリッシュすることができます。
pt_br: Um aplicativo pode publicar um comando para qualquer dispositivo registrado.
zh_tw: 應用程式可將指令發佈至任何已登錄裝置。

source: Publish to topic iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
ja: パブリッシュ先トピック iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
pt_br: Publicar para o tópico iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
zh_tw: 發佈至主題 iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**

source: Subscribing to device events
ja: デバイス・イベントへのサブスクライブ
pt_br: Assinando eventos de dispositivo
zh_tw: 訂閱裝置事件

source: An application can subscribe to events from one or more devices.
ja: アプリケーションは、1 つ以上のデバイスからイベントをサブスクライブすることができます。
pt_br: Um aplicativo pode assinar eventos a partir de um ou mais dispositivos.
zh_tw: 應用程式可訂閱來自一或多個裝置的事件。

source: Subscribe to topic iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
ja: サブスクライブ先トピック iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
pt_br: Assinar para o tópico iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
zh_tw: 訂閱主題 iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**

source: The MQTT "any" wildcard character (+) may be used for any of the following components if you want to subscribe to more than one type of event, or events from more than a single device.
ja: 複数のタイプのイベントまたは複数デバイスからのイベントをサブスクライブする場合、以下のいずれの部分についても MQTT の任意文字列ワイルドカード文字 (+) を使用することができます。
pt_br: O caractere curinga "any" MQTT (+) pode ser usado para qualquer um dos seguintes componentes se você desejar assinar mais de um tipo de evento ou eventos de mais do que um único dispositivo.
zh_tw: 如果要訂閱多種類型的事件，或來自多個裝置的事件，可針對下列任何元件使用 MQTT "any" 萬用字元 (+)。

source: Subscribing to device commands
ja: デバイス・コマンドへのサブスクライブ
pt_br: Assinando comandos de dispositivo
zh_tw: 訂閱裝置指令

source: An application can subscribe to commands being sent to one or more devices.
ja: アプリケーションは、1 つ以上のデバイスに送信されるコマンドをサブスクライブすることができます。
pt_br: Um aplicativo pode assinar comandos que estão sendo enviados para um ou mais dispositivos.
zh_tw: 應用程式可訂閱要傳送至一或多個裝置的指令。

source: Subscribe to topic iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
ja: サブスクライブ先トピック iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
pt_br: Assinar para o tópico iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
zh_tw: 訂閱主題 iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**

source: Subscribing to device status messages
ja: デバイス状況メッセージへのサブスクライブ
pt_br: Assinando mensagens de status do dispositivo
zh_tw: 訂閱裝置狀態訊息

source: An application can subscribe to monitor status of one or more devices.
ja: アプリケーションは、1 つ以上のデバイスのモニター状況をサブスクライブすることができます。
pt_br: Um aplicativo pode assinar para monitorar o status de um ou mais dispositivos.
zh_tw: 應用程式可訂閱一或多個裝置的監視狀態。

source: Subscribe to topic iot-2/type/**device\_type**/id/**device\_id**/mon
ja: サブスクライブ先トピック iot-2/type/**device\_type**/id/**device\_id**/mon
pt_br: Assinar para o tópico iot-2/type/**device\_type**/id/**device\_id**/mon
zh_tw: 訂閱主題 iot-2/type/**device\_type**/id/**device\_id**/mon

source: The MQTT "any" wildcard character (+) may be used for any of the following components if you want to subscribe to updates from more than one device.
ja: 複数デバイスからの更新をサブスクライブする場合、以下のいずれの部分についても MQTT の任意文字列ワイルドカード文字 (+) を使用することができます。
pt_br: O caractere curinga "any" MQTT (+) pode ser usado para qualquer um dos componentes a seguir se você desejar assinar atualizações de mais de um dispositivo.
zh_tw: 如果要訂閱來自多個裝置的更新項目，可針對下列任何元件使用 MQTT "any" 萬用字元 (+)。

source: Subscribing to application status messages
ja: アプリケーション状況メッセージのサブスクライブ
pt_br: Assinando mensagens de status do aplicativo
zh_tw: 訂閱應用程式狀態訊息

source: An application can subscribe to monitor status of one or more applications.
ja: アプリケーションは、1 つ以上のアプリケーションのモニター状況をサブスクライブすることができます。
pt_br: Um aplicativo pode assinar para monitorar o status de um ou mais aplicativos.
zh_tw: 應用程式可訂閱一或多個應用程式的監視狀態。

source: Subscribe to topic iot-2/app/**app\_id**/mon
ja: サブスクライブ先トピック iot-2/app/**app\_id**/mon
pt_br: Assinar para o tópico iot-2/app/**app\_id**/mon
zh_tw: 訂閱主題 iot-2/app/**app\_id**/mon

source: The MQTT "any" wildcard character (+) may be used for **app\_id** if you want to subscribe for updates for all applications.
ja: すべてのアプリケーションの更新にサブスクライブする場合、**app\_id** に MQTT の任意文字列ワイルドカード文字 (+) を使用することができます。
pt_br: O caractere curinga "any" MQTT (+) pode ser usado para **app\_id** se você desejar assinar atualizações para todos os aplicativos.
zh_tw: 如果要訂閱所有應用程式的更新項目，可針對 **app\_id** 使用 MQTT "any" 萬用字元 (+)。

source: Quickstart restrictions
ja: Quickstart の制限
pt_br: Restrições do Quickstart
zh_tw: Quickstart 限制

source: If you are writing application code that wants to support use with Quickstart you must take into account the following features present in the registered service that are not supported in Quickstart:
ja: Quickstart との併用をサポートするアプリケーション・コードを作成する場合、Quickstart でサポートされない登録済みサービスに含まれる以下の機能を考慮する必要があります。
pt_br: Se você estiver gravando o código de aplicativo que deseja suportar o uso com o Quickstart, deverá levar em conta os seguintes recursos presentes no serviço registrado que não são suportados no Quickstart:
zh_tw: 如果您要撰寫應用程式碼來支援與 Quickstart 搭配使用，則必須考量已登錄服務中所具有但 Quickstart 不支援的下列特性：

source: Publishing commands
ja: コマンドのパブリッシュ
pt_br: Publicando comandos
zh_tw: 發佈指令

source: Subscribing to commands
ja: コマンドのサブスクライブ
pt_br: Assinando comandos
zh_tw: 訂閱指令

source: Use of the MQTT "any" wildcard character (+) for the following topic components:
ja: 以下のトピック部分での MQTT 任意文字列ワイルドカード文字 (+) の使用
pt_br: Uso do caractere curinga "any" MQTT (+) para os seguintes componentes do tópico:
zh_tw: 對下列主題元件使用 MQTT "any" 萬用字元 (+)：

source: MQTT connection over SSL
ja: MQTT SSL 接続
pt_br: Conexão MQTT over SSL
zh_tw: 透過 SSL 的 MQTT 連線

source: Scalable Applications
ja: スケーラブル・アプリケーション
pt_br: Aplicativos Escaláveis
zh_tw: 可調式應用程式

source: You can build scalable applications which will load balance messages across multiple instances of your application by making a few changes to how your application connects to the IoT Platform. Applications taking advantage of this feature must only attempt to make non-durable subscriptions. A bit of experimentation may be needed to understand how many clients are needed for the optimum balance in load.
ja: アプリケーションを IoT Platform に接続する方法を少し変更することで、アプリケーションの複数インスタンス間でメッセージのロード・バランシングを実行するスケーラブルなアプリケーションを作成できます。この機能を活用するアプリケーションでは、非永続サブスクリプションのみを作成する必要があります。ロード・バランスを最適化するために必要なクライアント数を調べるには、少し実験する必要があります。
pt_br: É possível construir aplicativos escaláveis que farão o balanceamento das cargas de mensagens em várias instâncias do aplicativo fazendo algumas mudanças no modo como o aplicativo se conecta ao IoT Platform. Os aplicativos que utilizam esse recurso devem tentar apenas fazer assinaturas não duráveis. Pode ser necessário fazer alguns testes para saber quantos clientes são necessários para obter o balanceamento ideal da carga.
zh_tw: 您可以建置可調式應用程式，針對應用程式連接至 IoT Platform 的方式進行一些變更，以在多個應用程式實例之間對訊息進行負載平衡。利用這項特性的應用程式只能嘗試進行不可延續的訂閱。您可能需要進行一點實驗，以瞭解需要多少用戶端才能達到最佳的負載平衡。

source: Supply a client id of the form **A**:**org\_id**:**app\_id**
ja: **A**:**org\_id**:**app\_id** 形式のクライアント ID を指定します
pt_br: Forneça um ID de cliente com o formato **A**:**org\_id**:**app\_id**
zh_tw: 提供格式為 **A**:**org\_id**:**app\_id** 的用戶端 ID

source: **A** indicates the client is a scalable application
ja: **A** は、クライアントがスケーラブル・アプリケーションであることを示します
pt_br: **A** indica que o cliente é um aplicativo escalável
zh_tw: **A** 表示用戶端是可調式應用程式

source: **org\_id** is your unique organization ID, assigned when you sign up with the service. It will be a 6 character alphanumeric string.
ja: **org\_id** は、サービス登録時に割り当てられる固有の組織 ID です。これは 6 文字の英数字ストリングです。
pt_br: **org\_id** é o ID exclusivo da organização, designado quando você se inscreve para o serviço. Ele será uma sequência alfanumérica de 6 caracteres.
zh_tw: **org\_id** 是唯一組織 ID，當您註冊服務時會指派該 ID。它將會是一個 6 字元的英數字串。

source: **app\_id** is a user-defined unique string identifier for this client.
ja: **app\_id** は、このクライアントのための固有のユーザー定義ストリング ID です。
pt_br: **app\_id** é um identificador de sequência exclusivo definido pelo usuário para este cliente.
zh_tw: **app\_id** 是使用者針對此用戶端定義的唯一字串 ID。

source: Create a non-durable subscription
ja: 非永続サブスクリプションの作成
pt_br: Crie uma assinatura não durável
zh_tw: 建立不可延續的訂閱

source: Only non-durable subscriptions are supported for scalable applications. Please note that the client id must begin with a capital 'A' in order to designated as a scalable application by the IoT Platform. Multiple clients that are part of the scalable application should use the exact same client id.
ja: スケーラブル・アプリケーションでは、非永続サブスクリプションのみがサポートされます。IoT Platform からスケーラブルなアプリケーションとして指定されるために、クライアント ID を大文字の 'A' で始める必要があることに注意してください。スケーラブル・アプリケーションの一部である複数のクライアントは、同じクライアント ID を使用する必要があります。
pt_br: Apenas assinaturas não duráveis são suportadas para aplicativos escaláveis. Observe que o ID do cliente deve começar com um 'A' maiúsculo para ser designado como um aplicativo escalável pelo IoT Platform. Vários clientes que fazem parte do aplicativo escalável devem usar exatamente o mesmo ID de cliente.
zh_tw: 可調式應用程式僅支援不可延續的訂閱。請注意用戶端 ID 的開頭必須是大寫 'A'，IoT Platform 才能將它指定為可調式應用程式。屬於可調式應用程式一部分的多個用戶端應該使用完全相同的用戶端 ID。

source: How It Works
ja: 動作内容
pt_br: Como ele funciona
zh_tw: 如何運作

source: The IoT Platform service extends the MQTT 3.1.1 specification to provide support for shared subscriptions. Shared subscription can provide simple load balancing functionality for applications. A shared subscription might be needed if a back-end enterprise application can not keep up with the number of messages being published to a specific topic space. For example if many devices were publishing messages that are being processed by a single application. It might be helpful to leverage the load balancing capability of a shared subscription. IoT Platform shared subscription support is limited to non-durable subscriptions only.
ja: IoT Platform サービスは、共用サブスクリプションをサポートできるように MQTT 3.1.1 仕様を拡張したものです。共用サブスクリプションは、アプリケーションに対して簡単なロード・バランシング機能を提供できます。バックエンド・エンタープライズ・アプリケーションが特定のトピック・スペースにパブリッシュされる多数のメッセージに対応できない場合、共用サブスクリプションが必要になる場合があります。例えば、単一アプリケーションによって処理されるメッセージを多数のデバイスがパブリッシュする場合などです。共用サブスクリプションのロード・バランシング機能を活用すると効果がある可能性があります。IoT Platform の共用サブスクリプションのサポートは、非永続サブスクリプションのみに限定されます。
pt_br: O serviço do IoT Platform amplia a especificação do MQTT 3.1.1 para fornecer suporte para assinaturas compartilhadas. A assinatura compartilhada pode fornecer uma funcionalidade simples de balanceamento de carga para aplicativos. Pode ser necessário usar uma assinatura compartilhada caso um aplicativo corporativo de backend não possa acompanhar o número de mensagens que estão sendo publicadas para um espaço de tópico específico. Por exemplo, se vários dispositivos estiverem publicando mensagens que estão sendo processadas por um único aplicativo. Pode ser útil utilizar o recurso de balanceamento de carga de uma assinatura compartilhada. O suporte de assinatura compartilhada do IoT Platform é limitado apenas a assinaturas não duráveis.
zh_tw: IoT Platform 服務會擴充 MQTT 3.1.1 規格，以支援共用訂閱。共用訂閱可為應用程式提供簡單的負載平衡功能。如果後端企業應用程式無法跟上要發佈至特定主題空間的訊息數，則可能需要共用訂閱。例如，如果有多個裝置發佈的訊息都是由單一應用程式所處理。運用共用訂閱的負載平衡功能，可能會有所幫助。IoT Platform 共用訂閱支援僅限於不可延續的訂閱。

source: A simple example of an auto-scaling application:
ja: 自動スケーリング・アプリケーションの簡単な例:
pt_br: Um exemplo simples de um aplicativo de ajuste automático de escala:
zh_tw: 自動調整大小應用程式的簡單範例：

source: client 1 connects as A:abc123:myApplication and subscribes to all device events client 1 will receive 100% of the device events published
ja: クライアント 1 が A:abc123:myApplication として接続し、すべてのデバイス・イベントをサブスクライブしている。クライアント 1 はパブリッシュされたデバイス・イベントを 100% 受け取っている
pt_br: O cliente 1 se conecta como A:abc123:myApplication e assina todos os eventos do dispositivo; o cliente 1 receberá 100% dos eventos de dispositivo publicados
zh_tw: 用戶端 1 以 A:abc123:myApplication 連接並訂閱所有裝置事件，用戶端 1 會收到 100% 發佈的裝置事件

source: client 2 connects as A:abc123:myApplication and subscribes to all device events now, client 1 and client 2 will share all of the events published between them. that is the load is now shared between client 1 and client 2.
ja: クライアント 2 が A:abc123:myApplication として接続し、すべてのデバイス・イベントをサブスクライブするようになる。クライアント 1 およびクライアント 2 は、パブリッシュされたすべてのデバイス・イベントを 2 つのクライアント間で共有する。つまり、クライアント 1 とクライアント 2 の間で負荷が分散される。
pt_br: O cliente 2 se conecta como A:abc123:myApplication e assina todos os eventos do dispositivo; agora, o cliente 1 e o cliente 2 compartilharão entre si todos os eventos publicados. Esta é a carga que agora é compartilhada entre o cliente 1 e o cliente 2.
zh_tw: 用戶端 2 以 A:abc123:myApplication 連接且現在訂閱所有裝置事件，用戶端 1 與用戶端 2 將會共用在它們之間發佈的所有事件。也就是說，目前在用戶端 1 與用戶端 2 之間會共用負載。
