Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/concepts.po
Languages: de, it, ja, pt_br, zh_cn, zh_tw

source: **Applications** are able to process events from devices in real time. When an application receives an event it has visibility of the source of the event and the data contained in that event. Applications can be configured to subscribe to all events from all devices, a subset of events, a subset of devices or a combination of these events.
de: **Anwendungen** können Ereignisse von Geräten in Echtzeit verarbeiten. Wenn eine Anwendung ein Ereignis empfängt, verfügt sie über die Sichtbarkeit auf die Quelle des Ereignisses und auf die Daten, die in diesem Ereignis enthalten sind. Anwendungen können so konfiguriert werden, dass Sie alle Ereignisse von allen Geräte, von einer Teilmenge der Ereignisse, von einer Teilmenge der Geräte oder von einer Kombination dieser Ereignisse subskribieren.
it: Le **Applicazioni** sono in grado di elaborare gli eventi dai dispositivi in tempo reale. Quando un'applicazione riceve un evento, essa ha la visibilità dell'origine dell'evento e dei dati contenuti in tale evento. Le applicazioni possono essere configurate in modo da eseguire la sottoscrizione a tutti gli eventi provenienti da tutti i dispositivi, a un sottoinsieme di eventi, un sottoinsieme di dispositivi o una combinazione di questi eventi.
ja: **アプリケーション**は、リアルタイムでデバイスからのイベントを処理できます。アプリケーションがイベントを受け取ると、その可視性は、イベントの発信元およびそのイベントに含まれるデータのものになります。アプリケーションは、すべてのデバイスからのすべてのイベント、イベントのサブセット、デバイスのサブセット、またはそれらのイベントの組み合わせをサブスクライブするように構成可能です。
pt_br: **Applications** são capazes de processar eventos de dispositivos em tempo real. Quando um aplicativo recebe um evento, ele tem visibilidade da origem do evento e dos dados contidos nesse evento. Os aplicativos podem ser configurados para assinar todos os eventos de todos os dispositivos, um subconjunto de eventos, um subconjunto de dispositivos ou uma combinação desses eventos.
zh_cn: **应用程序** 可以实时处理来自设备的事件。应用程序收到事件时，它能够查看事件的源以及该事件中包含的数据。应用程序可以配置为预订来自所有设备的所有事件、部分事件、部分设备或这些事件的组合。
zh_tw: **應用程式** 可以即時處理來自裝置的事件。當應用程式接收事件時，它可以看到事件的來源和包含在該事件中的資料。應用程式可配置為訂閱來自所有裝置的所有事件、事件子集、裝置子集或這些事件的組合。

source: Historical Event Storage
de: Speichern historischer Ereignisse
it: Archiviazione degli eventi cronologici
ja: 履歴イベントの保管
pt_br: Armazenamento de Eventos Históricos
zh_cn: 历史事件存储
zh_tw: 歷程事件儲存

source: Historical event storage allows users to store the data from devices added to their Watson IoT platform organization. Historical event storage activity and duration can be controlled from the settings panel in the Watson IoT platform dashboard.
de: Das Speichern historischer Ereignisse ermöglicht es Benutzern, Daten von Geräten zu speichern, die zu ihrer Watson IoT Platform-Organisation hinzugefügt wurden. Die Speicheraktivität und -dauer für historische Ereignisse können über die Einstellungsanzeige im Watson IoT Platform-Dashboard gesteuert werden.
it: L'archiviazione degli eventi cronologici consente agli utenti di archiviare i dati dai dispositivi aggiunti all'organizzazione Watson IoT platform. L'attività e la durata dell'archiviazione degli eventi cronologici possono essere controllate dal pannello delle impostazioni nel dashboard di Watson IoT platform.
ja: 履歴イベントの保管の機能を使用して、Watson IoT Platform の組織に追加されたデバイスから送られてくるデータを格納できます。履歴イベントの保管のアクティビティーと期間は、Watson IoT Platform のダッシュボードにある設定パネルから制御できます。
pt_br: O armazenamento de eventos históricos permite que usuários armazenem dados de dispositivos incluídos em sua organização da plataforma do Watson IoT. A atividade e duração do armazenamento de eventos históricos podem ser controladas a partir do painel de configurações no painel da plataforma Watson IoT.
zh_cn: 历史事件存储允许用户从添加到其 Watson IoT Platform 组织的设备存储数据。可以从 Watson IoT Platform 仪表板中的设置面板控制历史事件存储活动和持续时间。
zh_tw: 歷程事件儲存可讓使用者從新增至其 Watson IoT Platform 組織的裝置中儲存資料。歷程事件儲存活動和期間可從 Watson IoT Platform 儀表板中的設定畫面來控制。

source: When changing settings for historical data storage, keep in mind that storing data for longer periods of time will affect your billing. Also, care should be taken when disabling historical data storage, as upon disabling data storage for your organization, all stored data will be deleted, and cannot be recovered.
de: Beim Ändern der Einstellungen für das Speichern historischer Daten ist zu beachten, dass sich das Speichern von Daten über längere Zeiträume auf die Abrechnung auswirkt. Gehen Sie beim Inaktivieren des Speicherns historischer Daten mit Vorsicht vor, da beim Inaktivieren der Datenspeicherung für Ihre Organisation alle gespeicherten Daten gelöscht werden und nicht wiederhergestellt werden können.
it: Quando si modificano le impostazioni per l'archiviazione dei dati storici, tener presente che l'archiviazione dei dati per lunghi periodi influirà sulla fatturazione. Inoltre, si dovrebbe essere cauti nel disabilitare l'archiviazione dei dati storici in quanto la disabilitazione dell'archiviazione dei dati relativi all'organizzazione, causa l'eliminazione di tutti i dati archiviati e non sarà possibile ripristinarli.
ja: 履歴データの保管に関する設定を変更する場合は、データ保管期間を長くすると請求額に影響があることに注意してください。履歴データの保管を無効にする場合も、組織のデータ保管を無効にすると、保管されていたすべてのデータが削除され、復旧できなくなることに注意してください。
pt_br: Ao mudar configurações para armazenamento de dados históricos, tenha em mente que armazenar dados por longos períodos de tempo afetará seu faturamento. Além disso, tome cuidado ao desativar o armazenamento de dados históricos, pois mediante a desativação do armazenamento de dados de sua organização, todos os dados armazenados serão excluídos e não poderão ser recuperados.
zh_cn: 更改历史数据存储的设置时，请记住，将数据存储更长时间将会影响您的记帐。此外，禁用历史数据存储时应慎重，因为在为组织禁用数据存储时，所有已存储的数据都将删除且无法恢复。
zh_tw: 變更歷程資料儲存的設定時請留意，長時間儲存資料將會影響到您的計費。此外，停用歷程資料儲存時則須注意，一旦為您的組織停用資料儲存，所有已儲存的資料都將予以刪除，且無法回復。

source: Historical event storage uses an MQTT Quality of Service level of 0 (delivery at most once), so some data may be lost.
de: Beim Speichern historischer Ereignisse wird die MQTT-Servicequalitätsstufe 0 (höchstens eine Zustellung) verwendet, sodass einige Daten verloren gehen können.
pt_br: O armazenamento de eventos históricos utiliza um nível de qualidade de serviço MQTT de 0 (entrega no máximo uma vez), portanto alguns dados podem ser perdidos.
zh_cn: 历史事件存储使用 MQTT 服务质量级别 0（最多交付一次），因此可能会丢失某些数据。
zh_tw: 歷程事件儲存會使用 MQTT 服務品質等級 0（最多傳遞一次），因此部分資料可能會遺失。

source: Commands
de: Befehle
it: Comandi
ja: コマンド
pt_br: Comandos
zh_cn: 命令
zh_tw: 指令

source: **Commands** are the mechanism by which **applications** can communicate with **devices**. Only applications can send commands, which must be issued to specific devices.
de: **Befehle** sind der Mechanismus mit dem **Anwendungen** mit **Geräte** kommunizieren können. Nur Anwendungen können Befehle senden, die an bestimmte Geräte ausgegeben werden müssen.
it: I **Comandi** sono il meccanismo tramite cui le **applicazioni** possono comunicare con i **dispositivi**. Solo le applicazioni possono inviare i comandi, che devono essere emessi a dispositivi specifici.
ja: **コマンド** は、**アプリケーション** が **デバイス** と通信する手段となるメカニズムです。コマンドを送信できるのはアプリケーションのみであり、特定のデバイスに対して発行しなければなりません。
pt_br: **Commands** são o mecanismo pelo qual os **applications** podem se comunicar com **devices**. Apenas os aplicativos podem enviar comandos, que devem ser emitidos para dispositivos específicos.
zh_cn: **命令** 是 **应用程序** 可用于与 **设备** 进行通信的机制。仅应用程序可发送命令，命令必须向特定设备发出。
zh_tw: **指令** 是 **應用程式** 可藉以與 **裝置** 進行通訊的機制。只有應用程式可傳送必須對特定裝置發出的指令。

source: The device must determine which action to take on receipt of any given command, and even controls which commands it will subscribe to in the first place. It is possible to design your device to listen for any command, or to simply subscribe to a set of specific commands.
de: Das Gerät muss bestimmen, welche Aktion bei Empfang eines bestimmten Befehls durchgeführt werden soll; das Gerät bestimmt auch, welche Befehle es zunächst einmal subskribiert. Es ist möglich, dass Sie Ihr Gerät so gestalten, dass es für jeden Befehl empfangsbereit ist; Sie können auch festlegen, dass das Gerät einfach nur eine Gruppe bestimmter Befehle subskribiert.
it: Il dispositivo deve determinare l'azione da intraprendere alla ricezione di ogni comando e controlla anche a quali comandi eseguirà la sottoscrizione. È possibile progettare il dispositivo in modo che sia in ascolto di tutti i comandi oppure semplicemente per eseguire la sottoscrizione un insieme di comandi specifico.
ja: デバイスは、特定のコマンドを受信した場合にどんなアクションを取るかを決定しなければならず、さらには、最初にどのコマンドをサブスクライブするかも制御します。デバイスは、コマンドを listen するように設計したり、単に特定のコマンドのセットをサブスクライブするように設計したりできます。
pt_br: O dispositivo deve determinar qual ação executar no recebimento de qualquer comando fornecido e também controla quais comandos assinará em primeiro lugar. É possível projetar seu dispositivo para atender a qualquer comando ou simplesmente assinar um conjunto de comandos específicos.
zh_cn: 设备必须确定在收到任何给定命令时要采取的操作，甚至控制首先它要预订哪些命令。可以将设备设计为侦听任何命令，或仅预订一组特定命令。
zh_tw: 裝置必須決定在接收到任何給定的指令時要採取的動作，甚至控制它將率先訂閱哪些指令。可以設計裝置來接聽任何指令，或只訂閱一組特定指令。

source: Historical event storage uses an MQTT Quality of Service level of 0 (delivery at most once), so some data may be lost. Please note that only messages of up to 4096 bytes are stored.
it: L'archiviazione degli eventi cronologici utilizza un livello di QoS (Quality of Service) MQTT pari a 0 (consegna al massimo una volta), pertanto alcuni dati potrebbero andare perduti. Notare che vengono memorizzati solo messaggi di dimensione massima pari a 4096 byte.
ja: 履歴イベントの保管では、MQTT サービス品質のレベル 0 (最大で 1 回配信) を使用するため、一部のデータが失われることがあります。最大 4096 バイトのメッセージのみが保管されることに注意してください。
