Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/concepts.po
Languages: de, it, ja, pt_br, zh_cn, zh_tw

source: Concepts
de: Konzepte
it: Concetti
ja: 概念
pt_br: Conceitos
zh_cn: 概念
zh_tw: 概念

source: Organizations
de: Organisationen
it: Organizzazioni
ja: 組織
pt_br: Organizações
zh_cn: 组织
zh_tw: 組織

source: When you register with the Watson IoT platform you are given an organization ID, this is a unique 6 character identifier for your account.
de: Wenn Sie sich bei Watson IoT Platform registrieren, erhalten Sie eine Organisations-ID. Dies ist eine eindeutige, 6 Zeichen lange Kennung für Ihr Konto.
it: Quando si effettua la registrazione a Watson IoT platform viene fornito un ID organizzazione, questo è un identificativo univoco di 6 caratteri per l'account.
ja: Watson IoT プラットフォームに登録すると、組織 ID を受け取ります。これは、そのアカウントに対応する 6 文字の固有 ID です。
pt_br: Ao registrar com a plataforma Watson IoT, você recebe um ID da organização, este é um identificador exclusivo de 6 caracteres para sua conta.
zh_cn: 向 Watson IoT Platform 注册时，将为您提供组织标识，这是您帐户的包含 6 个字符的唯一标识。
zh_tw: 當您在 Watson IoT Platform 中登錄時，會獲得一個組織 ID，這是您帳戶的唯一 6 個字元 ID。

source: **Organizations** ensure your data is only accessible from your devices and applications. Once registered, devices and API keys are bound to a single organization. When an application connects to the service using an API key it registers with the organization that "owns" the API key.
de: Mit **Organisationen** wird sichergestellt, dass auf Ihre Daten nur von Ihren Geräte und Anwendungen aus zugegriffen werden kann. Einmal registriert sind Geräte und API-Schlüssel an eine einzige Organisation gebunden. Wenn eine Anwendung die Verbindung zum Service unter Verwendung eines API-Schlüssels herstellt, registriert sie sich bei der Organisation, die diesen API-Schlüssel "besitzt".
it: Le **Organizzazioni** assicurano che i propri dati siano accessibili solo dai propri dispositivi e applicazioni. Una volta registrati, i dispositivi e le chiavi API sono collegati ad una singola organizzazione. Quando un'applicazione si connette al servizio utilizzando una chiave API essa si registra con l'organizzazione che "possiede" la chiave API.
ja: **組織**の部分は、そのデータにアクセスできるのが自分のデバイスおよびアプリケーションからのみであることを保証します。登録後、デバイスと API キーは単一の組織に結び付けられます。アプリケーションが API キーを使用してサービスに接続すると、API キーの「所有者」である組織に登録されることになります。
pt_br: **Organizations** assegura que seus dados sejam acessíveis apenas de seus dispositivos e aplicativos. Depois de registrados, os dispositivos e chaves API são ligados a uma única organização. Quando um aplicativo se conecta ao serviço usando uma chave API, ele é registrado com a organização que "possui" a chave API.
zh_cn: **组织** 确保仅可从设备和应用程序访问您的数据。注册后，设备和 API 密钥绑定到单个组织。应用程序使用 API 密钥连接到设备时，它会向拥有该 API 密钥的组织注册。
zh_tw: **組織** 確保您的資料只能透過裝置和應用程式進行存取。登錄之後，裝置和 API 金鑰會連結到單一組織。當應用程式使用 API 金鑰連接到服務時，它會在「擁有」API 金鑰的組織中登錄。

source: For your security it is impossible for cross-organization communication within the Watson IoT platform eco-system, intentional or otherwise. The only way to transmit data between two organizations it to explicitly create two applications, one within each organization, that communicate with each other to act as a relay between the organizations.
de: Zu Ihrer Sicherheit ist eine organisationsübergreifende Kommunikation im Watson IoT Platform-Ökosystem nicht möglich - sei es nun beabsichtigt oder unbeabsichtigt. Die einzige Möglichkeit der Übertragung von Daten zwischen zwei Organisationen besteht darin, explizit zwei Anwendungen zu erstellen, die miteinander kommunizieren und so als 'Relais' zwischen den Organisationen fungieren.
it: Per motivi di sicurezza non è possibile la comunicazione né intenzionale, né in alcun altro modo tra organizzazioni nell'ambito dell'ecosistema Watson IoT platform. L'unico modo per trasmettere i dati tra due organizzazioni consiste nel creare esplicitamente due applicazioni, una all'interno di ciascuna organizzazione, che comunicano tra loro per agire come un collegamento tra le organizzazioni.
ja: セキュリティーのため、Watson IoT Platform エコシステムでは、意図的かどうかにかかわらず、組織を超えた通信はできないようになっています。2 つの組織の間でデータを送信する唯一の方法は、各組織に 1 つずつ、合計 2 つのアプリケーションを明示的に作成して、それらが相互に通信して組織間のリレーとして動作するようにすることです。
pt_br: Para sua segurança, é impossível a comunicação na organização dentro do ecossistema da plataforma Watson IoT, intencional ou de outra forma. A única maneira de transmitir dados entre duas organizações é criar explicitamente dois aplicativos, um dentro de cada organização, que se comunicam um com o outro para agir como uma retransmissão entre as organizações.
zh_cn: 出于安全考虑，无法在 Watson IoT Platform 生态系统中进行跨组织通信，不管是有意还是无意。在两个组织之间传输数据的唯一方法是显式创建两个相互通信的应用程序（每个组织内一个），以充当组织之间的中继设备。
zh_tw: 基於安全理由，不論是有意或無意，要在 Watson IoT Platform 生態系統內進行跨組織通訊是行不通的。在兩個組織之間傳輸資料的唯一方式，是明確建立兩個應用程式（每一個組織內各一個）來彼此進行通訊，以扮演組織之間的中繼角色。

source: Devices
de: Geräte
it: Dispositivi
ja: デバイス
pt_br: Dispositivos
zh_cn: 设备
zh_tw: 裝置

source: A device can be anything that has a connection to the internet and has data it wants to get into the cloud.
de: Ein Gerät kann jedes Gerät sein, das eine Verbindung zum Internet hat, und über Daten verfügt, die in die Cloud gestellt werden sollen.
it: Un dispositivo può essere qualsiasi strumento che disponga di una connessione a internet e che contenga dati che si desidera collocare nel cloud.
ja: インターネットに接続されていて、クラウドにデータを入れる源となるどんなものでもデバイスにできます。
pt_br: Um dispositivo pode ser qualquer coisa que tenha uma conexão com a Internet e que tenha dados que ele queira colocar na nuvem.
zh_cn: 设备可以是连接到因特网并具有其希望放入云中的数据的任何对象。
zh_tw: 裝置可以是連線到網際網路且含有它想要放入雲端的資料的任何項目。

source: A device is not able to directly interact with other devices.
de: Ein Gerät ist nicht in der Lage, direkt mit anderen Geräten zu interagieren.
it: Un dispositivo non può interagire direttamente con altri dispositivi.
ja: デバイスは、他のデバイスと直接やり取りできません。
pt_br: Um dispositivo não é capaz de interagir diretamente com outros dispositivos.
zh_cn: 一个设备无法直接与其他设备交互。
zh_tw: 裝置無法直接與其他裝置互動。

source: Devices are able to accept commands from applications.
de: Geräte sind in der Lage, Befehle von anderen Anwendungen zu akzeptieren.
it: I dispositivi sono in grado di accettare i comandi dalle applicazioni.
ja: デバイスは、アプリケーションからコマンドを受け入れることが可能です。
pt_br: Os dispositivos são capazes de aceitar comandos de aplicativos.
zh_cn: 设备无法接受来自应用程序的命令。
zh_tw: 裝置可接受來自應用程式的指令。

source: Devices uniquely identify themselves to the Watson IoT platform with an authentication token that will only be accepted for that device.
de: Geräte identifizieren sich bei Watson IoT Platform eindeutig durch ein Authentifizierungstoken, das nur für das jeweilige Gerät akzeptiert wird.
it: I dispositivi si identificano autonomamente, in modo univoco rispetto a Watson IoT Platform utilizzando un token di autenticazione che verrà accettato solo per tale dispositivo.
ja: Watson IoT プラットフォームに対し、デバイスは、そのデバイスとしてのみ受け入れられる認証トークンにより一意的に識別されます。
pt_br: Os dispositivos identificam unicamente a si mesmos para a plataforma Watson IoT com um token de autenticação que será aceito apenas para esse dispositivo.
zh_cn: 设备将使用仅针对该设备而言会接受的认证令牌向 Watson IoT Platform 唯一表明自身身份。
zh_tw: 裝置可利用只有該裝置才接受的鑑別記號，在 Watson IoT Platform 中唯一地識別自己。

source: Devices must be registered before they can connect to the Watson IoT platform.
de: Geräte müssen registriert werden, bevor sie die Verbindung zu Watson IoT Platform herstellen können.
it: I dispositivi devono essere registrati prima di potersi connettere a Watson IoT Platform.
ja: デバイスを Watson IoT プラットフォームに接続するには、まず登録する必要があります。
pt_br: Os dispositivos devem ser registrados antes que possam se conectar à plataforma Watson IoT.
zh_cn: 设备必须先进行注册，然后才能连接到 Watson IoT Platform。
zh_tw: 必須先登錄裝置，這些裝置才能連接到 Watson IoT Platform。

source: Managed and Unmanaged Devices
de: Verwaltete und nicht verwaltete Geräte
it: Dispositivi gestiti e non gestiti
ja: 管理対象デバイスと非管理対象デバイス
pt_br: Dispositivos Gerenciados e Não Gerenciados
zh_cn: 受管设备和非受管设备
zh_tw: 受管理與未受管理的裝置

source: **Managed devices** are defined as devices which contain a management agent. A management agent is a set of logic which allows the device to interact with the Watson IoT platform Device Management service via the Device Management protocol. Managed devices can perform device management operations including location updates, firmware download and updates, and reboot and factory reset.
de: **Verwaltete Geräte** sind Geräte, die einen Managementagent enthalten. Ein Managementagent ist eine Logikeinheit, die es dem Gerät ermöglicht, mit dem Gerätemanagementservice von Watson IoT Platform über das Gerätemanagementprotokoll zu interagieren. Verwaltete Geräte können Gerätemanagementoperationen (einschließlich Positions-Updates, Firmware-Downloads und -Updates und Reboots sowie Factory-Resets) ausführen.
it: I **Dispositivi gestiti** sono definiti come dispositivi che contengono un agent di gestione. Un agent di gestione è un insieme logico che consente al dispositivo di interagire con il servizio di gestione dispositivo Watson IoT Platform mediante il protocollo di gestione dispositivo. I dispositivi gestiti possono eseguire operazioni di gestione dispositivo, tra le quali aggiornamenti dell'ubicazione, scaricamenti e aggiornamenti del firmware, riavvii e reimpostazioni alle impostazioni di fabbrica.
ja: **管理対象デバイス**とは、管理エージェントを持つデバイスのことです。管理エージェントは、デバイスがデバイス管理プロトコルによって Watson IoT Platform デバイス管理サービスと対話するためのロジックのセットです。管理対象デバイスは、場所の更新、ファームウェアのダウンロードと更新、リブート、工場出荷時設定へのリセットなどのデバイス管理操作を実行することができます。
pt_br: **Dispositivos gerenciados** são definidos como dispositivos que contêm um agente de gerenciamento. Um agente de gerenciamento é um conjunto de lógicas que permite que o dispositivo interaja com o serviço de Gerenciamento de Dispositivo da plataforma Watson IoT por meio do protocolo de Gerenciamento de Dispositivos. Os dispositivos gerenciados podem executar operações de gerenciamento de dispositivos, incluindo atualizações de local, download e atualizações de firmware e reinicialização e reconfiguração de fábrica.
zh_cn: **受管设备**定义为包含管理代理程序的设备。管理代理程序是一组逻辑，允许设备通过“设备管理”协议与“Watson IoT Platform 设备管理”服务进行交互。受管设备可以执行诸多设备管理操作，包括位置更新、固件下载和更新以及重新引导和恢复出厂设置。
zh_tw: **受管理裝置** 定義為內含管理代理程式的裝置。管理代理程式是一組邏輯，可讓裝置透過「裝置管理」通訊協定，與「Watson IoT Platform 裝置管理」服務互動。受管理裝置可執行裝置管理作業，包括位置更新、韌體下載及更新，及重新開機和重設為原廠設定。

source: An **unmanaged device** is a device without a management agent. An unmanaged device can still connect to the Watson IoT platform and send and receive events and commands. However, it cannot send any device management requests, or perform any of the device management operations.
de: Ein **Nicht verwaltetes Gerät** ist ein Gerät, ohne einen Managementagenten. Ein nicht verwaltetes Gerät kann trotzdem die Verbindung zu Watson IoT Platform herstellen, um Ereignisse und Befehle zu senden und zu empfangen. Ein nicht verwaltetes Gerät kann jedoch keine Gerätemanagementanforderungen senden, oder Gerätemanagementoperationen ausführen.
it: Un **dispositivo non gestito** è un dispositivo senza un agent di gestione. Un dispositivo non gestito può ancora connettersi a Watson IoT platform e inviare e ricevere eventi e comandi. Tuttavia, non è può inviare richieste di gestione dispositivo, o eseguire operazioni di gestione dispositivo.
ja: **非管理対象デバイス**とは、管理エージェントを持たないデバイスのことです。非管理対象デバイスでも、Watson IoT Platform に接続してイベントやコマンドを送受信できます。ただし、デバイス管理リクエストを送信したり、デバイス管理操作を実行したりすることはできません。
pt_br: Um **dispositivo não gerenciado** é um dispositivo que não tem um agente de gerenciamento. Um dispositivo não gerenciado ainda pode se conectar à plataforma Watson IoT e enviar e receber eventos e comandos. No entanto, ele não pode enviar solicitações de gerenciamento de dispositivos ou executar qualquer uma das operações de gerenciamento de dispositivos.
zh_cn: **非受管设备**是不包含管理代理程序的设备。非受管设备仍然可以连接到 Watson IoT Platform 并且发送和接收事件和命令。但是，它无法发送任何设备管理请求，也无法执行任何设备管理操作。
zh_tw: **未受管理裝置** 是不具有管理代理程式的裝置。未受管理裝置仍可連接至 Watson IoT Platform，並傳送及接收事件和指令。但是，不能傳送任何裝置管理要求，或執行任何裝置管理作業。

source: Applications
de: Anwendungen
it: Applicazioni
ja: アプリケーション
pt_br: Aplicativos
zh_cn: 应用程序
zh_tw: 應用程式

source: An application is anything that has a connection to the internet and wants to interact with data from devices and/or control the behaviour of those devices in some manner.
de: Eine Anwendung kann alles sein, das eine Verbindung zum Internet hat und mit Daten von Geräten interagieren will und/oder das Verhalten dieser Geräte in einer bestimmten Art und Weise steuern will.
it: Un'applicazione è qualsiasi strumento che disponga di una connessione a Internet e vuole interagire con i dati dai dispositivi e/o controllare il funzionamento dei dispositivi in qualche maniera.
ja: アプリケーションは、インターネットに接続されていて、デバイスとデータをやり取りしたり、何らかの方法でデバイスの動作を制御したりするなんらかのものです。
pt_br: Um aplicativo é qualquer coisa que tenha uma conexão com a Internet e que queira interagir com dados de dispositivos e/ou controlar o comportamento desses dispositivos de alguma maneira.
zh_cn: 应用程序是连接到因特网，并且希望与来自设备的数据进行交互和/或以某种方式控制这些设备的行为的任何对象。
zh_tw: 應用程式是連線到網際網路且要與來自裝置的資料進行互動，及/或以某種方式控制那些裝置行為的任何項目。

source: Applications identify themselves to the Watson IoT platform with an API key and a unique application ID.
de: Anwendungen identifizieren sich bei Watson IoT Platform durch einen API-Schlüssel und eine eindeutige Anwendungs-ID.
it: Le applicazioni si identificano autonomamente rispetto a Watson IoT platform utilizzando una chiave API ed un ID applicazione univoco.
ja: Watson IoT プラットフォームに対して、アプリケーションは、API キーと固有のアプリケーション ID により識別されます。
pt_br: Os aplicativos se identificam para a plataforma Watson IoT com uma chave de API e um ID de aplicativo exclusivo.
zh_cn: 应用程序使用 API 密钥和唯一应用程序标识向 Watson IoT Platform 表明自身身份。
zh_tw: 應用程式可利用 API 金鑰和唯一的應用程式 ID，在 Watson IoT Platform 中識別自己。

source: Applications do not need to be registered before they can connect to the Watson IoT platform, however they must present a valid API key that has previously been registered.
de: Anwendungen müssen nicht registriert werden, bevor sie die Verbindung zu Watson IoT Platform herstellen können; sie müssen jedoch einen gültigen API-Schlüssel vorlegen, der zuvor registriert wurde.
it: Non è necessario registrare le applicazioni prima che queste possano connettersi a Watson IoT platform, tuttavia, devono presentare una chiave API valida registrata in precedenza.
ja: アプリケーションが Watson IoT プラットフォームに接続するために登録は必要はありませんが、事前に登録されている有効な API キーを提示する必要があります。
pt_br: Aplicativos não precisam ser registrados antes de poderem se conectar à plataforma Watson IoT, no entanto, eles devem apresentar uma chave de API válida que tenha sido registrada anteriormente.
zh_cn: 应用程序无需注册即可连接到 Watson IoT Platform 但其必须提供先前已注册的有效 API 密钥。
zh_tw: 應用程式不需要先登錄就可以連接到 Watson IoT Platform，不過，它們必須提出先前已登錄過的有效 API 金鑰。

source: Gateway Devices
de: Gateway-Geräte
it: Dispositivi gateway
ja: ゲートウェイ・デバイス
pt_br: Dispositivos de Gateway
zh_cn: 网关设备
zh_tw: 閘道裝置

source: Gateway support is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
de: Die Gateway-Unterstützung ist momentan als Teil einer begrenzten Betaversion verfügbar. Künftige Aktualisierungen können Änderungen enthalten, die möglicherweise nicht mit der aktuellen Version dieser Funktion kompatibel sind. Testen Sie die Funktion und senden Sie uns Ihren Erfahrungsbericht (siehe `Let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_).
pt_br: O suporte ao gateway está disponível atualmente como parte de uma versão beta limitada. Atualizações futuras poderão incluir mudanças incompatíveis com a versão atual deste recurso. Experimente e nos dê sua opinião <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
zh_cn: 网关支持当前可用作受限测试版的一部分。功能部件更新可能包括与此功能部件的当前版本不兼容的更改。请试用并 `告知我们您的意见 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
zh_tw: 受限測試版目前提供閘道支援。未來更新可能包括與此功能的現行版本不相容的變更。請試用它，並 `讓我們知道您的想法 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_

source: Gateways are a specialized class of Device. They have the combined capabilities of an Application and a Device allowing them to serve as access points providing connectivity to the service for other devices without the ability to directly connect.
de: Gateways sind eine spezialisierte Geräteklasse. Sie verfügen über die kombinierten Leistungsmerkmale einer Anwendung und eines Geräts, d. h. sie können als Zugriffspunkte fungieren und Konnektivität zu dem Service für andere Geräte bereitstellen, die keine direkte Verbindung herstellen können.
it: I gateway costituiscono una classe specializzata di dispositivi. Presentano le funzionalità combinate di un'applicazione e di un dispositivo e fungono da punti di accesso che consentono la connettività al servizio di altri dispositivi che non hanno la possibilità di connettersi direttamente.
ja: ゲートウェイは、特殊なクラスのデバイスです。アプリケーションとデバイスの機能を組み合わせて、直接接続できない他のデバイスのためにサービスへの接続を提供するアクセス・ポイントとして機能します。
pt_br: Os gateways são uma classe especializada de Dispositivo. Eles têm os recursos combinados de um Aplicativo e um Dispositivo, permitindo que eles sirvam como pontos de acesso, fornecendo conectividade ao serviço para outros dispositivos sem a capacidade para conectar-se diretamente.
zh_cn: 网关是设备的专用类。它们兼具应用程序和设备的功能，使其能够充当访问点，为无法直接连接的其他设备提供与服务的连接。
zh_tw: 閘道是特殊化的「裝置」類別。它們結合了「應用程式」和「裝置」的功能，可讓它們當作存取點，為沒有直接連接能力的其他裝置提供服務的連線功能。

source: Gateway devices can register new devices and can send and receive data on behalf of devices connected to them.
de: Gateway-Geräte können neue Geräte registrieren sowie Daten im Namen von Geräten senden und empfangen, die mit den Gateway-Geräten verbunden sind.
it: I dispositivi gateway possono registrare nuovi dispositivi e possono inviare e ricevere dati per conto di dispositivi ad essi connessi.
ja: ゲートウェイ・デバイスは、新しいデバイスを登録したり、接続しているデバイスの代わりにデータを送受信したりできます。
pt_br: Dispositivos de gateway podem registrar novos dispositivos e podem enviar e receber dados em nome de dispositivos conectados a eles.
zh_cn: 网关设备可以注册新设备，并可代表与其连接的设备发送和接收数据。
zh_tw: 閘道裝置可以登錄新裝置，也可以代表連接至它們的裝置傳送和接收資料。

source: Gateway Devices must be registered before they can connect to the service
de: Gateway-Geräte müssen registriert werden, bevor sie die Verbindung zu dem Service herstellen können.
it: I dispositivi gateway devono essere registrati prima di connettersi al servizio
ja: ゲートウェイ・デバイスをサービスに接続するには、まずゲートウェイ・デバイスを登録する必要があります。
pt_br: Dispositivos de Gateway devem ser registrados antes que possam se conectar ao serviço
zh_cn: 网关设备必须先进行注册，然后才能连接到服务
zh_tw: 「閘道裝置」必須先登錄，然後才能連接至服務

source: Events
de: Ereignisse
it: Eventi
ja: イベント
pt_br: Eventos
zh_cn: 事件
zh_tw: 事件

source: Events are the mechanism by which **devices** publish data to the Watson IoT platform. The device controls the content of the event and assigns a name for each event it sends.
de: Ereignisse sind der Mechanismus, mit dem **Geräte** Daten in Watson IoT Platform publizieren. Das Gerät steuert den Inhalt des Ereignisses und ordnet einen Namen für jedes vom Gerät gesendete Ereignis zu.
it: Gli eventi sono il meccanismo tramite cui i **dispositivi** pubblicano i dati su Watson IoT platform. Il dispositivo controlla il contenuto dell'evento e assegna un nome per ogni evento inviato.
ja: イベントは、**デバイス**が Watson IoT Platform にデータをパブリッシュするためのメカニズムです。デバイスはイベントのコンテンツを制御し、送信するイベントごとに名前を割り当てます。
pt_br: Eventos são o mecanismo pelo qual **dispositivos** publicam dados na plataforma Watson IoT. O dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.
zh_cn: 事件是 **设备** 将数据发布到 Watson IoT Platform 所采用的机制。设备控制事件的内容，并为其发送的每个事件分配名称。
zh_tw: 事件是 **裝置** 藉以將資料發佈到 Watson IoT Platform 的機制。裝置可控制事件的內容，並為它傳送的每一個事件指派一個名稱。

source: When an event is received by the Watson IoT platform from a device the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
de: Wenn ein Ereignis von Watson IoT Platform empfangen wird, werden die Identifikationsdaten der Verbindung, über die das Ereignis empfangen wurde, dazu verwendet, das Gerät zu ermitteln, von dem das Ereignis gesendet wurde. Mit dieser Architektur ist es für ein Gerät unmöglich, die Identität eines anderen Geräts anzunehmen.
it: Quando Watson IoT platform riceve un evento da un dispositivo, vengono utilizzate le credenziali della connessione su cui si è ricevuto l'evento al fine di determinare da quale dispositivo è stato inviato l'evento. Con questa architettura è impossibile per un dispositivo impersonare un altro dispositivo.
ja: Watson IoT Platform は、デバイスからイベントを受け取ると、そのイベントを受け取った接続の資格情報に基づいて、イベントの送信元のデバイスを特定します。このアーキテクチャーにより、デバイスは別のデバイスの偽名を使用することが不可能になります。
pt_br: Quando um evento é recebido pela plataforma Watson IoT a partir de um dispositivo, as credenciais da conexão na qual o evento foi recebido são usadas para determinar a partir de qual dispositivo o evento foi enviado. Com essa arquitetura, é impossível para um dispositivo personificar outro dispositivo.
zh_cn: Watson IoT Platform 接收到事件时，将使用用于接收该事件的连接的凭证来确定从哪个设备发送了该事件。由于使用这种体系结构，设备将无法模拟其他设备。
zh_tw: 當 Watson IoT Platform 接收事件時，會使用接收事件的連線認證來判斷是哪個裝置傳送了事件。使用此架構，裝置就不可能假冒成另一個裝置。

source: **Devices** are unable to receive events, regardless of whether they are its own events or those of another device.
de: **Geräte** können keine Ereignisse empfangen, unabhängig davon, ob es sich um Ereignisse des selben Geräts oder um die Ereignisse von anderen Geräten handelt.
it: I **Dispositivi** sono in grado di ricevere gli eventi, indipendentemente dal fatto che siano i propri eventi o quelli di un altro dispositivo.
ja: **デバイス**は、それ自体のイベントであれ、別のデバイスのものであれ、イベントを受信できません。
pt_br: **Devices** são incapazes de receber eventos, independentemente se eles são seus próprios eventos ou de outro dispositivo.
zh_cn: **设备** 无法接收事件，无论这些是其自己的事件还是其他设备的事件。
zh_tw: **裝置** 無法接收事件，不論它們是裝置本身的事件還是另一個裝置的事件。
