Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/api.po
Languages: de

source: HTTP API for Devices
de: HTTP-API für Geräte

source: This feature is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
de: Diese Funktion ist momentan als Teil einer begrenzten Betaversion verfügbar. Künftige Aktualisierungen können Änderungen enthalten, die möglicherweise nicht mit der aktuellen Version dieser Funktion kompatibel sind. Testen Sie die Funktion und senden Sie uns Ihren Erfahrungsbericht (siehe `Let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_).

source: Publish an event
de: Ereignis publizieren

source: As an alternative to MQTT it is possible for devices to submit events to the IoT Platform over an HTTP API. Devices may submit a ``POST`` request to: ``https://${orgid}.internetofthings.ibmcloud.com>/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
de: Als Alternative zu MQTT können Ereignisse über eine HTTP-API von Geräten an IoT Platform übergeben werden. Geräte können eine Anforderung ``POST`` an die folgende Adresse übergeben: ``https://${orgid}.internetofthings.ibmcloud.com>/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``.

source: For full details, see the relevant `API documentation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. The request body (event payload) can have any content, however, MQTT message payload guidelines should be followed.
de: Ausführliche Details hierzu finden Sie in der entsprechenden `API-Dokumentation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. Der Anforderungshauptteil (Ereignisnutzdaten) kann einen beliebigen Inhalt aufweisen, es müssen jedoch die Richtlinien für MQTT-Nachrichtennutzdaten eingehalten werden.

source: When connecting a device or application to Quickstart you should use the following URL instead: ``http://quickstart.internetofthings.ibmcloud.com>/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
de: Beim Verbinden eines Geräts oder einer Anwendung mit Quickstart sollten Sie stattdessen die folgende URL verwenden: ``http://quickstart.internetofthings.ibmcloud.com>/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``.

source: HTTP messaging only covers the ability to submit device events currently. Device management and command control require MQTT connectivity in your device.
de: Die HTTP-Nachrichtenübertragung unterstützt derzeit nur das Übergeben von Geräteereignissen. Für das Gerätemanagement und die Befehlssteuerung ist MQTT-Konnektivität in Ihrem Gerät erforderlich.

source: Authentication
de: Authentifizierung

source: Requests must include an authorization header. Basic authentication the only method supported. Applications are authenticated by API keys, when an application makes any request to the IoT Platform API it must present an API as it's credentials:
de: Anforderungen müssen einen Berichtigungsheader enthalten. Die Basisauthentifizierung ist die einzige unterstützte Methode. Anwendungen werden durch API-Schlüssel authentifiziert. Wenn eine Anwendung eine Anforderung an die API von IoT Platform absetzt, muss sie als Berechtigungsnachweis einen API-Schlüssel vorlegen:

source: password = Authentication token
de: password = Authentifizierungstoken

source: Content-Type
de: Inhaltstyp

source: A ``Content-Type`` request header must be provided with the request. The following table shows the supported types and how they are mapped to the IoT Platform internal formats.
de: Ein Anforderungsheader ``Inhaltstyp`` muss mit der Anforderung angegebenen werden. Die folgende Tabelle zeigt die unterstützten Typen und ihre Zuordnung zu den internen Formaten von IoT Platform.

source: Content-Type Header
de: Inhaltstypheader

source: IoT Platform Format
de: Format in IoT Platform

source: Quality of Service
de: Servicequalität

source: The HTTP(S) protocol provides "at most once" best effort delivery, analagous to the QoS0 quality of service provided by the MQTT protocol. When using QoS0, or the HTTP(S) equivalent, to deliver event messages, the device or application must implement retry logic to guarantee delivery.
de: Das HTTP(S)-Protokoll bietet eine Best-Effort-Zustellung auf der "höchstens einmal"-Basis, analog zur Servicequalitätsstufe QoS0 des MQTT-Protokolls. Bei der Verwendung von QoS0 oder der HTTP(S)-Entsprechung für die Zustellung von Ereignisnachrichten muss das Gerät oder die Anwendung Wiederholungslogik implementieren, um die Zustellung zu garantieren.

source: For more information on the MQTT protocol and Quality of Service levels, please see `MQTT for the IoT Platform <../reference/mqtt/index.html>`__ documentation.
de: Weitere Informationen zum MQTT-Protokoll und zu den Servicequalitätsstufen (QoS-Stufen) finden Sie in der Dokumentation `MQTT für IoT Platform <../reference/mqtt/index.html>`__.
