Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/mqtt.po
Languages: pt_br, zh_cn, zh_tw

source: MQTT Connectivity for Devices
pt_br: Conectividade MQTT para Dispositivos
zh_cn: 设备的 MQTT 连接
zh_tw: 裝置的 MQTT 連線功能

source: Client connection
pt_br: Conexão do cliente
zh_cn: 客户机连接
zh_tw: 用戶端連線

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for devices in that organization.
pt_br: Cada organização registrada possui um terminal exclusivo que deve ser usado ao conectar clientes do MQTT para dispositivos nessa organização.
zh_cn: 每个已注册组织具有唯一端点，在连接该组织中设备的 MQTT 客户机时必须使用此端点。
zh_tw: 每一個已登錄的組織都有唯一的端點，當針對該組織中的裝置連接 MQTT 用戶端時必須使用此端點。

source: Unencrypted client connection
pt_br: Conexão do cliente não criptografada
zh_cn: 未加密客户机连接
zh_tw: 未加密的用戶端連線

source: Connect on port **1883**
pt_br: Conectar à porta **1883**
zh_cn: 在端口 **1883** 上连接
zh_tw: 在埠 **1883** 連接

source: All information your device submits is being sent in plain text (including the authentication credentials for your device). We recommend the use of an encrypted connection whenever possible.
pt_br: Todas as informações que seu dispositivo envia estão sendo enviadas em texto simples (incluindo as credenciais de autenticação para seu dispositivo). Recomendamos o uso de uma conexão criptografada sempre que possível.
zh_cn: 您的设备提交的所有信息都以明文形式发送（包括设备的认证凭证）。我们建议尽可能使用加密连接。
zh_tw: 裝置提交的所有資訊皆會以純文字傳送（包括裝置的鑑別認證）。我們建議盡可能使用加密連線。

source: Encrypted client connection
pt_br: Conexão do cliente criptografada
zh_cn: 加密客户机连接
zh_tw: 已加密的用戶端連線

source: Connect on port **8883** or **443** for websockets.
pt_br: Conectar à porta **8883** ou **443** para websockets.
zh_cn: 针对 Web 套接字，在端口 **8883** 或 **443** 上连接。
zh_tw: 針對 Websocket，在埠 **8883** 或 **443** 連接。

source: In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
pt_br: Em muitas bibliotecas de clientes, você precisará fornecer um certificado público do servidor no formato pem. O arquivo a seguir contém a sequência de certificados inteira para \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
zh_cn: 在许多客户机库中，您将需要以 pem 格式提供服务器的公用证书。以下文件包含 \*.messaging.internetofthings.ibmcloud.com: messaging.pem_ 的整个证书链
zh_tw: 在許多用戶端程式庫中，您需要以 pem 格式提供伺服器的公用憑證。下列檔案包含 \*.messaging.internetofthings.ibmcloud.com: messaging.pem_ 的整個憑證鏈

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
pt_br: Algumas bibliotecas do cliente SSL demonstraram não manipular domínios com caractere curinga; neste caso, se você não puder mudar as bibliotecas, será necessário desativar a verificação de certificados.
zh_cn: 经证实，一些 SSL 客户机库不会处理带通配符的域，在此情况下，如果无法更改库，那么您将需要关闭证书检查。
zh_tw: 部分 SSL 用戶端程式庫已表明不處理含萬用字元的網域，在該情況下，如果您無法變更程式庫，則需要關閉憑證檢查。

source: The IoT Platform requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
pt_br: O IoT Platform requer o TLS v1.2. Sugerimos os seguintes conjuntos de cifras: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 ou AES128-GCM-SHA256 *(a partir de 1 de junho de 2015)*.
zh_cn: IoT Platform 需要 TLS v1.2。我们建议使用以下密码套件：ECDHE-RSA-AES256-GCM-SHA384、AES256-GCM-SHA384、ECDHE-RSA-AES128-GCM-SHA256 或 AES128-GCM-SHA256 *（自 2015 年 6 月 1 日起）*。
zh_tw: IoT Platform 需要 TLS 1.2 版。我們建議使用下列密碼組合：ECDHE-RSA-AES256-GCM-SHA384、AES256-GCM-SHA384、ECDHE-RSA-AES128-GCM-SHA256 或 AES128-GCM-SHA256 *（從 2015 年 6 月 1 日開始）*。

source: **Device Support in Quickstart**
pt_br: **Suporte de Dispositivo no Quickstart**
zh_cn: **Quickstart 中的设备支持**
zh_tw: **Quickstart 中的裝置支援**

source: When connecting to the Quickstart service no authentication (or registration) is required, and ``orgId`` must be set to ``quickstart``
pt_br: Ao se conectar ao serviço Quickstart, nenhuma autenticação (ou registro) é necessária e ``orgId`` deve ser configurado como ``quickstart``
zh_cn: 连接到 Quickstart 服务时，不需要任何认证（或注册），并且“orgId”必须设置为“quickstart”
zh_tw: 連接至 Quickstart 服務時，不需要進行鑑別（或登錄），而且 ``orgId`` 必須設為 ``quickstart``

source: The Quickstart service does not currently support MQTT Quality of Service (QoS) levels greater than 0. This is the fastest and offers no confirmation of receipt. If you are writing device code for use with Quickstart you must also take into account the following features present in the registered service that are not supported in Quickstart:
pt_br: Atualmente, o serviço de Iniciação Rápida não suporta níveis de Qualidade de Serviço (QoS) do MQTT maiores que 0. Este é o modo mais rápido e não oferece confirmação de recebimento. Caso você esteja gravando o código de dispositivo para ser usado com a Iniciação Rápida, deverá considerar também os seguintes recursos presentes no serviço registrado e que não são suportados na Iniciação Rápida:
zh_cn: Quickstart 服务当前不支持高于 0 的 MQTT 服务质量 (QoS) 级别。这是最快的，且不提供确认回执。如果编写设备代码以与 Quickstart 配合使用，那么还必须考虑已注册服务中存在而在 Quickstart 中不支持的以下功能：
zh_tw: Quickstart 服務目前不支援大於 0 的「MQTT 服務品質 (QoS)」等級。這是最快的，不需要提供接收確認。如果要撰寫裝置程式碼以與 Quickstart 搭配使用，則也必須考量所登錄服務中提供但不受 Quickstart 支援的下列特性：

source: Subscribing to commands
pt_br: Assinando comandos
zh_cn: 预订命令
zh_tw: 訂閱指令

source: Device management protocol
pt_br: Protocolo de gerenciamento de dispositivo
zh_cn: 设备管理协议
zh_tw: 裝置管理通訊協定

source: Clean or durable sessions
pt_br: Sessões limpas ou duráveis
zh_cn: 清洁或可持续的会话
zh_tw: 清除或可延續階段作業

source: Also, messages sent from devices at a rate greater than 1 per second may be discarded.
pt_br: Além disso, as mensagens enviadas a partir de dispositivos em uma taxa maior que 1 por segundo podem ser descartadas.
zh_cn: 另外，可能会丢弃从设备发送的速率大于每秒 1 次的消息。
zh_tw: 此外，以大於每秒 1 個的速率從裝置傳送的訊息可能會被捨棄。

source: MQTT client identifier
pt_br: Identificador de cliente MQTT
zh_cn: MQTT 客户机标识
zh_tw: MQTT 用戶端 ID

source: A Device must authenticate using a client ID in the following format:
pt_br: Um Dispositivo deve autenticar usando um ID de cliente no seguinte formato:
zh_cn: 设备必须使用以下格式的客户机标识进行认证：
zh_tw: 裝置必須使用下列格式的用戶端 ID 進行鑑別：

source: **d** idenfities your client as a device
pt_br: **d** identifica seu cliente como um dispositivo
zh_cn: **d** 将客户机标识为设备
zh_tw: **d** 將用戶端識別為裝置

source: **org\_id** is your unique organization ID, assigned when you sign up with the service. It will be a 6 character alphanumeric string.
pt_br: **org\_id** é o ID exclusivo da organização, designado quando você se inscreve para o serviço. Ele será uma sequência alfanumérica de 6 caracteres.
zh_cn: **org\_id** 是在您注册服务时分配的唯一组织标识。它将是 6 字符字母数字字符串。
zh_tw: **org\_id** 是唯一組織 ID，當您註冊服務時會指派該 ID。它將會是一個 6 字元的英數字串。

source: **type\_id** is intended to be used as an identifier of the type of device connecting, it may be useful to think of this as analogous to a model number.
pt_br: **type\_id** é usado como um identificador do tipo de dispositivo, pode ser útil pensar nisso da mesma forma que um número de modelo.
zh_cn: **type\_id** 旨在用作进行连接的设备类型的标识，将其视为类似于型号可能会很有用。
zh_tw: **type\_id** 預期作為所要連接之裝置類型的 ID，將其視為類似於型號可能會有幫助。

source: **device\_id** must uniquely identify a device across all devices of a specific device\_type, it may be useful to think of this as analogous to a serial number.
pt_br: **device\_id** deve identificar exclusivamente um dispositivo em todos os dispositivos de um device\_type específico, pode ser útil pensar nisso da mesma forma que um número de série.
zh_cn: **device\_id** 必须在特定 device\_type 的所有设备中唯一标识某个设备，将其视为类似于序号可能会很有用。
zh_tw: **device\_id** 必須能夠在特定 device\_type 的所有裝置之間唯一地識別裝置，把它想成類似序號可能有幫助。

source: You can use any scheme of your choice when assigning values for ``type_id`` and ``device_id``, however the following restrictions apply to both:
pt_br: É possível usar qualquer esquema de sua escolha ao designar valores para ``type_id`` e ``device_id`, no entanto as seguintes restrições se aplicam a ambos:
zh_cn: 分配“type_id”和“device_id”的值时，可使用所选的任何方案，但两者都存在以下限制：
zh_tw: 指派 ``type_id`` 和 ``device_id`` 的值時，您可以使用自己選擇的任何方法，但兩者都有下列限制：

source: Maximum length of 36 characters
pt_br: Comprimento máximo de 36 caracteres
zh_cn: 最大长度为 36 个字符
zh_tw: 長度上限為 36 個字元

source: Must comprise only alpha-numeric characters (``a-z``, ``A-Z``, ``0-9``) and the following special characters:
pt_br: Deve abranger apenas caracteres alfanuméricos (` a-z``, ``A-Z`, ``0-9``) e os seguintes caracteres especiais:
zh_cn: 必须仅包含字母数字字符（“a-z”、“A-Z”和“0-9”）和以下特殊字符：
zh_tw: 只能包含英數字元（``a-z``、``A-Z``、``0-9``）和下列特殊字元：

source: dash (``-``)
pt_br: traço (``-``)
zh_cn: 短划线（“-”）
zh_tw: 橫線 (``-``)

source: underscore (``_``)
pt_br: sublinhado (``_``)
zh_cn: 下划线（“_”）
zh_tw: 底線 (``_``)

source: dot (``.``)
pt_br: ponto (``.``)
zh_cn: 点（“.”）
zh_tw: 句點 (``.``)

source: MQTT authentication
pt_br: Autenticação MQTT
zh_cn: MQTT 认证
zh_tw: MQTT 鑑別

source: Username
pt_br: Nome do usuário
zh_cn: 用户名
zh_tw: 使用者名稱

source: The service currently only supports token-based authentication for devices, as such there is only one valid username for devices today.
pt_br: O serviço suporta atualmente apenas a autenticação baseada em token para dispositivos, assim, há apenas um nome de usuário válido para os dispositivos hoje.
zh_cn: 服务当前仅支持针对设备进行基于令牌的认证，因此目前针对设备只有一个有效用户名。
zh_tw: 此服務目前只支援裝置的記號型鑑別，因此目前裝置只有一個有效的使用者名稱。

source: A value of ``use-token-auth`` indicates to the service that the authentication token for the device will be passed as the password for the MQTT connection.
pt_br: Um valor de ``use-token-auth`` indica ao serviço que o token de autenticação para o dispositivo será transmitido como a senha para a conexão MQTT.
zh_cn: 值“use-token-auth”向服务表明：设备的认证令牌将作为 MQTT 连接的密码进行传递。
zh_tw: ``use-token-auth`` 值向該服務指出裝置的鑑別記號將傳遞作為 MQTT 連線的密碼。

source: Password
pt_br: Senha
zh_cn: 密码
zh_tw: 密碼

source: When using token based authentication submit the device authentication token as the password when making your MQTT connection.
pt_br: Ao usar a autenticação baseada em token, envie o token de autenticação de dispositivo como a senha ao estabelecer sua conexão MQTT.
zh_cn: 如果使用基于令牌的认证，请在建立 MQTT 连接时，将设备认证令牌作为密码提交。
zh_tw: 使用記號型鑑別時，請提出裝置鑑別記號作為建立 MQTT 連線時的密碼。

source: Publishing events
pt_br: Publicando eventos
zh_cn: 发布事件
zh_tw: 發佈事件

source: Devices can only publish to the event topic of the form iot-2/evt/\ **event\_id**/fmt/**format\_string**
pt_br: Os dispositivos podem publicar apenas no tópico de eventos no formato iot-2/evt/\ **event\_id**/fmt/**format\_string**
zh_cn: 设备只能发布以下格式的事件主题：iot-2/evt/\ **event\_id**/fmt/**format\_string**
zh_tw: 裝置只能發佈至格式為 iot-2/evt/\ **event\_id**/fmt/**format\_string** 的事件主題

source: **event\_id** is the ID of the event, for example "status". The event ID can be any string permitted by MQTT. Subscriber applications must use this string in their subscription topic to receive the events published on this topic if wildcards are not used.
pt_br: **event\_id** é o ID do evento, por exemplo "status". O ID do evento pode ser qualquer sequência permitida pelo MQTT. Os aplicativos de assinante devem usar esta sequência em seus tópicos de assinatura para receber os eventos publicados sobre este tópico, se curingas não forem usados.
zh_cn: **event\_id** 是事件的标识，例如，“status”。事件标识可以是 MQTT 允许的任何字符串。如果不使用通配符，那么订户应用程序必须在其预订主题中使用此字符串以接收有关此主题发布的事件。
zh_tw: **event\_id** 是事件的 ID，例如 "status"。事件 ID 可以是 MQTT 所允許的任何字串。訂閱者應用程式必須在其訂閱主題中使用此字串，才能接收此主題上發佈的事件（如果未使用萬用字元的話）。

source: **format\_string** is the format of the event payload, for example "json". The format can be any string permitted by MQTT. Subscriber applications must use this string in their subscription topic to receive events published on this topic if wildcards are not used. If the format is not "json", then messages will not be stored in the Historian.
pt_br: **format\_string** é o formato da carga útil do evento, por exemplo "json". O formato pode ser qualquer sequência permitida pelo MQTT. Os aplicativos de assinante devem usar essa sequência em seus tópicos de assinatura para receber eventos publicados sobre este tópico, se curingas não forem usados. Se o formato não for "json", as mensagens não serão armazenadas no Historiador.
zh_cn: **format\_string** 是事件有效内容的格式，例如，“json”。格式可以是 MQTT 允许的任何字符串。如果不使用通配符，那么订户应用程序必须在其预订主题中使用此字符串以接收有关此主题发布的事件。如果格式不是“json”，那么消息不会存储在 Historian 中。
zh_tw: **format\_string** 是事件內容的格式，例如 "json"。格式可以是 MQTT 所允許的任何字串。訂閱者應用程式必須在其訂閱主題中使用此字串，才能接收此主題上發佈的事件（如果未使用萬用字元的話）。如果格式不是 "json"，則訊息將不會儲存在 Historian 中。

source: The message payload is limited to a maximum of 131072 bytes. Messages larger than this will be rejected.
pt_br: A carga útil da mensagem é limitada a um máximo de 131072 bytes. Mensagens maiores do que esta serão rejeitadas.
zh_cn: 消息有效内容限制为最长 131072 个字节。将拒绝大于此大小的消息。
zh_tw: 訊息內容的位元組數上限為 131072 個位元組。大於此上限的訊息將遭到拒絕。

source: Devices can only subscribe to command topics of the form iot-2/cmd/\ **command\_id**/fmt/**format\_string**. They cannot subscribe to other devices' events and will only receive commands published specifically to the device itself.
pt_br: Os dispositivos podem assinar tópicos de comando apenas no formato iot-2/cmd/\ **command\_id**/fmt/**format\_string**. Eles não podem assinar eventos de outros dispositivos e somente receberão comandos publicados especificamente para o próprio dispositivo.
zh_cn: 设备只能预订以下格式的命令主题：**command\_id**/fmt/**format\_string**。无法预订其他设备的事件，并且将仅接收专门发布到设备自身的命令。
zh_tw: 裝置只能訂閱格式為 iot-2/cmd/\ **command\_id**/fmt/**format\_string** 的指令主題。它們無法訂閱其他裝置的事件，而且只會接收特別發佈至裝置本身的指令。

source: **command\_id** is the ID of the command, for example "update". The command ID can be any string permitted by MQTT. A device must use this string in its subscription topic in order to receive commands published on this topic if wildcards are not used.
pt_br: **command\_id** é o ID do comando, por exemplo "update". O ID de comando pode ser qualquer sequência permitida pelo MQTT. Um dispositivo deve usar essa sequência em seu tópico de assinatura a fim de receber comandos publicados neste tópico se curingas não são usados.
zh_cn: **command\_id** 是命令的标识，例如，“update”。命令标识可以是 MQTT 允许的任何字符串。如果不使用通配符，那么设备必须在此预订主题中使用此属性以接收有关此主题发布的命令。
zh_tw: **command\_id** 是指令的 ID，例如 "update"。指令 ID 可以是 MQTT 所允許的任何字串。裝置必須在其訂閱主題中使用此字串，才能接收此主題上發佈的指令（如果未使用萬用字元的話）。

source: **format\_string** is the format of the command payload, for example "json". The format can be any string permitted by MQTT. A device must use this string in its subscription topic in order to receive commands published on this topic if wildcards are not used.
pt_br: **format\_string** é o formato da carga útil de comando, por exemplo "json". O formato pode ser qualquer sequência permitida pelo MQTT. Um dispositivo deve usar essa sequência em seu tópico de assinatura a fim de receber comandos publicados neste tópico se curingas não são usados.
zh_cn: **format\_string** 是命令有效内容的格式，例如，“json”。格式可以是 MQTT 允许的任何字符串。如果不使用通配符，那么设备必须在此预订主题中使用此属性以接收有关此主题发布的命令。
zh_tw: **format\_string** 是指令內容的格式，例如 "json"。格式可以是 MQTT 所允許的任何字串。裝置必須在其訂閱主題中使用此字串，才能接收此主題上發佈的指令（如果未使用萬用字元的話）。

source: Managed Devices
pt_br: Dispositivos Gerenciados
zh_cn: 受管设备
zh_tw: 受管理裝置

source: Support for device lifecycle management is optional, the device management protocol used by IoTF utilises the same MQTT connection that your device already uses for events and command control.
pt_br: O suporte para gerenciamento de ciclo de vida de dispositivo é opcional, o protocolo de gerenciamento de dispositivo usado pelo IoTF usa a mesma conexão de MQTT que seu dispositivo já usa para eventos e controle de comando.
zh_cn: 设备生命周期管理支持是可选的，IoTF 使用的设备管理协议利用设备已用于事件和命令控制的相同 MQTT 连接。
zh_tw: 裝置生命週期管理的支援是選用項目。IoTF 所使用的裝置管理通訊協定會利用您的裝置已對事件及指令控制項使用的同一個 MQTT 連線。

source: Quality of Service Levels and Clean Session
pt_br: Qualidade de Níveis de Serviço e Sessão de Limpeza
zh_cn: 服务质量级别和清除会话
zh_tw: 服務品質等級和清除階段作業

source: Managed devices can publish messages with Quality of Service (QoS) level of 0 or 1. If QoS 1 is used, messages from the device will be queued if necessary. Messages from the device must not be retained messages.
pt_br: Os dispositivos gerenciados podem publicar mensagens com níveis de Qualidade de Serviço (QoS) 0 ou 1. Se o QoS 1 for usado, as mensagens do dispositivo serão enfileiradas, se necessário. As mensagens do dispositivo não devem ser mensagens retidas.
zh_cn: 受管设备可以发布服务质量 (QoS) 级别为 0 或 1 的消息。如果使用 QoS 级别 1，那么在必要时会对来自设备的消息进行排队。来自设备的消息不能是保留消息。
zh_tw: 受管理裝置可以發佈服務品質 (QoS) 等級 0 或 1 的訊息。如果使用 QoS 1，則來自裝置的訊息將會置入佇列（必要的話）。來自裝置的訊息不能是保留的訊息。

source: The IoT Platform publishes requests with a QoS level of 1 to support queuing of messages. In order to queue messages sent while a managed device is not connected, the device should use ``cleansession=false``.
pt_br: O IoT Platform publica solicitações com um nível de QoS 1 para suportar o enfileiramento de mensagens. Para enfileirar as mensagens enviadas enquanto um dispositivo gerenciado não está conectado, o dispositivo deve usar ``cleansession=false``.
zh_cn: IoT Platform 可发布 QoS 级别为 1 的请求以支持消息排队。要在未连接受管设备的情况下让发送的消息排队，该设备应使用“cleansession=false”。
zh_tw: IoT Platform 會發佈 QoS 等級為 1 的要求，以支援將訊息置入佇列。若要將受管理裝置未連接時傳送的訊息置入佇列，該裝置應該使用 ``cleansession=false``。

source: If your managed device uses a durable subscription (cleansession=false) you need to be aware that device management commands sent to your device while it is offline will be reported as failed operations if the device does not reconnect to the service before the request times out, however when the device later connects those requests will be actioned by the device.
pt_br: Se seu dispositivo gerenciado usar uma assinatura durável (cleansession=false), você precisará estar ciente de que os comandos de gerenciamento de dispositivo enviados ao seu dispositivo enquanto ele está off-line serão relatados como operações com falha se o dispositivo não reconectar-se ao serviço antes que a solicitação atinja o tempo limite, no entanto, quando o dispositivo se conectar posteriormente, essas solicitações serão acionadas pelo dispositivo.
zh_cn: 如果受管设备使用持久预订 (cleansession=false)，那么您需要注意，如果在请求超时前设备未重新连接到服务，那么脱机时发送到设备的设备管理命令将报告为失败的操作，但是在设备稍后连接时，设备将执行这些请求。
zh_tw: 當您的受管理裝置使用可延續訂閱 (cleansession=false) 時，您需要注意，如果在要求逾時之前裝置未重新連接至服務，則在裝置離線時傳送至裝置的裝置管理指令將報告為失敗作業，不過，當裝置稍後連接時，裝置將處理那些要求。

source: When handling request failures it is important to take this into account if you are using durable subscriptions for your managed devices.
pt_br: Ao manipular falhas de solicitação, é importante levar isso em conta se você estiver usando assinaturas duráveis para seus dispositivos gerenciados.
zh_cn: 在处理请求失败时，重要的是考虑是否对于受管设备使用持久预订。
zh_tw: 當處理要求失敗時，如果您要對受管理裝置使用可延續訂閱，請務必考量此情況。

source: Topics
pt_br: Tópicos
zh_cn: 主题
zh_tw: 主題

source: A managed device is required to subscribe to the following topic to handle requests and responses from the IoT Platform:
pt_br: Um dispositivo gerenciado é necessário para assinar o tópico a seguir a fim de manipular solicitações e respostas da IoT Platform:
zh_cn: 受管设备需要预订以下主题以处理来自 IoT Platform 的请求和响应：
zh_tw: 需要受管理裝置訂閱下列主題，以處理來自 IoT Platform 的要求及回應：

source: A managed device will publish to topics specific to the type of management request being performed:
pt_br: Um dispositivo gerenciado publicará em tópicos específicos ao tipo de solicitação de gerenciamento que está sendo executada:
zh_cn: 受管设备将发布到特定于所执行的管理请求类型的主题：
zh_tw: 受管理裝置將會發佈至正在執行的管理要求類型專屬的主題：

source: The managed device will publish device management responses on ``iotdevice-1/response``
pt_br: O dispositivo gerenciado publicará respostas de gerenciamento de dispositivo no ``iotdevice-1/response``
zh_cn: 受管设备将发布有关“iotdevice-1/response”的设备管理响应
zh_tw: 受管理裝置將在 ``iotdevice-1/response`` 上發佈裝置管理回應

source: For other topics a managed device may publish to, refer to `Device Management Protocol <device_mgmt/index.html>`__ and `Device Management Requests <device_mgmt/requests.html>`__.
pt_br: Para outros tópicos, um dispositivo gerenciado poderá publicar, consulte `Device Management Protocol <device_mgmt/index.html>`__ e `Device Management Requests <device_mgmt/requests.html>`__.
zh_cn: 有关受管设备可以发布到的其他主题，请参阅 `设备管理协议 <device_mgmt/index.html>`__ 和 `设备管理请求 <device_mgmt/requests.html>`__。
zh_tw: 如需瞭解受管理裝置可能會發佈至的其他主題，請參閱 `裝置管理通訊協定 <device_mgmt/index.html>`__ 及 `裝置管理要求 <device_mgmt/requests.html>`__。

source: Message Format
pt_br: Formato da Mensagem
zh_cn: 消息格式
zh_tw: 訊息格式

source: All messages are sent in JSON format. There are two types of messages.
pt_br: Todas as mensagens são enviadas no formato JSON. Há dois tipos de mensagens.
zh_cn: 所有消息都以 JSON 格式进行发送。有两种类型的消息。
zh_tw: 所有訊息都會以 JSON 格式傳送。共有兩種類型的訊息。

source: Request
pt_br: Solicitação
zh_cn: 请求
zh_tw: 要求

source: Requests are formatted as follows:
pt_br: As solicitações são formatadas da seguinte maneira:
zh_cn: 请求的格式如下：
zh_tw: 要求的格式如下：

source: ``d`` carries any data relevant to the request
pt_br: ``d`` transporta quaisquer dados relevantes para a solicitação
zh_cn: “d”传送与请求相关的所有数据
zh_tw: ``d`` 會傳送任何與要求相關的資料

source: ``reqId`` is an identifier of the request, and must be copied into a response. If a response is not required, the field should be omitted.
pt_br: ``reqId`` é um identificador da solicitação e deve ser copiado em uma resposta. Caso não seja necessário fornecer uma resposta, o campo deve ser omitido.
zh_cn: “reqId”是请求的标识，必须复制到响应中。如果不需要响应，那么应省略此字段。
zh_tw: ``reqId`` 是要求的 ID，而且必須複製到回應。如果不需要回應，則應該省略該欄位。

source: Response
pt_br: Resposta
zh_cn: 响应
zh_tw: 回應

source: Responses are formatted as follows:
pt_br: As respostas são formatadas da seguinte maneira:
zh_cn: 响应的格式如下：
zh_tw: 回應的格式如下：

source: "rc" is a result code of the original request.
pt_br: "rc" é um código de resultado da solicitação original.
zh_cn: “rc”是原始请求的结果代码。
zh_tw: "rc" 是原始要求的結果碼。

source: ``message`` is an optional element with a text description of the response code.
pt_br: ``message`` é um elemento opcional com uma descrição de texto do código de resposta.
zh_cn: “message”是包含响应代码的文本描述的可选元素。
zh_tw: ``message`` 是選用元素，附有回應碼的文字說明。

source: ``d`` is an optional data element accompanying the response.
pt_br: ``d`` é um elemento de dados opcional que acompanha a resposta.
zh_cn: “d”是伴随响应的可选数据元素。
zh_tw: ``d`` 是隨附回應的選用資料元素。

source: ``reqId`` is the request ID of the original request. This is used to correlate responses with requests, and the device needs to ensure that all request IDs are unique. When responding to IoT Platform requests, the correct ``reqId`` value must be sent in the response.
pt_br: ``reqId`` é o ID da solicitação original. Isso é usado para correlacionar respostas com solicitações e o dispositivo precisa assegurar que todos os IDs de solicitação sejam exclusivos. Ao responder às solicitações do IoT Platform, o valor correto de ``reqId`` deve ser enviado na resposta.
zh_cn: “reqId”是原始请求的请求标识。这用于将响应与请求相关联，并且设备需要确保所有请求标识都唯一。在对 IoT Platform 请求进行响应时，必须在响应中发送正确的“reqId”值。
zh_tw: ``reqId`` 是原始要求的要求 ID。這是用來建立回應與要求的關聯，且裝置需要確定所有要求 ID 都是唯一的。在回應 IoT Platform 要求時，必須在回應中傳送正確的 ``reqId`` 值。

source: For more details on particular request and response messages, refer to `Device Management Protocol <device_mgmt/index.html>`__ and `Device Management Requests <device_mgmt/requests.html>`__.
pt_br: Para obter mais detalhes sobre solicitação particular e mensagens de resposta, consulte `Device Management Protocol <device_mgmt/index.html>`__ e `Device Management Requests <device_mgmt/requests.html>`__.
zh_cn: 有关特定请求和响应消息的更多详细信息，请参阅 `设备管理协议 <device_mgmt/index.html>`__ 和 `设备管理请求 <device_mgmt/requests.html>`__。
zh_tw: 如需特定要求及回應訊息的相關詳細資料，請參閱 `裝置管理通訊協定 <device_mgmt/index.html>`__ 及 `裝置管理要求 <device_mgmt/requests.html>`__。
