Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/libraries/nodejs.po
Languages: de, ja, pt_br

source: Node.js for Application Developers
de: Node.js für Anwendungsentwickler
ja: アプリケーション開発者用の Node.js
pt_br: Node.js para Desenvolvedores de Aplicativos

source: See `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ in GitHub
de: Siehe `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ in GitHub
ja: GitHub の `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ を参照してください。
pt_br: Consulte `iot-nodejs <https://github.com/ibm-messaging/iot-nodejs>`_ no GitHub

source: See the `samples for device <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ in Github
de: Siehe `Beispiele für Gerät <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ in Github
ja: Github の `デバイス用サンプル <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ を参照してください。
pt_br: Consulte `samples for device <https://github.com/ibm-messaging/iot-nodejs/tree/master/samples>`_ em Github

source: See `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ on NPM
de: Siehe `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ in NPM
ja: NPM の `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ を参照してください。
pt_br: Consulte `ibmiotf <https://www.npmjs.com/package/ibmiotf>`_ no NPM

source: Application
de: Anwendung
ja: アプリケーション

source: *ApplicationClient* is application client for the Internet of Things Foundation service. This section contains information on how applications interact with devices.
de: *ApplicationClient* ist der Anwendungsclient für den Internet of Things Foundation-Service. Dieser Abschnitt enthält Informationen zur Interaktion zwischen Anwendungen und Geräten.
ja: *ApplicationClient* は、Internet of Things Foundation サービスのアプリケーション・クライアントです。このセクションには、アプリケーションでデバイスと対話する方法についての情報が含まれています。
pt_br: *ApplicationClient* é o aplicativo cliente para o serviço Internet of Things Foundation. Esta seção contém informações sobre como os aplicativos interagem com dispositivos.

source: Constructor
de: Konstruktor
ja: コンストラクター
pt_br: Construtor

source: The constructor builds the application client instance. It accepts an configuration json containing the following :
de: Die Instanz des Anwendungsclients wird vom Konstruktor erstellt. Sie akzeptiert eine Konfigurations-JSON, die die folgenden Angaben enthält:
ja: コンストラクターはアプリケーション・クライアント・インスタンスを作成します。これは、以下を含む構成 json を受け入れます。
pt_br: O construtor constrói a instância do aplicativo cliente. Ele aceita um json de configuração que contém o seguinte:

source: org - Your organization ID
de: org - Ihre Organisations-ID
ja: org - 組織 ID
pt_br: org - O ID da organização

source: id - The unique ID of your application within your organization.
de: id - Die eindeutige ID Ihrer Anwendung innerhalb Ihrer Organisation.
ja: id - 組織内のアプリケーションの固有 ID。
pt_br: ID - O ID exclusivo de seu aplicativo dentro de sua organização.

source: auth-key - API key
de: auth-key - API-Schlüssel
ja: auth-key - API キー
pt_br: auth-key - chave de API

source: auth-token - API key token
de: auth-token - API-Schlüsseltoken
ja: auth-token - API キー・トークン
pt_br: auth-token - token de chave de API

source: type - use 'shared' to enable shared subscription
de: type - Verwenden Sie 'shared' zum Aktivieren der gemeinsam genutzten Subskription.
ja: type - 共用サブスクリプションを有効にするには 'shared' を使用します
pt_br: type - use 'shared' para permitir a assinatura compartilhada

source: If you want to use quickstart, then send only the first two properties.
de: Wenn Sie einen Schnellstart ausführen möchten, senden Sie nur die beiden ersten Eigenschaften.
ja: Quickstart を使用する場合は、最初の 2 つのプロパティーのみを送信します。
pt_br: Se desejar usar a iniciação rápida, envie apenas as duas primeiras propriedades.

source: Using a configuration file
de: Konfigurationsdatei verwenden
ja: 構成ファイルの使用
pt_br: Usando um arquivo de configuração

source: Instead of passing the configuration json directly, you can also use a configuration file. Use the following code snippet
de: Anstatt die Konfigurations-JSON direkt weiterzugeben, können Sie auch eine Konfigurationsdatei verwenden. Verwenden Sie das folgenden Codefragment:
ja: 構成 json を直接渡す代わりに、構成ファイルを使用することもできます。以下のコード・スニペットを使用します
pt_br: Em vez de passar o JSON de configuração diretamente, também é possível usar um arquivo de configuração. Use o seguinte fragmento de código

source: The configuration file must be in the format of
de: Die Konfigurationsdatei muss im folgenden Format vorliegen:
ja: 構成ファイルは、以下の形式でなければなりません
pt_br: O arquivo de configuração deve estar no seguinte formato

source: Connecting to the IoT Platform
de: Herstellen der Verbindung zu IoT Platform
ja: IoT Platform への接続
pt_br: Conectando-se ao IoT Platform

source: Connect to the IBM Watson Internet of Things Platform by calling the *connect*
de: Stellen Sie die Verbindung zu IBM Watson Internet of Things Platform her, indem Sie die Funktion *connect* aufrufen.
ja: *connect* を呼び出して IBM Watson Internet of Things Platform に接続します
pt_br: Conecte-se ao IBM Watson Internet of Things Platform chamando *connect*

source: After the successful connection to the IoT Platform service, the application client sends a *connect* event. So all the logic can be implemented inside this callback function.
de: Nachdem die Verbindung zum IoT Platform-Service erfolgreich hergestellt wurde, sendet der Anwendungsclient ein Ereignis *connect*. Somit kann die gesamte Logik in dieser Callback-Funktion implementiert werden.
ja: IoT Platform サービスへの接続に成功すると、アプリケーション・クライアントは *connect* イベントを送信します。このため、すべてのロジックはこのコールバック関数の内部に実装できます。
pt_br: Após a conexão bem-sucedida com o serviço do IoT Platform, o aplicativo cliente envia um evento *connect*. Assim, toda a lógica pode ser implementada dentro dessa função de retorno de chamada.

source: The Application Client automatically tries to reconnect when it loses connection. When the reconnection is successful, the client emits *reconnect* event.
de: Der Anwendungsclient versucht bei einer Verbindungsunterbrechung automatisch, die Verbindung erneut herzustellen. Wenn die Wiederherstellung der Verbindung erfolgreich ist, gibt der Client das Ereignis *reconnect* aus.
ja: アプリケーション・クライアントは、接続を失うと自動的に再接続を試みます。再接続が成功すると、クライアントは *reconnect* イベントを発行します。
pt_br: O Application Client tenta automaticamente se reconectar quando perde a conexão. Quando a reconexão é bem-sucedida, o cliente emite o evento *reconnect*.

source: Logging
de: Protokollierung
ja: ロギング
pt_br: Criação de Log

source: By default, all the logs of ```warn``` are logged. If you want to enable more logs, use the *log.setLevel* function. Supported log levels - *trace, debug, info, warn, error*.
de: Standardmäßig werden alle Nachrichten des Typs ```warn``` protokolliert. Wenn Sie weitere Nachrichten protokollieren möchten, verwenden Sie die Funktion *log.setLevel*. Unterstützte Protokollebenen sind *trace, debug, info, warn, error*.
ja: デフォルトでは、```warn``` のすべてのログが記録されます。より多くのログを有効にする場合は、*log.setLevel* 関数を使用します。サポートされるログ・レベル - *trace、debug、info、warn、error*。
pt_br: Por padrão, todos os logs de ```warn``` são registrados. Se desejar ativar mais logs, use a função *log.setLevel*. Níveis de logs suportados - *trace, debug, info, warn, error*.

source: Shared Subscription
de: Gemeinsam genutzte Subskription
ja: 共用サブスクリプション
pt_br: Assinatura compartilhada

source: Use this feature to build scalable applications which will load balance messages across multiple instances of the application. To enable this, pass 'type' as 'shared' in the configuration.
de: Mit dieser Funktion können Sie skalierbare Anwendungen erstellen, die einen Nachrichtenlastausgleich über mehrere Instanzen der Anwendung vornehmen. Geben Sie hierzu in der Konfiguration den Wert 'shared' für 'type' an.
ja: アプリケーションの複数インスタンス間でメッセージのロード・バランシングを実行するスケーラブルなアプリケーションを作成するには、この機能を使用します。これを有効にするには、構成で 'type' を 'shared' として渡します。
pt_br: Use este recurso para construir aplicativos escaláveis que farão o balanceamento das cargas de mensagens em várias instâncias do aplicativo. Para permitir isso, transmita 'type' como 'shared' na configuração.

source: Handling errors
de: Fehlerbehandlung
ja: エラーの処理
pt_br: Tratamento de Erros

source: When the application clients encounters an error, it emits an *error* event.
de: Wenn der Anwendungsclient einen Fehler feststellt, gibt er ein Ereignis *error* aus.
ja: アプリケーション・クライアントは、エラーを検出すると、*error* イベントを発行します。
pt_br: Quando o aplicativo cliente encontra um erro, ele emite um evento *error*.

source: Subscribing to device events
de: Geräteereignisse subskribieren
ja: デバイス・イベントへのサブスクライブ
pt_br: Assinando eventos de dispositivo

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
de: Ereignisse sind der Mechanismus, mit dem Geräte Daten in IoT Platform publizieren. Das Gerät steuert den Inhalt des Ereignisses und ordnet einen Namen für jedes von dem Gerät gesendete Ereignis zu.
ja: イベントは、デバイスが IoT Platform にデータをパブリッシュするためのメカニズムです。デバイスはイベントのコンテンツを制御し、送信するイベントごとに名前を割り当てます。
pt_br: Eventos são o mecanismo pelo qual dispositivos publicam dados no IoT Platform. O dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.

source: When an event is received by the IoT Platform, the credentials of the connection on which the event was received are used to determine from which device the event was sent. Using this architecture, it is impossible for a device to impersonate another device.
de: Wenn ein Ereignis von IoT Platform empfangen wird, werden die Identifikationsdaten der Verbindung, über die das Ereignis empfangen wurde, dazu verwendet, das Gerät zu ermitteln, von dem das Ereignis gesendet wurde. Mit dieser Architektur ist es für ein Gerät unmöglich, die Identität eines anderen Geräts anzunehmen.
ja: IoT Platform は、イベントを受け取ると、そのイベントを受け取った接続の資格情報に基づいて、イベントの送信元のデバイスを特定します。このアーキテクチャーによって、デバイスが別のデバイスの名前を使用することが不可能になります。
pt_br: Quando um evento é recebido pelo IoT Platform, as credenciais da conexão na qual o evento foi recebido são usadas para determinar de qual dispositivo o evento foi enviado. Com essa arquitetura, é impossível que um dispositivo personifique outro dispositivo.

source: By default, applications will subscribe to all events from all connected devices. Use the type, id, event and msgFormat parameters to control the scope of the subscription. A single client can support multiple subscriptions. The code samples below give examples of how to subscribe to devices dependent on device type, id, event and msgFormat parameters.
de: Standardmäßig subskribieren Anwendungen alle Ereignisse von allen verbundenen Geräte. Verwenden Sie die Parameter type, id, event und msgFormat, um den Geltungsbereich der Subskription zu steuern. Ein einzelner Client kann mehrere Subskriptionen unterstützen. Die nachfolgenden Codebeispiele zeigen beispielhaft die Vorgehensweise beim Subskribieren bei Geräte abhängig von den Geräteparametern type, id, event und msgFormat.
ja: デフォルトでは、アプリケーションはすべての接続デバイスの全イベントをサブスクライブします。type、id、event、および msgFormat パラメーターを使用して、サブスクリプションのスコープを制御します。単一のクライアントで複数のサブスクリプションをサポートできます。以下のコード・サンプルは、デバイスの type、id、event、および msgFormat パラメーターに基づいてデバイスをサブスクライブする方法の例を示しています。
pt_br: Por padrão, os aplicativos assinarão todos os eventos de todos os dispositivos conectados. Use os parâmetros de tipo, ID, evento e msgFormat para controlar o escopo da assinatura. Um único cliente pode suportar várias assinaturas. As amostras de código abaixo fornecem exemplos de como assinar os dispositivos dependendo dos parâmetros de tipo de dispositivo, ID, evento e msgFormat.

source: To subscribe to all events from all devices
de: Zum Subskribieren aller Ereignisse von allen Geräte
ja: すべてのデバイスの全イベントをサブスクライブする場合
pt_br: Para assinar todos os eventos de todos os dispositivos

source: To subscribe to all events from all devices of a specific type
de: Zum Subskribieren aller Ereignisse von allen Geräte eines bestimmten Typs
ja: 特定のタイプのすべてのデバイスの全イベントをサブスクライブする場合
pt_br: Para assinar todos os eventos de todos os dispositivos de um tipo específico

source: To subscribe to a specific event from all devices
de: Zum Subskribieren eines bestimmten Ereignisses von allen Geräte
ja: すべてのデバイスの特定のイベントをサブスクライブする場合
pt_br: Para assinar um evento específico de todos os dispositivos

source: To subscribe to a specific event from two or more different devices
de: Zum Subskribieren eines bestimmten Ereignisses von zwei oder mehr verschiedenen Geräte
ja: 複数の異なるデバイスの特定のイベントをサブスクライブする場合
pt_br: Para assinar um evento específico de dois ou mais dispositivos diferentes

source: To subscribe to all events published by a device in json format
de: Zum Subskribieren aller Ereignisse, die von einem Gerät im json-Format publiziert werden
ja: json 形式でデバイスがパブリッシュした全イベントをサブスクライブする場合
pt_br: Para assinar todos os eventos publicados por um dispositivo no formato json

source: Handling events from devices
de: Ereignisse von Geräten verarbeiten
ja: デバイスのイベントの処理
pt_br: Manipulando eventos a partir de dispositivos

source: To process the events received by your subscriptions you need to implement a device event callback method. The ibmiotf application client emits the event *deviceEvent*. This function has the following properties:
de: Zum Verarbeiten der Ereignisse, die von Ihren Subskriptionen empfangen wurden, müssen Sie eine Ereignis-Callback-Methode implementieren. Vom ibmiotf-Anwendungsclient wird das Ereignis *deviceEvent* ausgegeben. Diese Funktion weist folgende Eigenschaften auf:
ja: サブスクリプションによって受信したイベントを処理するには、デバイス・イベント・コールバック・メソッドを実装する必要があります。ibmiotf アプリケーション・クライアントはイベント *deviceEvent* を発行します。この関数のプロパティーは、以下のとおりです。
pt_br: Para processar os eventos recebidos por suas assinaturas, é necessário implementar um método de retorno de chamada de eventos do dispositivo. O aplicativo cliente ibmiotf emite o evento *deviceEvent*. Esta função possui as seguintes propriedades:

source: payload - Device event payload
de: payload - Geräteereignisnutzdaten
ja: payload - デバイスのイベント・ペイロード
pt_br: payload - A carga útil do evento do dispositivo

source: topic - Original topic
de: topic - Ursprüngliches Topic
ja: topic - 元のトピック
pt_br: topic - Tópico original

source: Subscribing to device status
de: Gerätestatus subskribieren
ja: デバイス・ステータスへのサブスクライブ
pt_br: Assinando o status do dispositivo

source: By default, this will subscribe to status updates for all connected devices. Use the type and id parameters to control the scope of the subscription. A single client can support multiple subscriptions.
de: Standardmäßig werden hiermit Statusaktualisierungen für alle verbundenen Geräte subskribiert. Verwenden Sie die Parameter type und id, um den Geltungsbereich der Subskription zu steuern. Ein einzelner Client kann mehrere Subskriptionen unterstützen.
ja: デフォルトで、これはすべての接続デバイスのステータスの更新をサブスクライブします。type および id パラメーターを使用して、サブスクリプションのスコープを制御します。単一のクライアントで複数のサブスクリプションをサポートできます。
pt_br: Por padrão, este assinará as atualizações de status para todos os dispositivos conectados. Use os parâmetros de tipo e ID para controlar o escopo da assinatura. Um único cliente pode suportar várias assinaturas.

source: Subscribe to status updates for all devices
de: Statusaktualisierungen für alle Geräte subskribieren
ja: すべてのデバイスのステータス更新をサブスクライブ
pt_br: Assinar as atualizações de status para todos os dispositivos

source: Subscribe to status updates for all devices of a specific type
de: Statusaktualisierungen für alle Geräte eines bestimmten Typs subskribieren
ja: 特定のタイプのすべてのデバイスのステータス更新をサブスクライブ
pt_br: Assinar as atualizações de status para todos os dispositivos de um tipo específico

source: Subscribe to status updates for two different devices
de: Statusaktualisierungen für zwei verschiedene Geräte subskribieren
ja: 2 つの異なるデバイスのステータス更新をサブスクライブ
pt_br: Assinar as atualizações de status para dois dispositivos diferentes

source: Handling status updates from devices
de: Statusaktualisierungen von Geräten verarbeiten
ja: デバイスのステータス更新の処理
pt_br: Manipulando atualizações de status a partir de dispositivos

source: To process the status updates received by your subscriptions you need to implement an device status callback method. The ibmiotf application client emits the event *deviceStatus*. This function has the following properties:
de: Zum Verarbeiten der Statusaktualisierungen, die von Ihren Subskriptionen empfangen wurden, müssen Sie eine Callback-Methode für den Gerätestatus implementieren. Vom ibmiotf-Anwendungsclient wird das Ereignis *deviceStatus* ausgegeben. Diese Funktion weist folgende Eigenschaften auf:
ja: サブスクリプションによって受信したステータス更新を処理するには、デバイス・ステータス・コールバック・メソッドを実装する必要があります。ibmiotf アプリケーション・クライアントはイベント *deviceStatus* を発行します。この関数のプロパティーは、以下のとおりです。
pt_br: Para processar as atualizações de status recebidas por suas assinaturas, é necessário implementar um método de retorno de chamada de status do dispositivo. O aplicativo cliente ibmiotf emite o evento *deviceStatus*. Esta função possui as seguintes propriedades:

source: payload - Device status payload
de: payload - Gerätestatusnutzdaten
ja: payload - デバイス・ステータスのペイロード
pt_br: payload - A carga útil de status do dispositivo

source: Publishing events from devices
de: Ereignisse von Geräten publizieren
ja: デバイスのイベントのパブリッシュ
pt_br: Publicando eventos a partir de dispositivos

source: Applications can publish events as if they originated from a Device. The function requires:
de: Anwendungen können Ereignisse so publizieren, als ob sie von einem Gerät stammen. Für die Funktion ist Folgendes erforderlich:
ja: アプリケーションは、イベントをデバイスから発信されたかのようにパブリッシュできます。この機能には以下が必要です。
pt_br: Os aplicativos podem publicar eventos como se eles se originassem em um Dispositivo. A função requer:

source: DeviceType
ja: デバイス・タイプ

source: Device ID
de: Geräte-ID
ja: デバイス ID
pt_br: ID do Dispositivo

source: Event Type
de: Ereignistyp
ja: イベント・タイプ
pt_br: Tipo de Evento

source: Format
ja: 形式
pt_br: Formato

source: Data
de: Daten
ja: データ
pt_br: Dados

source: Publishing commands to devices
de: Befehle für Geräte publizieren
ja: コマンドをデバイスにパブリッシュ
pt_br: Publicando comandos para dispositivos

source: Applications can publish commands to connected devices. The function requires:
de: Anwendungen können Befehle an verbundene Geräte publizieren. Für die Funktion ist Folgendes erforderlich:
ja: アプリケーションはコマンドを接続デバイスにパブリッシュできます。この機能には以下が必要です。
pt_br: Os aplicativos podem publicar comandos para dispositivos conectados. A função requer:

source: Command Type
de: Befehlstyp
ja: コマンド・タイプ
pt_br: Tipo de Comando

source: Disconnect Client
de: Verbindung des Clients trennen
ja: クライアントの切断
pt_br: Desconectar Cliente

source: Disconnects the client and releases the connections
de: Trennt die Verbindung des Clients und gibt die Verbindungen frei
ja: クライアントを切断し、接続をリリースします
pt_br: Desconecta o cliente e libera as conexões
