Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/libraries/python.po
Languages: pt_br, zh_cn, zh_tw

source: The following code sample will return the device management information for a device with the deviceId "00aabbccde03", with deviceTypeId "iotsample-arduino".
pt_br: A amostra de código a seguir irá retornar as informações de gerenciamento de dispositivo para um dispositivo com o deviceId "00aabbccde03", com deviceTypeId "iotsample-arduino".
zh_cn: 以下代码样本将返回设备的管理信息，deviceId 为“00aabbccde03”，deviceTypeId 为“iotsample-arduino”。
zh_tw: 下列程式碼範例會針對 deviceId 為 "00aabbccde03"、deviceTypeId 為 "iotsample-arduino" 的裝置傳回其裝置管理資訊。

source: Device diagnostic operations
pt_br: Operações de diagnóstico de dispositivo
zh_cn: 设备诊断操作
zh_tw: 裝置診斷作業

source: Applications can use device diagnostic operations to clear logs, retrieve all or specific logs for a device, add log information, delete logs, clear error codes, get device error codes, and add an error codes.
pt_br: Os aplicativos podem utilizar operações de diagnóstico do dispositivo para limpar logs, recuperar todos ou logs específicos para um dispositivo, incluir informações de log, excluir logs, limpar códigos de erro, obter códigos de erro do dispositivo e incluir códigos de erro.
zh_cn: 应用程序可以使用设备诊断操作来清除日志，检索设备的所有日志或特定日志，添加日志信息，删除日志，清除错误代码，获取设备错误代码以及添加错误代码。
zh_tw: 應用程式可使用裝置診斷作業來清除日誌、擷取裝置的所有或特定日誌、新增日誌資訊、刪除日誌、清除錯誤碼、取得裝置錯誤碼，以及新增錯誤碼。

source: For more detailed information on query and response models, response codes, and query paramters, please see the relevant API documentation.
pt_br: Para obter informações mais detalhadas sobre modelos de consulta e resposta, códigos de resposta e os parâmetros de consulta, consulte a documentação da API relacionada.
zh_cn: 有关查询和响应模型、响应代码和查询参数的更多详细信息，请参阅相关 API 文档。
zh_tw: 如需查詢和回應模型、回應碼和查詢參數的詳細資訊，請參閱相關的 API 文件。

source: Get Diagnostic logs
pt_br: Obter os logs de diagnóstico
zh_cn: 获取诊断日志
zh_tw: 取得診斷日誌

source: The *getAllDiagnosticLogs()* method is used to retrieve all diagnostic logs for a specific device. The *getAllDiagnosticLogs()* method requires the deviceTypeId and deviceId parameters.
pt_br: O método *getAllDiagnosticLogs()* é utilizado para recuperar todos os logs de diagnóstico para um dispositivo específico. O método *getAllDiagnosticLogs()* requer os parâmetros deviceTypeId e deviceId.
zh_cn: *getAllDiagnosticLogs()* 方法用于检索特定设备的所有诊断日志。*getAllDiagnosticLogs()* 方法需要使用 deviceTypeId 和 deviceId 参数。
zh_tw: *getAllDiagnosticLogs()* 方法可用來擷取特定裝置的所有診斷日誌。*getAllDiagnosticLogs()* 方法需要 deviceTypeId 和 deviceId 參數。

source: The response model for this method contains the logId, message, severity, data, and timestamp.
pt_br: O modelo de resposta para este método contém o logId, mensagem, gravidade, dados e timestamp.
zh_cn: 此方法的响应模型包含 logId、消息、严重性、数据和时间戳记。
zh_tw: 此方法的回應模型包含日誌 ID、訊息、嚴重性、資料和時間戳記。

source: Clear Diagnostic logs for a Device
pt_br: Limpar os logs de diagnóstico para um Dispositivo
zh_cn: 清除设备的诊断日志
zh_tw: 清除裝置的診斷日誌

source: The *clearAllDiagnosticLogs()* method is used to delete all diagnostic logs for a specific device. The required parameters are deviceTypeId and deviceId. Care should be taken when deleting logs, as logs cannot be recovered once deleted.
pt_br: O método *clearAllDiagnosticLogs()* é utilizado para excluir todos os logs de diagnóstico para um dispositivo específico. Os parâmetros necessários são deviceTypeId e deviceId. Deve-se tomar cuidado ao excluir logs, como logs não podem ser recuperados uma vez excluídos.
zh_cn: *clearAllDiagnosticLogs()* 方法用于删除特定设备的所有诊断日志。必需参数为 deviceTypeId 和 deviceId。删除日志时应慎重，因为日志一旦删除便无法恢复。
zh_tw: *clearAllDiagnosticLogs()* 方法可用來刪除特定裝置的所有診斷日誌。必要的參數是 deviceTypeId 和 deviceId。刪除日誌時請多加留意，因為日誌一旦刪除即無法回復。

source: Add a Diagnostic log
pt_br: Incluir um log de diagnóstico
zh_cn: 添加诊断日志
zh_tw: 新增診斷日誌

source: The *addDiagnosticLog()* method is used to add an entry in the diagnostic log of the device. The log may be pruned as the new entry is added. If no date is supplied, the entry is added with the current date and time. To use this method, first define a 'logs' parameter with the following variables:
pt_br: O método *addDiagnosticLog()* é utilizado para incluir uma entrada no log de diagnóstico do dispositivo. Com a inclusão da nova entrada, o log pode ser removido. Se nenhuma data for fornecido, a entrada é adicionada com a data e a hora atuais. Para utilizar esse método, primeiro defina um parâmetro 'logs' com as seguintes variáveis:
zh_cn: *addDiagnosticLog()* 方法用于在设备的诊断日志中添加条目。添加新条目时可能会对日志进行精简。如果未提供日期，将使用当前日期和时间添加该条目。要使用此方法，首先应使用以下变量定义“logs”参数：
zh_tw: *addDiagnosticLog()* 方法可用來在裝置的診斷日誌中新增項目。日誌可能在新增項目時刪改。如果未提供日期，將會以現行日期和時間新增該項目。若要使用此方法，請先使用下列變數定義 'logs' 參數：

source: message: This variable is mandatory, and contains the new diagnostic message.
pt_br: mensagem: Esta variável é obrigatória, e contém a nova mensagem de diagnóstico.
zh_cn: message：此变量为必需变量，并包含新的诊断消息。
zh_tw: message：此變數是必要的，且包含新的診斷訊息。

source: severity: This variable is optional. If used it corresponds to the severity of the diagnostic log, and should be 0, 1, or 2, corresponding to the informational, warning, and error categories.
pt_br: severidade: Esta variável é opcional. Se utilizado, corresponde à gravidade do log de diagnóstico e deve ser 0, 1, ou 2, correspondendo às categorias informativas, de aviso e de erro.
zh_cn: severity：此变量为可选变量。使用时与诊断日志的严重性相对应，应该为 0、1 或 2，分别对应参考、警告和错误类别。
zh_tw: severity：此變數是選用的。如果使用的話，會對應於診斷日誌的嚴重性，且應為 0、1 或 2，分別對應於參考資訊、警告和錯誤種類。

source: data: This variable is optional, and should contain diagnostic data.
pt_br: dados: Esta variável é opcional e deve conter dados de diagnóstico.
zh_cn: data：此变量为可选变量，应包含诊断数据。
zh_tw: data：此變數是選用的，應包含診斷資料。

source: timestamp: This variable is optional, and contains the date and time of the log entry in ISO8601 format. If this variable is not included, it is automatically added with the current date and time.
pt_br: timestamp: Esta variável é opcional e deve conter a data e hora do log de entrada no formato ISO8601. Se esta variável não estiver incluída, ela é automaticamente incluída com a data e a hora atuais.
zh_cn: timestamp：此变量为可选变量，包含日志条目的日期和时间（ISO8601 格式）。如果未包含此变量，会自动使用当前日期和时间进行添加。
zh_tw: timestamp：此變數是選用的，且包含日誌項目的日期和時間（ISO8601 格式）。如果未包含此變數，將會以現行日期和時間自動加以新增。

source: The other necessary paramteres required in the method are the deviceTypeId and deviceId for the specific device.
pt_br: Os outros parâmetros necessários no método são o deviceTypeId e deviceId para o dispositivo específico.
zh_cn: 方法中必需使用的其他参数为特定设备的 deviceTypeId 和 deviceId。
zh_tw: 此方法中所需的其他參數為特定裝置的 deviceTypeId 和 deviceId。

source: The code sample below contains an example of the method.
pt_br: A amostra de código abaixo contém um exemplo do método.
zh_cn: 以下代码样本包含此方法的示例。
zh_tw: 下列程式碼範例包含此方法的範例。

source: Retrieve a specific Diagnostic log
pt_br: Recuperar um log de diagnóstico específico
zh_cn: 检索特定诊断日志
zh_tw: 擷取特定診斷日誌

source: The *getDiagnosticLog()* method is used to retrieve a specific diagnostic log for a specified device based on the log id. The required parameters for this method are the deviceTypeId, deviceId, and logId.
pt_br: O método *getDiagnosticLog()* é utilizado para recuperar um log de diagnóstico específico para um dispositivo especificado com base no id de log. Os parâmetros requeridos para este método são deviceTypeId, deviceId e logId.
zh_cn: *getDiagnosticLog()* 方法用于根据日志标识检索指定设备的特定诊断日志。此方法必需使用的参数为 deviceTypeId、deviceId 和 logId。
zh_tw: *getDiagnosticLog()* 方法可用來根據日誌 ID 擷取指定裝置的特定診斷日誌。此方法的必要參數是 deviceTypeId、deviceId 和 logId。

source: Delete a Diagnostic log
pt_br: Excluir um log de diagnóstico
zh_cn: 删除诊断日志
zh_tw: 刪除診斷日誌

source: The *deleteDiagnosticLog()* can be used to delete a specific diagnostic log. In order to specify a diagnostic log, the deviceTypeId, deviceId, and logId parameters should be supplied.
pt_br: O método *deleteDiagnosticLog()* pode ser utilizado para excluir um log de diagnóstico específico. Para especificar um log de diagnóstico, os parâmetros deviceTypeId, deviceId e logId devem ser fornecidos.
zh_cn: *deleteDiagnosticLog()* 可用于删除特定诊断日志。为了指定诊断日志，应提供 deviceTypeId、deviceId 和 logId 参数。
zh_tw: *deleteDiagnosticLog()* 可用來刪除特定的診斷日誌。若要指定診斷日誌，應提供 deviceTypeId、deviceId 和 logId 參數。

source: Retrieve Device Error Codes
pt_br: Recuperar Códigos de Erro do Dispositivo
zh_cn: 检索设备错误代码
zh_tw: 擷取裝置錯誤碼

source: The *getAllDiagnosticErrorCodes()* method is used to retrieve all diagnostic error codes associated with a specific device.
pt_br: O método *getAllDiagnosticErrorCodes()* é utilizado para recuperar todos os códigos de erro de diagnóstico associados a um dispositivo específico.
zh_cn: *getAllDiagnosticErrorCodes()* 方法用于检索与特定设备关联的所有诊断错误代码。
zh_tw: *getAllDiagnosticErrorCodes()* 方法可用來擷取與特定裝置相關聯的所有診斷錯誤碼。

source: Clear Diagnostic Error Codes
pt_br: Limpar Códigos de Erro de Diagnóstico
zh_cn: 清除诊断错误代码
zh_tw: 清除診斷錯誤碼

source: The *clearAllErrorCodes()* method is used to clear the list of error codes associated with the device. The list is replaced with a single error code of zero.
pt_br: O método *clearAllErrorCodes()* é utilizado para limpar a lista de códigos de erro associada ao dispositivo. A lista é substituída com um único código de erro de zero.
zh_cn: *clearAllErrorCodes()* 方法用于清除与设备关联的错误代码列表。该列表将替换为单个错误代码 0。
zh_tw: *clearAllErrorCodes()* 方法可用來清除與裝置相關聯的錯誤碼清單。此清單會以單一錯誤碼零來取代。

source: Add single Diagnostic ErrorCode
pt_br: Incluir Diagnóstico único de Código de Erro
zh_cn: 添加单个诊断错误代码
zh_tw: 新增單一診斷 ErrorCode

source: The *addErrorCode()* method is used to add an error code to the list of error codes associated with the device. The list may be pruned as the new entry is added. The parameters required in the method are deviceTypeId, deviceId, and errorCode. The errorCode parameter contains the following variables:
pt_br: O método *addErrorCode()* é utilizado para incluir um código de erro para a lista de códigos de erro associada ao dispositivo. Com a inclusão da nova entrada, a lista pode ser removida. Os parâmetros necessários no método são deviceTypeId, deviceId, e errorCode. O parâmetro errorCode contém as seguintes variáveis:
zh_cn: *addErrorCode()* 方法用于向与设备关联的错误代码列表添加错误代码。添加新条目时可能会对列表进行精简。此方法中必需使用的参数为 deviceTypeId、deviceId 和 errorCode。errorCode 参数包含以下变量：
zh_tw: *addErrorCode()* 方法可用來將錯誤碼新增至與裝置相關聯的錯誤碼清單。清單可能在新增項目時刪改。此方法中所需的參數為 deviceTypeId、deviceId 和 errorCode。errorCode 參數包含下列變數：

source: errorCode: This variable is mandatory and should be set as an integer. This sets the number of the error code to be created.
pt_br: errorCode: Esta variável é obrigatória e deve ser configurada como inteiro. Isso configura o número do código de erro a ser criado.
zh_cn: errorCode：此变量为必需变量，应设置为整数。此变量用于设置要创建的错误代码的编号。
zh_tw: errorCode：此變數是必要的，應設為整數。這會設定所要建立的錯誤碼數目。

source: Connection problem determination
pt_br: Determinação de problema de conexão
zh_cn: 连接问题确定
zh_tw: 連線問題判斷

source: The *getDeviceConnectionLogs()* method is used to list connection log events for a device. This information can be used to help diagnose connectivity problems between the device and the IoT Platform service. The entries record successful connection, unsuccessful connection attempts, intentional disconnection and server-initiated disconnection events.
pt_br: O método *getDeviceConnectionLogs()* é utilizado para listar os eventos de log de conexão para um dispositivo. Essas informações podem ser usadas para ajudar a diagnosticar problemas de conectividade entre o dispositivo e o serviço do IoT Platform. As entradas do registram conexões bem-sucedidas, tentativas de conexão que não foram bem sucedidas, desconexão intencional e eventos de desconexão iniciadas pelo servidor.
zh_cn: *getDeviceConnectionLogs()* 方法用于列示设备的连接日志事件。此信息有助于诊断设备和 IoT Platform 服务之间的连接问题。这些条目记录成功连接、失败连接尝试次数、有意断开连接和服务器发起的断开连接事件。
zh_tw: *getDeviceConnectionLogs()* 方法可用來列出裝置的連線日誌事件。這項資訊有助於診斷裝置與 IoT Platform 服務之間的連線功能問題。這些項目會記錄成功的連線、不成功的連線嘗試、刻意的斷線和伺服器起始的斷線事件。

source: The response includes a list of log entries, containing log messages and timestamps.
pt_br: A resposta inclui uma lista de entradas de log, que contém as mensagens de log e registros.
zh_cn: 响应中包括日志条目列表，其中包含日志消息和时间戳记。
zh_tw: 回應包括日誌項目清單，其中包含日誌訊息和時間戳記。

source: Historical Event Retrieval
pt_br: Recuperação do Evento Histórico
zh_cn: 历史事件检索
zh_tw: 歷程事件擷取

source: These operations can be used to view events from all devices, view events from a device type or to view events for a specific device.
pt_br: Essas operações podem ser utilizadas para visualizar os eventos de todos os dispositivos, visualizar eventos de um tipo de dispositivo ou para visualizar eventos para um dispositivo específico.
zh_cn: 这些操作可用于查看所有设备的事件、查看某种设备类型的事件或查看特定设备的事件。
zh_tw: 這些作業可用來檢視所有裝置的事件、檢視某一裝置類型的事件、檢視特定裝置的事件。

source: Refer to the Historical Event Retrieval section of the `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ for information about the list of query parameters, the request & response model and http status code.
pt_br: Consulte a seção Recuperação do Evento Histórico da `API do IBM IoT Platform <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ para obter informações sobre a lista de parâmetros de consulta, o modelo de solicitação e resposta e o código de status http.
zh_cn: 请参阅 `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ 的“历史事件检索”部分，了解有关查询参数列表、请求和响应模型以及 HTTP 状态码的信息。
zh_tw: 如需查詢參數清單、要求和回應模型與 HTTP 狀態碼的相關資訊，請參閱 `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ 的「歷程事件擷取」區段。

source: View events from all devices
pt_br: Visualizar eventos de todos os dispositivos
zh_cn: 查看所有设备的事件
zh_tw: 檢視所有裝置的事件

source: Method getHistoricalEvents() can be used to view events across all devices registered to the organization.
pt_br: O método getHistoricalEvents() pode ser utilizado para visualizar os eventos através de todos os dispositivos registrados na organização.
zh_cn: getHistoricalEvents() 方法可用于查看向组织注册的所有设备中的事件。
zh_tw: getHistoricalEvents() 方法可用來檢視向組織登錄的所有裝置的事件。

source: The response will contain some parameters and the application needs to retrieve the JSON element *events* from the response to get the array of events returned. Other parameters in the response are required to make further call, for example, the *_bookmark* element can be used to page through results. Issue the first request without specifying a bookmark, then take the bookmark returned in the response and provide it on the request for the next page. Repeat until the end of the result set indicated by the absence of a bookmark. Each request must use exactly the same values for the other parameters, or the results are undefined.
pt_br: A resposta conterá alguns parâmetros e o aplicativo precisa recuperar o elemento JSON *eventos* a partir da resposta para obter a matriz de eventos retornados. Outros parâmetros na resposta são necessários para fazer chamadas adicionais, por exemplo, o elemento *_bookmark* pode ser utilizado para paginar através dos resultados. Emita o primeiro pedido sem especificar um marcador e, em seguida, pegue o marcador retornado na resposta e forneça-o no pedido para a próxima página. Repita até o final do conjunto de resultados indicado pela ausência de um indicador. Cada pedido deve utilizar exatamente os mesmos valores para os outros parâmetros, ou os resultados serão indefinidos.
zh_cn: 响应中将包含某些参数，应用程序需要从响应中检索 JSON 元素 *events*，以获取返回的事件数组。需要使用响应中的其他参数进行进一步的调用，例如，*_bookmark* 元素可用于翻阅结果。在未指定书签的情况下发出第一个请求，然后获取响应中返回的书签，并在请求下一个页面时提供此书签。重复此步骤，直至由缺少书签指示结果集结束为止。每个请求都必须为其他参数使用完全相同的值，否则不会定义结果。
zh_tw: 回應將包含一些參數，且應用程式必須從回應中擷取 JSON 元素 *events*，以取得傳回的事件陣列。要執行進一步的呼叫則需要回應中的其他參數，例如，*_bookmark* 元素可用來翻看結果。在不指定書籤的情況下發出第一個要求，然後取得在回應中傳回的書籤，並將其提供在對下一頁的要求上。重複這些步驟，直到沒有書籤而指出結果集的結尾為止。每個要求都必須對其他參數使用完全相同的值，否則結果將會是未定義。

source: The above snippet returns the events between the start and end time.
pt_br: O snippet acima retorna os eventos entre a hora de início e de encerramento.
zh_cn: 以上片段将返回开始时间和结束时间之间的事件。
zh_tw: 上方的 Snippet 會傳回開始與結束時間之間的事件。

source: View events from a device type
pt_br: Visualizar eventos a partir de um tipo de dispositivo
zh_cn: 查看某种设备类型的事件
zh_tw: 檢視某一裝置類型的事件

source: The *getHistoricalEvents()* method is used to view events from all the devices of a particular device type.
pt_br: O método *getHistoricalEvents()* é utilizado para visualizar os eventos de todos os dispositivos de um tipo de dispositivo específico.
zh_cn: *getHistoricalEvents()* 方法用于查看特定设备类型的所有设备的事件。
zh_tw: *getHistoricalEvents()* 方法可用來檢視特定裝置類型之所有裝置的事件。

source: The response will contain some parameters and the application needs to retrieve the JSON element *events* from the response to get the array of events returned. As mentioned in the *view events from all devices* section, the overloaded method can be used to control the output.
pt_br: A resposta conterá alguns parâmetros e o aplicativo precisa recuperar o elemento JSON *eventos* a partir da resposta para obter a matriz de eventos retornados. Conforme mencionado na seção *visualizar os eventos de todos os dispositivos*, o método sobrecarregado pode ser utilizado para controlar a saída.
zh_cn: 响应中将包含某些参数，应用程序需要从响应中检索 JSON 元素 *events*，以获取返回的事件数组。如 *查看所有设备的事件* 部分中所提及的，重载方法可用于控制输出。
zh_tw: 回應將包含一些參數，且應用程式必須從回應中擷取 JSON 元素 *events*，以取得傳回的事件陣列。如*檢視所有裝置的事件*區段中提到的，您可以使用超載方法來控制輸出。

source: View events from a device
pt_br: Visualizar eventos a partir de um dispositivo
zh_cn: 查看某个设备的事件
zh_tw: 檢視某一裝置的事件

source: The *getHistoricalEvents()* method is used to view events from a specific device. DeviceTypeId and deviceId parameters are required in order to use this method.
pt_br: O método *getHistoricalEvents()* é utilizado para visualizar os eventos a partir de um dispositivo específico. Os parâmetros DeviceTypeId e deviceId são necessários para utilizar esse método.
zh_cn: *getHistoricalEvents()* 方法用于查看特定设备的事件。要使用此方法，就需要使用 DeviceTypeId 和 deviceId 参数。
zh_tw: *getHistoricalEvents()* 方法可用來檢視特定裝置的事件。要使用此方法，必須有 DeviceTypeId 和 deviceId 參數。

source: The response will contain more parameters and application needs to retrieve the JSON element *events* from the response to get the array of events returned.
pt_br: A resposta conterá mais parâmetros e o aplicativo precisa recuperar o elemento JSON *eventos* a partir da resposta para obter a matriz de eventos retornados.
zh_cn: 响应中将包含更多参数，应用程序需要从响应中检索 JSON 元素 *events*，以获取返回的事件数组。
zh_tw: 回應將包含更多參數，且應用程式必須從回應中擷取 JSON 元素 *events*，以取得傳回的事件陣列。
