Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/libraries/python.po
Languages: pt_br, zh_cn, zh_tw

source: Python for Application Developers
pt_br: Python para Desenvolvedores de Aplicativos
zh_cn: 针对应用程序开发者的 Python
zh_tw: 適用於應用程式開發人員的 Python

source: See `iot-python <https://github.com/ibm-messaging/iot-python>`_ in GitHub
pt_br: Consulte `iot-python <https://github.com/ibm-messaging/iot-python>`_ no GitHub
zh_cn: 请参阅 GitHub 中的 `iot-python <https://github.com/ibm-messaging/iot-python>`_
zh_tw: 請參閱 GitHub 中的 `iot-python <https://github.com/ibm-messaging/iot-python>`_

source: See `ibmiotf <https://pypi.python.org/pypi/ibmiotf>`_ on PyPi
pt_br: Consulte `ibmiotf <https://pypi.python.org/pypi/ibmiotf>`_ no PyPi
zh_cn: 请参阅 PyPi 上的 `ibmiotf <https://pypi.python.org/pypi/ibmiotf>`_
zh_tw: 請參閱 PyPi 上的 `ibmiotf <https://pypi.python.org/pypi/ibmiotf>`_

source: Constructor
pt_br: Construtor
zh_cn: 构造方法
zh_tw: 建構子

source: The constructor builds the client instance, and accepts an options dict containing the following definitions:
pt_br: O construtor constrói a instância do cliente e aceita um dic. de opções contendo as seguintes definições:
zh_cn: 此构造方法用于构建客户机实例，并接受包含以下定义的选项字典：
zh_tw: 建構子可建置用戶端實例，並接受包含下列定義的選項 dict：

source: ``org`` - Your organization ID.
pt_br: ``org`` - O ID de sua organização.
zh_cn: “org”- 贵组织的标识。
zh_tw: ``org`` - 組織 ID。

source: ``id`` - The unique ID of your application within your organization.
pt_br: ``id`` - O ID exclusivo de seu aplicativo dentro de sua organização.
zh_cn: “id”- 贵组织内应用程序的唯一标识。
zh_tw: ``id`` - 組織內應用程式的唯一 ID。

source: ``auth-method`` - Method of authentication (the only value currently supported is ``apikey``).
pt_br: ``auth-method`` - Método de autenticação (o único valor suportado atualmente é ``apikey``).
zh_cn: “auth-method”- 认证方法（当前唯一支持的值为“apikey”）。
zh_tw: ``auth-method`` - 鑑別的方法（目前唯一支援的值是 ``apikey``）。

source: ``auth-key`` - API key (required if auth-method is ``apikey``).
pt_br: ``auth-key`` - Chave de API (necessário se o método de autenticação é ``apikey``).
zh_cn: “auth-key”- API 密钥（如果 auth-method 为“apikey”，那么此项为必需项）。
zh_tw: ``auth-key`` - API 金鑰（如果 auth-method 為 ``apikey`` 則需要）。

source: ``auth-token`` - API key token (required if auth-method is ``apikey``).
pt_br: ``auth-token`` - Token de chave da API (necessário se o método de autenticação é ``apikey``).
zh_cn: “auth-token”- API 密钥令牌（如果 auth-method 为“apikey”，那么此项为必需项）。
zh_tw: ``auth-token`` - API 金鑰記號（如果 auth-method 為 ``apikey`` 則需要）。

source: If no options dict is provided, the client will connect to the IoT Platform Quickstart, and default to an unregistered device. The options dict creates definitions which are used to interact with the IoT Platform module.
pt_br: Se nenhum dicionário de opções for fornecido, o cliente se conectará ao IoT Platform Quickstart e padronizará com um dispositivo não registrado. O dicionário de opções cria definições que são usadas para interagir com o módulo do IoT Platform.
zh_cn: 如果不提供选项 dict，那么客户机将连接到 IoT Platform Quickstart，并缺省设置为未注册的设备。选项 dict 可创建用于与 IoT Platform 模块进行交互的定义。
zh_tw: 如果未提供選項字典，用戶端將連接至 IoT Platform Quickstart，並預設為已取消登錄的裝置。選項字典會建立用來與 IoT Platform 模組互動的定義。

source: Using a configuration file
pt_br: Usando um arquivo de configuração
zh_cn: 使用配置文件
zh_tw: 使用配置檔

source: If you are not using an options dict as shown above, you include a configuration file containing an options dict. If you are using a configuration file containing an options dict, use the following code format.
pt_br: Se não estiver usando um dic de opções conforme mostrado acima, você incluirá um arquivo de configuração contendo um dic de opções. Se você estiver usando um arquivo de configuração contendo um dic de opções, use o seguinte formato de código.
zh_cn: 如果未使用以上显示的选项字典，那么可包含带有选项字典的配置文件。如果使用的配置文件包含选项字典，请使用以下代码格式。
zh_tw: 如果您未使用上述的選項 dict，請包括一個含有選項 dict 的配置檔。如果使用的配置檔包含選項 dict，請使用下列程式碼格式。

source: The application configuration file must be in the following format:
pt_br: O arquivo de configuração de aplicativo deve estar no seguinte formato:
zh_cn: 应用程序配置文件必须为以下格式：
zh_tw: 應用程式配置檔必須為下列格式：

source: API calls
pt_br: Chamadas API
zh_cn: API 调用
zh_tw: API 呼叫

source: Each method in the APIClient responds with either a valid response (JSON or boolean) in the case of success or IoTFCReSTException in the case of failure. The IoTFCReSTException contains the following properties that application can parse to get more information about the failure.
pt_br: Cada método no APIClient responde com uma resposta válida (JSON ou booleano) no caso de sucesso ou IoTFCReSTException no caso de falha. O IoTFCReSTException contém as seguintes propriedades que o aplicativo pode analisar para obter mais informações sobre a falha.
zh_cn: APIClient 中的每个方法都会在成功时用有效响应（JSON 或布尔值）进行响应，或在失败时用 IoTFCReSTException 进行响应。IoTFCReSTException 中包含以下属性，应用程序可以解析这些属性来获取有关失败的更多信息。
zh_tw: APIClient 中的每個方法在成功時會以有效回應（JSON 或布林）回應，在失敗時則以 IoTFCReSTException 回應。IoTFCReSTException 包含下列可讓應用程式剖析以取得失敗之相關資訊的內容。

source: httpcode - HTTP Status Code
pt_br: httpcode – Código de Status HTTP
zh_cn: httpcode - HTTP 状态码
zh_tw: httpcode - HTTP 狀態碼

source: message - Exception message containing the reason for the failure
pt_br: mensagem - Mensagem de exceção que contém a razão para a falha
zh_cn: message - 包含失败原因的异常消息
zh_tw: message - 包含失敗原因的異常狀況訊息

source: response - JsonElement containing the partial response if any otherwise null
pt_br: resposta - JsonElement de resposta contendo a resposta parcial, se qualquer caso contrário, nulo
zh_cn: response - 如果存在响应，为包含部分响应的 JsonElement，否则为空
zh_tw: response - 包含部分回應的 JsonElement（如果有），否則為空值

source: So in the case of failure, application needs to parse the response to see if the action is partially successful or not.
pt_br: Portanto, no caso de falha, o aplicativo precisa para analisar a resposta para ver se a ação foi parcialmente bem-sucedida ou não.
zh_cn: 因此，在失败情况下，应用程序需要解析此响应以确认操作是否部分成功。
zh_tw: 因此，如果失敗，應用程式必須剖析回應，以瞭解動作是否已部分成功。

source: Subscribing to device events
pt_br: Assinando eventos de dispositivo
zh_cn: 预订设备事件
zh_tw: 訂閱裝置事件

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
pt_br: Eventos são o mecanismo pelo qual dispositivos publicam dados no IoT Platform. O dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.
zh_cn: 事件是设备用于将数据发布到 IoT Platform 的机制。设备控制事件的内容，并为其发送的每个事件分配名称。
zh_tw: 事件是裝置藉以將資料發佈到 IoT Platform 的機制。裝置可控制事件的內容，並為它傳送的每一個事件指派一個名稱。

source: When an event is received by the IoT Platform the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
pt_br: Quando um evento é recebido pelo IoT Platform, as credenciais da conexão na qual o evento foi recebido são usadas para determinar a partir de qual dispositivo o evento foi enviado. Com essa arquitetura, é impossível para um dispositivo personificar outro dispositivo.
zh_cn: IoT Platform 接收到事件时，将使用用于接收该事件的连接的凭证来确定是从哪个设备发送了该事件。由于使用这种体系结构，设备将无法模拟其他设备。
zh_tw: 當 IoT Platform 接收事件時，會使用接收事件的連線認證來判斷是哪個裝置傳送了事件。使用此架構，裝置就不可能假冒成另一個裝置。

source: By default, applications will subscribe to all events from all connected devices. Use the type, id, event and msgFormat parameters to control the scope of the subscription. A single client can support multiple subscriptions. The code samples below give examples of how to subscribe to devices dependent on device type, id, event and msgFormat parameters.
pt_br: Por padrão, os aplicativos assinarão todos os eventos de todos os dispositivos conectados. Use os parâmetros de tipo, ID, evento e msgFormat para controlar o escopo da assinatura. Um único cliente pode suportar várias assinaturas. As amostras de código abaixo fornecem exemplos de como assinar os dispositivos dependendo dos parâmetros de tipo de dispositivo, ID, evento e msgFormat.
zh_cn: 缺省情况下，应用程序将预订来自所有已连接设备的所有事件。使用 type、id、event 和 msgFormat 参数来控制预订的作用域。单个客户机可支持多个预订。以下代码样本提供了示例，说明如何预订取决于设备的 type、id、event 和 msgFormat 参数的设备。
zh_tw: 依預設，應用程式將訂閱所有已連接裝置的所有事件。可使用 type、id、event 和 msgFormat 參數來控制訂閱的範圍。單一用戶端可以支援多個訂閱。下列程式碼範例示範如何根據裝置的 type、id、event 和 msgFormat 參數來訂閱裝置。

source: To subscribe to all events from all devices
pt_br: Para assinar todos os eventos de todos os dispositivos
zh_cn: 预订来自所有设备的所有事件
zh_tw: 訂閱所有裝置的所有事件

source: To subscribe to all events from all devices of a specific type
pt_br: Para assinar todos os eventos de todos os dispositivos de um tipo específico
zh_cn: 预订来自特定类型的所有设备的所有事件
zh_tw: 訂閱特定類型之所有裝置的所有事件

source: To subscribe to a specific event from all devices
pt_br: Para assinar um evento específico de todos os dispositivos
zh_cn: 预订来自所有设备的特定事件
zh_tw: 訂閱所有裝置的特定事件

source: To subscribe to a specific event from two or more different devices
pt_br: Para assinar um evento específico de dois ou mais dispositivos diferentes
zh_cn: 预订来自两个或更多不同设备的特定事件
zh_tw: 訂閱兩個以上不同裝置的特定事件

source: To subscribe to all events published by a device in json format
pt_br: Para assinar todos os eventos publicados por um dispositivo no formato json
zh_cn: 预订设备发布的 json 格式的所有事件
zh_tw: 訂閱裝置已發佈且為 Json 格式的所有事件

source: Handling events from devices
pt_br: Manipulando eventos a partir de dispositivos
zh_cn: 处理来自设备的事件
zh_tw: 處理裝置的事件

source: To process the events received by your subscriptions you need to register an event callback method. The messages are returned as an instance of the Event class:
pt_br: Para processar os eventos recebidos por suas assinaturas, é necessário registrar um método de retorno de chamada de evento. As mensagens são retornadas como uma instância na Classe de eventos:
zh_cn: 要处理您的预订接收的事件，需要注册事件回调方法。消息将作为 Event 类的实例返回：
zh_tw: 若要處理訂閱所接收的事件，您需要登錄事件回呼方法。會以 Event 類別的實例傳回訊息：

source: event.device - string (uniquely identifies the device across all types of devices in the organization)
pt_br: event.device - sequência (identifica exclusivamente o dispositivo em todos os tipos de dispositivos na organização)
zh_cn: event.device - 字符串（在组织内所有类型的设备中唯一标识该设备）
zh_tw: event.device - 字串（可在組織中所有裝置類型之間唯一識別該裝置）

source: event.deviceType - string
pt_br: event.deviceType - sequência
zh_cn: event.deviceType - 字符串
zh_tw: event.deviceType - 字串

source: event.deviceId - string
pt_br: event.deviceId - sequência
zh_cn: event.deviceId - 字符串
zh_tw: event.deviceId - 字串

source: event.event - string
pt_br: event.event - sequência
zh_cn: event.event - 字符串
zh_tw: event.event - 字串

source: event.format - string
pt_br: event.format - sequência
zh_cn: event.format - 字符串
zh_tw: event.format - 字串

source: event.data - dict
pt_br: event.data - dic
zh_cn: event.data - 字典

source: event.timestamp - datetime
pt_br: event.timestamp - data/hora
zh_cn: event.timestamp - 日期时间
zh_tw: event.timestamp - 日期時間

source: Subscribing to device status
pt_br: Assinando o status do dispositivo
zh_cn: 预订设备状态
zh_tw: 訂閱裝置狀態

source: By default, this will subscribe to status updates for all connected devices. Use the type and id parameters to control the scope of the subscription. A single client can support multiple subscriptions.
pt_br: Por padrão, este assinará as atualizações de status para todos os dispositivos conectados. Use os parâmetros de tipo e ID para controlar o escopo da assinatura. Um único cliente pode suportar várias assinaturas.
zh_cn: 缺省情况下，这将预订所有已连接设备的状态更新。使用 type 和 id 参数控制预订的作用域。单个客户机可支持多个预订。
zh_tw: 依預設，這會訂閱所有連線裝置的狀態更新。請使用 type 和 id 參數來控制訂閱的範圍。單一用戶端可支援多個訂閱。

source: Subscribe to status updates for all devices
pt_br: Assinar as atualizações de status para todos os dispositivos
zh_cn: 预订所有设备的状态更新
zh_tw: 訂閱所有裝置的狀態更新項目

source: Subscribe to status updates for all devices of a specific type
pt_br: Assinar as atualizações de status para todos os dispositivos de um tipo específico
zh_cn: 预订特定类型的所有设备的状态更新
zh_tw: 訂閱特定類型的所有裝置的狀態更新項目

source: Subscribe to status updates for two different devices
pt_br: Assinar as atualizações de status para dois dispositivos diferentes
zh_cn: 预订两种不同设备的状态更新
zh_tw: 訂閱兩個不同裝置的狀態更新項目

source: Handling status updates from devices
pt_br: Manipulando atualizações de status a partir de dispositivos
zh_cn: 处理来自设备的状态更新
zh_tw: 處理裝置的狀態更新項目

source: To process the status updates received by your subscriptions you need to register an event callback method. The messages are returned as an instance of the Status class:
pt_br: Para processar as atualizações de status recebidas por suas assinaturas, você precisa registrar um método de retorno de chamada de evento. As mensagens são retornadas como uma instância da classe Status:
zh_cn: 要处理您的预订接收的状态更新，需要注册事件回调方法。消息将作为 Status 类的实例返回：
zh_tw: 若要處理訂閱所接收的狀態更新，您需要登錄事件回呼方法。會以 Status 類別的實例傳回訊息：

source: The following properties are set for both "Connect" and "Disconnect" status events:
pt_br: As propriedades a seguir são configuradas para os eventos de status "Connect" e "Disconnect":
zh_cn: 为“连接”和“断开连接”状态事件设置了以下属性：
zh_tw: 已同時對「連接」和「中斷連接」狀態事件設定了下列內容：

source: status.clientAddr - string
pt_br: status.clientAddr - sequência
zh_cn: status.clientAddr - 字符串
zh_tw: status.clientAddr - 字串

source: status.protocol - string
pt_br: status.protocol - sequência
zh_cn: status.protocol - 字符串
zh_tw: status.protocol - 字串

source: status.clientId - string
pt_br: status.clientId - sequência
zh_cn: status.clientId - 字符串
zh_tw: status.clientId - 字串

source: status.user - string
pt_br: status.user - sequência
zh_cn: status.user - 字符串
zh_tw: status.user - 字串

source: status.time - datetime
pt_br: status.time - data/hora
zh_cn: status.time - 日期时间
zh_tw: status.time - 日期時間

source: status.action - string
pt_br: status.action - sequência
zh_cn: status.action - 字符串
zh_tw: status.action - 字串

source: status.connectTime - datetime
pt_br: status.connectTime - data/hora
zh_cn: status.connectTime - 日期时间
zh_tw: status.connectTime - 日期時間

source: status.port - integer
pt_br: status.port - número inteiro
zh_cn: status.port - 整数
zh_tw: status.port - 整數

source: The following properties are only set when the action is "Disconnect":
pt_br: As propriedades a seguir são configuradas apenas quando a ação é "Disconnect":
zh_cn: 仅当操作为“断开连接”时，才会设置以下属性：
zh_tw: 只有當動作為「中斷連接」時，才會設定下列內容：

source: status.writeMsg - integer
pt_br: status.writeMsg - número inteiro
zh_cn: status.writeMsg - 整数
zh_tw: status.writeMsg - 整數

source: status.readMsg - integer
pt_br: status.readMsg - número inteiro
zh_cn: status.readMsg - 整数
zh_tw: status.readMsg - 整數

source: status.reason - string
pt_br: status.reason - sequência
zh_cn: status.reason - 字符串
zh_tw: status.reason - 字串

source: status.readBytes - integer
pt_br: status.readBytes - número inteiro
zh_cn: status.readBytes - 整数
zh_tw: status.readBytes - 整數

source: status.writeBytes - integer
pt_br: status.writeBytes - número inteiro
zh_cn: status.writeBytes - 整数
zh_tw: status.writeBytes - 整數

source: Publishing events from devices
pt_br: Publicando eventos a partir de dispositivos
zh_cn: 发布来自设备的事件
zh_tw: 從裝置發佈事件

source: Applications can publish events as if they originated from a Device
pt_br: Os aplicativos podem publicar eventos como se eles fossem originados de um Dispositivo
zh_cn: 应用程序在发布事件时可将事件视为如同源自设备一样
zh_tw: 應用程式可當成事件是從裝置產生來發佈事件

source: Publishing commands to devices
pt_br: Publicando comandos para dispositivos
zh_cn: 将命令发布到设备
zh_tw: 對裝置發佈指令

source: Applications can publish commands to connected devices
pt_br: Os aplicativos podem publicar comandos para dispositivos conectados
zh_cn: 应用程序可将命令发布到已连接设备
zh_tw: 應用程式可對連接的裝置發佈指令

source: Organization details
pt_br: Detalhes da organização
zh_cn: 组织详细信息
zh_tw: 組織詳細資料

source: Applications can use the ``getOrganizationDetails()`` method to retrieve the details about the configuration of the organization.
pt_br: Os aplicativos podem usar o método ``getOrganizationDetails ()`` para recuperar os detalhes sobre a configuração da organização.
zh_cn: 应用程序可以使用“getOrganizationDetails()”方法来检索有关组织的配置的详细信息。
zh_tw: 應用程式可使用 ``getOrganizationDetails()`` 方法來擷取組織配置的詳細資料。

source: Refer to the Organization Configuration section of the `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ for information about the request & response model and http status code.
pt_br: Consulte a seção Configuração da Organização da `API do IBM IoT Platform <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ para obter informações sobre o modelo de solicitação e resposta e o código de status http.
zh_cn: 请参阅 `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ 的“组织配置”部分，了解有关请求和响应模型以及 HTTP 状态码的信息。
zh_tw: 如需要求和回應模型與 HTTP 狀態碼的相關資訊，請參閱 `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ 的「組織配置」區段。

source: Bulk device operations
pt_br: Operações do dispositivo em massa
zh_cn: 批量设备操作
zh_tw: 大量裝置作業

source: Applications can use bulk operations to get, add or remove devices in bulk.
pt_br: Os aplicativos podem usar operações em massa para obter, incluir ou remover dispositivos em massa.
zh_cn: 应用程序可以使用批量操作成批获取、添加或移除设备。
zh_tw: 應用程式可以使用大量作業，來大量取得、新增或移除裝置。

source: Refer to the Bulk Operations section of the `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__ for information about the list of query parameters, the request & response model and http status code.
pt_br: Consulte a seção Operações em Massa da `API IBM IoT Platform <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__ para obter informações sobre a lista de parâmetros de consulta, o modelo de solicitação e resposta e o código de status http.
zh_cn: 请参阅 `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__ 中的“批量操作”部分，了解有关查询参数列表、请求和响应模型以及 HTTP 状态码的信息。
zh_tw: 如需查詢參數清單、要求和回應模型與 HTTP 狀態碼的相關資訊，請參閱 `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Bulk_Operations/>`__ 的「大量作業」區段。

source: Retrieve device information
pt_br: Recuperar informações do dispositivo
zh_cn: 检索设备信息
zh_tw: 擷取裝置資訊

source: Bulk device information can be retrieved using the ``getAllDevices()`` method. This method retrieves information on all registered devices in the organization, each request can contain a maximum of 512KB.
pt_br: As informações sobre o dispositivo em massa podem ser recuperadas usando o método ``getAllDevices()``. Esse método recupera informações sobre todos os dispositivos registrados na organização, cada pedido pode conter um máximo de 512KB.
zh_cn: 可以使用“getAllDevices()”方法检索批量设备信息。此方法可检索组织内所有已注册设备的信息，每个请求最多可包含 512KB。
zh_tw: 可使用 ``getAllDevices()`` 方法來擷取大量裝置資訊。此方法會擷取組織中所有已登錄裝置的資訊，每個要求最多可包含 512KB。

source: The response contains parameters required by the application to retrieve the dictionary *results* from the response to get the array of devices returned. Other parameters in the response are required to make further calls, for example, the ``_bookmark`` element can be used to page through results. Issue the first request without specifying a bookmark, then take the bookmark returned in the response and provide it on the request for the next page. Repeat until the end of the result set indicated by the absence of a bookmark. Each request must use exactly the same values for the other parameters, or the results are undefined.
pt_br: A resposta contém os parâmetros necessários pelo aplicativo para recuperar o dicionário *resultados* a partir da resposta para obter a matriz de dispositivos retornados. Outros parâmetros na resposta são necessários para fazer chamadas adicionais, por exemplo, o elemento ``_bookmark`` pode ser usado para paginar por meio dos resultados. Emita o primeiro pedido sem especificar um marcador e, em seguida, pegue o marcador retornado na resposta e forneça-o no pedido para a próxima página. Repita até o final do conjunto de resultados indicado pela ausência de um indicador. Cada pedido deve utilizar exatamente os mesmos valores para os outros parâmetros, ou os resultados serão indefinidos.
zh_cn: 响应中包含应用程序从响应中检索字典 *results* 以获取返回的设备数组所需的参数。需要使用响应中的其他参数进行进一步的调用，例如，“_bookmark”元素可用于翻阅结果。在未指定书签的情况下发出第一个请求，然后获取响应中返回的书签，并在请求下一个页面时提供此书签。重复此步骤，直至由缺少书签指示结果集结束为止。每个请求都必须为其他参数使用完全相同的值，否则不会定义结果。
zh_tw: 回應包含應用程式要從回應中擷取字典 *results*，以取得傳回的裝置陣列所需的參數。若要執行進一步的呼叫，則需要回應中的其他參數，例如，``_bookmark`` 元素可用來翻看結果。在不指定書籤的情況下發出第一個要求，然後取得在回應中傳回的書籤，並將其提供在對下一頁的要求上。重複這些步驟，直到沒有書籤而指出結果集的結尾為止。每個要求都必須對其他參數使用完全相同的值，否則結果將會是未定義。

source: Add Devices in bulk
pt_br: Incluir Dispositivos em massa
zh_cn: 批量添加设备
zh_tw: 大量新增裝置

source: The ``addMultipleDevices()`` method can be used to add one or more devices to your IoT Platform organization, the maximum size of a request is set to 512KB. The response will contain the generated authentication tokens for each added device. These authentication tokens must be recorded when processing the response, as lost authentication tokens cannot be retrieved.
pt_br: O método ``addMultipleDevices()`` pode ser usado para incluir um ou mais dispositivos em sua organização do IoT Platform, o tamanho máximo de uma solicitação é configurado como 512 KB. A resposta conterá os tokens de autenticação gerados para cada dispositivo incluído. Esses tokens de autenticação devem ser registrados ao processar a resposta, como os tokens de autenticação perdidos não podem ser recuperados.
zh_cn: “addMultipleDevices()”方法可用于将一个或多个设备添加到您的 IoT Platform 组织中，请求的最大大小设置为 512KB。响应将包含为每个已添加设备生成的认证令牌。处理响应时必须记录这些认证令牌，因为无法检索丢失的认证令牌。
zh_tw: ``addMultipleDevices()`` 方法可用來將一或多個裝置新增至您的 IoT Platform 組織，要求的大小上限會設為 512KB。回應將包含為每個新增的裝置產生的鑑別記號。這些鑑別記號必須在處理回應時記錄下來，因為遺失的鑑別記號將無法擷取。

source: Delete Devices in bulk
pt_br: Excluir dispositivos em massa
zh_cn: 批量删除设备
zh_tw: 大量刪除裝置

source: The ``deleteMultipleDevices()`` method can be used to delete multiple devices from an IoT Platform organization, each request can contain a maximum of 512KB.
pt_br: O método ``deleteMultipleDevices()`` pode ser usado para excluir vários dispositivos a partir de uma organização do IoT Platform, cada solicitação pode conter um máximo de 512 KB.
zh_cn: “deleteMultipleDevices()”方法可用于从 IoT Platform 组织中删除多个设备，每个请求最多可包含 512KB。
zh_tw: ``deleteMultipleDevices()`` 方法可用來從 IoT Platform 組織中刪除多個裝置，每個要求最多可包含 512KB。

source: Device Type Operations
pt_br: Operações do Tipo de Dispositivo
zh_cn: 设备类型操作
zh_tw: 裝置類型作業

source: Device types can be used as templates for adding device information to devices as they are added to your organization. Applications can use the IoT Platform API to list, create, delete, view, or update device types in your organization.
pt_br: Os tipos de dispositivos podem ser utilizados como modelos para incluir informações sobre o dispositivo para dispositivos, à medida que eles são incluídos em sua organização. Os aplicativos podem usar a API do IoT Platform para listar, criar, excluir, visualizar ou atualizar tipos de dispositivos em sua organização.
zh_cn: 在组织中添加设备时，设备类型可用作向这些设备添加设备信息的模板。应用程序可以使用 IoT Platform API 来列示、创建、删除、查看或更新您组织内的设备类型。
zh_tw: 裝置類型可作為裝置新增至您的組織時，用來將裝置資訊新增至這些裝置的範本。應用程式可使用 IoT Platform API 來列出、建立、刪除、檢視或更新您組織中的裝置類型。

source: Refer to the Device Types section of the `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ documentation for information about the list of query parameters, the request & response model, and http status codes.
pt_br: Consulte a seção Tipos de Dispositivo da documentação da `API do IBM IoT Platform <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ para obter informações sobre a lista de parâmetros de consulta, o modelo de solicitação e resposta e códigos de status http.
zh_cn: 请参阅 `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ 文档的“设备类型”部分，了解有关查询参数列表、请求和响应模型以及 HTTP 状态码的信息。
zh_tw: 如需查詢參數清單、要求和回應模型與 HTTP 狀態碼的相關資訊，請參閱 `IBM IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ 文件的「裝置類型」區段。

source: Get all Device Types
pt_br: Obter todos os Tipos de Dispositivos
zh_cn: 获取所有设备类型
zh_tw: 取得所有裝置類型
