Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/libraries/python.po
Languages: pt_br, zh_cn, zh_tw

source: The ``getAllDeviceTypes()`` method can be used to retrieve all device types in your IoT Platform organization. The response contains parameters and application needs to retrieve the dictionary *results* from the response to get the array of devices returned. Other parameters in the response are required to make further call, for example, the *_bookmark* element can be used to page through results. Issue the first request without specifying a bookmark, then take the bookmark returned in the response and provide it on the request for the next page. Repeat until the end of the result set indicated by the absence of a bookmark. Each request must use exactly the same values for the other parameters, or the results are undefined.
pt_br: O método ``getAllDeviceTypes()`` pode ser usado para recuperar todos os tipos de dispositivos em sua organização do IoT Platform. A resposta contém parâmetros e aplicativo precisa recuperar o dicionário *resultados* a partir da resposta para obter a matriz de dispositivos retornados. Outros parâmetros na resposta são necessários para fazer chamadas adicionais, por exemplo, o elemento *_bookmark* pode ser utilizado para paginar através dos resultados. Emita o primeiro pedido sem especificar um marcador e, em seguida, pegue o marcador retornado na resposta e forneça-o no pedido para a próxima página. Repita até o final do conjunto de resultados indicado pela ausência de um indicador. Cada pedido deve utilizar exatamente os mesmos valores para os outros parâmetros, ou os resultados serão indefinidos.
zh_cn: “getAllDeviceTypes()”方法可用于在您的 IoT Platform 组织中检索所有设备类型。响应中包含参数，应用程序需要从响应中检索字典 *results* 以获取返回的设备数组。需要使用响应中的其他参数进行进一步的调用，例如，*_bookmark* 元素可用于翻阅结果。在未指定书签的情况下发出第一个请求，然后获取响应中返回的书签，并在请求下一个页面时提供此书签。重复此步骤，直至由缺少书签指示结果集结束为止。每个请求都必须为其他参数使用完全相同的值，否则不会定义结果。
zh_tw: ``getAllDeviceTypes()`` 方法可用來擷取您的 IoT Platform 組織中的所有裝置類型。回應包含應用程式要從回應中擷取字典 *results*，以取得傳回的裝置陣列所需的參數。要執行進一步的呼叫則需要回應中的其他參數，例如，*_bookmark* 元素可用來翻看結果。在不指定書籤的情況下發出第一個要求，然後取得在回應中傳回的書籤，並將其提供在對下一頁的要求上。重複這些步驟，直到沒有書籤而指出結果集的結尾為止。每個要求都必須對其他參數使用完全相同的值，否則結果將會是未定義。

source: Add a Device Type
pt_br: Incluir um Tipo de Dispositivo
zh_cn: 添加设备类型
zh_tw: 新增裝置類型

source: The ``addDeviceType()`` method can be used to register a device type to IoT Platform. In each request, you must first define the device information, and device metadata elements which you want to be applied to all devices of this type. The device information element is comprised of several variables, including, serial number, manufacturer, model, class, description, firmware and hardware versions, and descriptive location. The metadata element is comprised of custom variables and values which can be defined by the user.
pt_br: O método ``addDeviceType()`` pode ser usado para registrar um tipo de dispositivo para o IoT Platform. Em cada pedido, deve-se primeiro definir as informações sobre o dispositivo, e os elementos de metadados do dispositivo que você deseja que sejam aplicadas a todos os dispositivos desse tipo. O elemento de informações sobre o dispositivo é composto por várias variáveis, incluindo, número de série, fabricante, modelo, classe, descrição, firmware e as versões de hardware e local descritivo. O elemento de metadados é composto por variáveis e valores customizados que podem ser definidos pelo usuário.
zh_cn: “addDeviceType()”方法可用于向 IoT Platform 注册设备类型。在每个请求中，您都必须先定义设备信息，以及要应用于此类型所有设备的设备元数据元素。该设备信息元素由多个变量组成，包括序列号、制造商、型号、种类、描述、固件和硬件版本以及描述性位置。元数据元素由用户可定义的定制变量和值组成。
zh_tw: ``addDeviceType()`` 方法可用來將裝置類型登錄至 IoT Platform。在每個要求中，您必須先定義您要對所有屬於此類型的裝置套用的裝置資訊及裝置 meta 資料元素。裝置資訊元素由數個變數所組成，包括序號、製造商、機型、類別、說明、韌體和硬體版本以及敘述性位置。meta 資料元素由可由使用者定義的自訂變數和值組成。

source: Delete a Device Type
pt_br: Excluir um Tipo de Dispositivo
zh_cn: 删除设备类型
zh_tw: 刪除裝置類型

source: The ``deleteDeviceType()`` method can be used to delete a device type from your IoT Platform organization.
pt_br: O método ``deleteDeviceType()`` pode ser usado para excluir um tipo de dispositivo da sua organização do IoT Platform.
zh_cn: “deleteDeviceType()”方法可用于从 IoT Platform 组织中删除设备类型。
zh_tw: ``deleteDeviceType()`` 方法可用來從您的 IoT Platform 組織中刪除裝置類型。

source: Get a Device Type
pt_br: Obter um Tipo de Dispositivo
zh_cn: 获取设备类型
zh_tw: 取得裝置類型

source: The ``getDeviceType()`` method retrieves information on a given device type. The ``typeId`` of the device type you wish to retrieve must be used as a parameter
pt_br: O método ``getDeviceType()`` recupera informações sobre um tipo de dispositivo especificado. O ``typeId`` do tipo de dispositivo que você deseja recuperar deve ser usado como um parâmetro
zh_cn: “getDeviceType()”方法可检索有关给定设备类型的信息。必须将希望检索的设备类型的“typeId”用作参数
zh_tw: ``getDeviceType()`` 方法可擷取給定裝置類型上的資訊。必須使用您要擷取之裝置類型的 ``typeId`` 作為參數。

source: Update a Device Type
pt_br: Atualizar um Tipo de Dispositivo
zh_cn: 更新设备类型
zh_tw: 更新裝置類型

source: The ``updateDeviceType()`` method can be used to modify the properties of a device type. When using this method, several parameters must be defined. Firstly, the ``typeId`` of the device type to be updated must be specified, then the ``description``, ``deviceInfo``, and ``metadata`` elements.
pt_br: O método ``updateDeviceType()`` pode ser usado para modificar as propriedades de um tipo de dispositivo. Ao utilizar esse método, vários parâmetros devem ser definidos. Em primeiro lugar, o ``typeId`` do tipo de dispositivo a ser atualizado deve ser especificado, em seguida, os elementos ``description``, ``deviceInfo`` e ``metadata``.
zh_cn: “updateDeviceType()”方法可用于修改设备类型的属性。在使用此方法时，必须定义多个参数。首先，必须指定要更新的设备的“typeId”，然后是“description”、“deviceInfo”和“metadata”元素。
zh_tw: ``updateDeviceType()`` 方法可用來修改裝置類型的內容。使用此方法時，必須定義數個參數。首先，必須指定要更新之裝置類型的 ``typeId``，然後指定 ``description``、``deviceInfo`` 和 ``metadata`` 元素。

source: Device operations
pt_br: Operações de dispositivo
zh_cn: 设备操作
zh_tw: 裝置作業

source: Device operations made available through the API include listing, adding, removing, viewing, updating, viewing location and viewing device management information of devices in an IoT Platform organization.
pt_br: Operações de dispositivo disponibilizadas por meio da API incluem listagem, inclusão, remoção, visualização, atualização, visualização do local e visualização de informações de gerenciamento de dispositivo de dispositivos em uma organização do IoT Platform.
zh_cn: 通过 API 提供的设备操作包括在 IoT Platform 组织中进行列示、添加、移除、查看和更新设备，以及查看设备的位置和查看设备的管理信息。
zh_tw: 透過 API 來啟用的裝置作業，包括對 IoT Platform 組織中的裝置進行列出、新增、移除、檢視、更新、檢視位置，以及檢視裝置管理資訊。

source: Refer to the Device section of the `IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ for information about the list of query parameters, the request & response model and http status code.
pt_br: Consulte a seção Dispositivo da `API do IoT Platform <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ para obter informações sobre a lista de parâmetros de consulta, o modelo de solicitação e resposta e o código de status http.
zh_cn: 请参阅 `IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ 的“设备”部分，了解有关查询参数列表、请求和响应模型以及 HTTP 状态码的信息。
zh_tw: 如需查詢參數清單、要求和回應模型與 HTTP 狀態碼的相關資訊，請參閱 `IoT Platform API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html>`__ 的「裝置」區段。

source: Get Devices of a particular Device Type
pt_br: Obter Dispositivos de um tipo de dispositivo específico
zh_cn: 获取特定设备类型的设备
zh_tw: 取得特定裝置類型的裝置

source: The *retrieveDevices()* method can be used to retrieve all the devices of a particular device type in an organization from IoT Platform. For example,
pt_br: O método *retrieveDevices()* pode ser usado para recuperar todos os dispositivos de um tipo de dispositivo específico em uma organização do IoT Platform. Por exemplo,
zh_cn: *retrieveDevices()* 方法可用于从 IoT Platform 检索组织内特定设备类型的所有设备。例如，
zh_tw: *retrieveDevices()* 方法可用來擷取 IoT Platform 組織中特定裝置類型的所有裝置。例如，

source: The response contains parameters and application needs to retrieve the dictionary *results* from the response to get the array of devices returned. Other parameters in the response are required to make further call, for example, the *_bookmark* element can be used to page through results. Issue the first request without specifying a bookmark, then take the bookmark returned in the response and provide it on the request for the next page. Repeat until the end of the result set indicated by the absence of a bookmark. Each request must use exactly the same values for the other parameters, or the results are undefined.
pt_br: A resposta contém parâmetros e aplicativo precisa recuperar o dicionário *resultados* a partir da resposta para obter a matriz de dispositivos retornados. Outros parâmetros na resposta são necessários para fazer chamadas adicionais, por exemplo, o elemento *_bookmark* pode ser utilizado para paginar através dos resultados. Emita o primeiro pedido sem especificar um marcador e, em seguida, pegue o marcador retornado na resposta e forneça-o no pedido para a próxima página. Repita até o final do conjunto de resultados indicado pela ausência de um indicador. Cada pedido deve utilizar exatamente os mesmos valores para os outros parâmetros, ou os resultados serão indefinidos.
zh_cn: 响应中包含参数，应用程序需要从响应中检索字典 *results* 以获取返回的设备数组。需要使用响应中的其他参数进行进一步的调用，例如，*_bookmark* 元素可用于翻阅结果。在未指定书签的情况下发出第一个请求，然后获取响应中返回的书签，并在请求下一个页面时提供此书签。重复此步骤，直至由缺少书签指示结果集结束为止。每个请求都必须为其他参数使用完全相同的值，否则不会定义结果。
zh_tw: 回應包含應用程式要從回應中擷取字典 *results*，以取得傳回的裝置陣列所需的參數。要執行進一步的呼叫則需要回應中的其他參數，例如，*_bookmark* 元素可用來翻看結果。在不指定書籤的情況下發出第一個要求，然後取得在回應中傳回的書籤，並將其提供在對下一頁的要求上。重複這些步驟，直到沒有書籤而指出結果集的結尾為止。每個要求都必須對其他參數使用完全相同的值，否則結果將會是未定義。

source: In order to pass the *_bookmark* or any other condition, the overloaded method must be used. The overloaded method takes the parameters in the form of dictionary as shown below,
pt_br: A fim de transmitir o *_bookmark* ou qualquer outra condição, o método sobrecarregado deverá ser utilizado. O método sobrecarregado utiliza os parâmetros no formato de dicionário conforme mostrado abaixo,
zh_cn: 为了传递 *_bookmark* 或任何其他条件，必须使用重载方法。重载方法使用字典格式的参数，如下所示，
zh_tw: 若要傳遞 *_bookmark* 或任何其他條件，必須使用超載方法。超載方法會使用字典格式的參數，如下所示。

source: The above snippet sorts the response based on device id and uses the bookmark to page through the results.
pt_br: O fragmento acima classifica a resposta baseada no id do dispositivo e usa o marcador para navegar através dos resultados.
zh_cn: 以上片段根据设备标识对响应进行排序，并使用书签对结果进行分页。
zh_tw: 上方的 Snippet 會根據裝置 ID 來排序回應，並使用書籤將結果分頁。

source: Add a Device
pt_br: Incluir um dispositivo
zh_cn: 添加设备
zh_tw: 新增裝置

source: The *registerDevice()* method is used to add a device to an IoT Platform organization. The *registerDevice()* method adds a single device to your IoT Platform organization. The parameters which can be set when adding a device are:
pt_br: O método *registerDevice()* é usado para incluir um dispositivo em uma organização do IoT Platform. O método *registerDevice()* inclui um único dispositivo em sua organização do IoT Platform. Os parâmetros que podem ser definidos ao incluir um dispositivo são:
zh_cn: *registerDevice()* 方法用于向 IoT Platform 组织添加设备。*registerDevice()* 方法可将单个设备添加到您的 IoT Platform 组织中。添加设备时可以设置的参数有：
zh_tw: *registerDevice()* 方法可用來將裝置新增至 IoT Platform 組織。*registerDevice()* 方法可將單一裝置新增至您的 IoT Platform 組織。可在新增裝置時設定的參數為：

source: deviceTypeId: *Optional*. Assigns a device type to the device. Where there is a clash between variables defined by the device type and variables defined by under deviceInfo, the device specific variables will take precedence.
pt_br: deviceTypeId: *Opcional*. Atribui um tipo de dispositivo para o dispositivo. Onde houver um conflito entre as variáveis definidas pelo tipo de dispositivo e as variáveis definidas sob o deviceInfo, as variáveis específicas do dispositivo terão precedência.
zh_cn: deviceTypeId：*可选*。为设备指定设备类型。当设备类型定义的变量和 deviceInfo 下定义的变量之间存在冲突时，优先使用特定于设备的变量。
zh_tw: deviceTypeId：*選用*。將裝置類型指派給裝置。在裝置類型所定義的變數與 deviceInfo 所定義的變數之間有衝突的情況下，會優先使用裝置特定變數。

source: deviceId: *Mandatory*.
pt_br: deviceId: *Obrigatório*.
zh_cn: deviceId：*必需*。
zh_tw: deviceId：*必要*。

source: authToken: *Optional*. If no authentication token is supplied, one will be generated and included in the response.
pt_br: authToken: *Opcional*. Se nenhum token de autenticação é fornecido, um será gerado e incluído na resposta.
zh_cn: authToken：*可选*。如果未提供认证令牌，将生成一个令牌并包含在响应中。
zh_tw: authToken：*選用*。如果未提供鑑別記號，將會產生一個記號，且包含在回應中。

source: deviceInfo: *Optional*. This parameter is optional, and can contain a number of variables, including: serialNumber, manufacturer, model, deviceClass, description, firmware and hardware versions, and descriptiveLocation.
pt_br: deviceInfo: *Opcional*. Este parâmetro é opcional, e pode conter um número de variáveis, incluindo: serialNumber, fabricante, modelo deviceClass, descrição, firmware e hardware versões e descriptiveLocation.
zh_cn: deviceInfo：*可选*。此参数为可选参数，可以包含多个变量，包括：序列号、制造商、型号、设备种类、描述、固件和硬件版本以及描述性位置。
zh_tw: deviceInfo：*選用*。此參數是選用的，且可包含許多變數，包括：serialNumber、製造商、機型、deviceClass、說明、韌體和硬體版本以及 descriptiveLocation。

source: metadata: *Optional*. Metadata can optionally be added in the form of custom field:value string pairs. An example is given in the code sample below.
pt_br: metadados: *Opcional*. Metadados podem ser opcionalmente incluídos na forma de campo customizado: pares de valor de cadeia. Um exemplo é fornecido na amostra de código abaixo.
zh_cn: metadata：*可选*。可以采用定制“字段:值”字符串对格式选择性地添加元数据。以下代码样本中提供了示例。
zh_tw: metadata：*選用*。可以選擇性地以自訂 field:value 字串配對的格式新增 meta 資料。下列程式碼範例中提供了範例。

source: location: *Optional*. This parameter contains the longitude, latitude, elevation, accuracy, and mesauredDateTime variables.
pt_br: localização: *Opcional*. Este parâmetro contém as variáveis de longitude, latitude, elevação, precisão e mesauredDateTime.
zh_cn: location：*可选*。此参数包含经度、纬度、海拔高度、准确性和 mesauredDateTime 变量。
zh_tw: location：*選用*。此參數包含經度、緯度、高度、精確度和 mesauredDateTime 等變數。

source: For more information on the parameters presented here, and the response format and codes, please see the relevant section of `API documentation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__.
pt_br: Para obter mais informações sobre os parâmetros aqui apresentados e o formato de resposta e códigos, consulte a seção relevante da `documentação da API <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__.
zh_cn: 有关此处所提供参数以及响应格式和代码的更多信息，请参阅 `API 文档 <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__ 的相关部分。
zh_tw: 如需此處所列的參數和回應格式與代碼的相關資訊，請參閱 `API 文件<https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#!/Devices/post_device_types_typeId_devices>`__的相關區段。

source: When using the *registerDevice()* method, you must define the mandatory deviceID parameter, and any of the optional parameters you require for your device, then call the method using the parameters you've selected.
pt_br: Ao utilizar o método *registerDevice()*, deve-se definir o parâmetro deviceID obrigatório, e qualquer um dos parâmetros opcionais que você requer para seu dispositivo e, em seguida, chame o método utilizando os parâmetros que você selecionou.
zh_cn: 在使用 *registerDevice()* 方法时，您必须定义必需的 deviceID 参数，以及设备所需的其他任何可选参数，然后使用您选择的参数调用方法。
zh_tw: 使用 *registerDevice()* 方法時，您必須定義必要的 deviceID 參數，和您的裝置所需的任何選用參數，然後使用您所選取的參數來呼叫方法。

source: Sample
pt_br: Amostra
zh_cn: 样本
zh_tw: 範例

source: The following code sample should be inserted after the constructor code in a .py file. This code demonstrates defining the deviceId, authToken, metadata, deviceInfo parameters, and location parameters and then using the method with those parameters and adding a device type.
pt_br: A amostra de código a seguir deve ser inserida após o código do construtor em um arquivo .py. Este código demonstra a definição dos parâmetros deviceId, authToken, metadados, deviceInfo e parâmetros de local e, em seguida, utilizando o método com esses parâmetros e incluindo um tipo de dispositivo.
zh_cn: 以下代码样本应插入到 .py 文件中的构造方法代码之后。此代码演示了如何定义 deviceId、authToken、metadata、deviceInfo 和 location 参数，然后使用带有这些参数的方法并添加设备类型。
zh_tw: 下列程式碼範例應在 .py 檔案中的建構子程式碼後面插入。此程式碼會示範如何定義 deviceId、authToken、meta 資料、deviceInfo 參數和位置參數，然後使用具有這些參數的方法，並新增裝置類型。

source: Delete a Device
pt_br: Excluir um Dispositivo
zh_cn: 删除设备
zh_tw: 刪除裝置

source: The *deleteDevice()* method is used to remove a device from an IoT Platform organization. When deleting a device using this method, the parameters which must be specified in the method are the deviceTypeId, and the deviceId.
pt_br: O método *deleteDevice()* é usado para excluir um dispositivo de uma organização do IoT Platform. Ao excluir um dispositivo usando esse método, os parâmetros que devem ser especificados no método são os deviceTypeId, e o deviceId.
zh_cn: *deleteDevice()* 方法用于从 IoT Platform 组织中移除设备。使用此方法删除设备时，该方法中必须指定的参数为 deviceTypeId 和 deviceId。
zh_tw: *deleteDevice()* 方法可用來從 IoT Platform 組織中移除裝置。使用此方法刪除裝置時，必須在方法中指定的參數為 deviceTypeId 和 deviceId。

source: The following code snippet provides an example of the format required for this method.
pt_br: O fragmento de código a seguir fornece um exemplo do formato necessário para esse método.
zh_cn: 以下代码片段提供了此方法所需格式的示例。
zh_tw: 下列程式碼 Snippet 提供此方法所需之格式的範例。

source: Get a Device
pt_br: Obter um Dispositivo
zh_cn: 获取设备
zh_tw: 取得裝置

source: The *getDevice()* method can be used to retrieve a device from an IoT Platform organization. When retrieving device details using this method, the parameters which must be specified in the method are the deviceTypeId, and the deviceId.
pt_br: O método *getDevice()* pode ser usado para recuperar um dispositivo de uma organização do IoT Platform. Ao excluir um dispositivo usando esse método, os parâmetros que devem ser especificados no método são os deviceTypeId, e o deviceId.
zh_cn: *getDevice()* 方法可用于从 IoT Platform 组织中检索设备。使用此方法检索设备详细信息时，该方法中必须指定的参数为 deviceTypeId 和 deviceId。
zh_tw: *getDevice()* 方法可用來從 IoT Platform 組織中擷取裝置。使用此方法擷取裝置詳細資料時，必須在方法中指定的參數為 deviceTypeId 和 deviceId。

source: Get all Devices
pt_br: Obter todos os dispositivos
zh_cn: 获取所有设备
zh_tw: 取得所有裝置

source: The *getAllDevices()* method can be used to retrieve all devices within an IoT Platform organization.
pt_br: O método *getAllDevices()* pode ser usado para recuperar todos os dispositivos dentro de uma organização do IoT Platform.
zh_cn: *getAllDevices()* 方法可用于检索 IoT Platform 组织中的所有设备。
zh_tw: *getAllDevices()* 方法可用來擷取 IoT Platform 組織內的所有裝置。

source: Update a Device
pt_br: Atualizar um Dispositivo
zh_cn: 更新设备
zh_tw: 更新裝置

source: The *updateDevice()* method is used to modify one or more properties of a device. Any property in the deviceInfo or metadata parameters can be updated. In order to update a device property, it must be defined above the method. The status parameter should contain "alert": True. The Alert property controls whether a device will display error codes in the IoT Platform user interface, and should be set by default to 'True'.
pt_br: O método *updateDevice()* é utilizado para modificar uma ou mais propriedades de um dispositivo. Qualquer propriedade nos parâmetros deviceInfo ou metadados podem ser atualizadas. Para atualizar uma propriedade do dispositivo, ela deverá ser definida acima do método. O parâmetro status deve conter "alert : True. A propriedade Alert controla se um dispositivo exibirá códigos de erro na interface com o usuário do IoT Platform e deve ser configurada por padrão como 'True'.
zh_cn: *updateDevice()* 方法用于修改一个或多个设备属性。可以更新 deviceInfo 或 metadata 参数中的任何属性。为了更新设备属性，必须在此方法之上定义此属性。状态参数应包含“alert”：True。Alert 属性用于控制设备是否在 IoT Platform 用户界面中显示错误代码，缺省情况下应设置为“True”。
zh_tw: *updateDevice()* 方法可用來修改裝置的一或多個內容。deviceInfo 或 meta 資料參數中的任何內容皆可更新。若要更新裝置內容，必須將內容定義於方法上方。狀態參數應包含 "alert"：True。「警示」內容會控制裝置是否在 IoT Platform 使用者介面中顯示錯誤碼，而且依預設應設為 'True'。

source: In this sample, the following code identifies a specific device, and updates several properties under the deviceInfo parameter.
pt_br: Nesta amostra, o código a seguir identifica um dispositivo específico e atualiza as várias propriedades sob o parâmetro deviceInfo.
zh_cn: 在此样本中，以下代码用于标识特定设备，并更新 deviceInfo 参数下的多个属性。
zh_tw: 在此範例中，下列程式碼會識別特定裝置，並更新 deviceInfo 參數下的數個內容。

source: Get Location Information
pt_br: Obter Informações de localização
zh_cn: 获取位置信息
zh_tw: 取得位置資訊

source: The *getDeviceLocation()* method can be used to retrieve the location information of a device. The parameters required for retrieving the location data are deviceTypeId and deviceId.
pt_br: O método *getDeviceLocation()* pode ser utilizado para recuperar as informações de localização de um dispositivo. Os parâmetros necessários para recuperar os dados do local são deviceTypeId e deviceId.
zh_cn: *getDeviceLocation()* 方法可用于检索设备的位置信息。检索位置数据所需的参数为 deviceTypeId 和 deviceId。
zh_tw: *getDeviceLocation()* 方法可用來擷取裝置的位置資訊。擷取位置資料所需的參數為 deviceTypeId 和 deviceId。

source: The response to this method contains the longitude, latitude, elevation, accuracy, measuredTimeStamp, and updatedTimeStamp properties.
pt_br: A resposta a este método contém as propriedades de longitude, latitude, elevação, precisão, measuredTimeStamp, e updatedTimeStamp.
zh_cn: 该方法的响应中包含经度、纬度、海拔高度、准确性、measuredTimeStamp 和 updatedTimeStamp 属性。
zh_tw: 此方法的回應包含經度、緯度、高度、精確度、measuredTimeStamp 和 updatedTimeStamp 等內容。

source: Update Location Information
pt_br: Atualizar as Informações de Localização
zh_cn: 更新位置信息
zh_tw: 更新位置資訊

source: The *updateDeviceLocation()* method is used to modify the location information for a device. Simlarly to updating device properties, the deviceLocation parameter must be defined with the changes you wish to apply. The code sample below demonstrates changing the location data for a given device.
pt_br: O método *updateDeviceLocation()* é utilizado para modificar as informações de localização para um dispositivo. De maneira similar para atualizar as propriedades do dispositivo, o parâmetro deviceLocation deve ser definido com as alterações que você deseja aplicar. A amostra de código abaixo demonstra a alteração dos dados de localização para um determinado dispositivo.
zh_cn: *updateDeviceLocation()* 方法用于修改设备的位置信息。与更新设备属性相似，必须使用您要应用的更改定义 deviceLocation 参数。以下代码样本演示了如何更改给定设备的位置数据。
zh_tw: *updateDeviceLocation()* 方法可用來修改裝置的位置資訊。如同更新裝置內容，您也必須以要套用的變更來定義 deviceLocation 參數。下方的程式碼範例示範如何變更給定裝置的位置資料。

source: If no date is supplied, the entry is added with the current date and time.
pt_br: Se nenhuma data for fornecida, a entrada será incluída com a data e a hora atuais.
zh_cn: 如果未提供日期，将使用当前日期和时间添加该条目。
zh_tw: 如果未提供日期，將會以現行日期和時間新增該項目。

source: Get Device Management Information
pt_br: Obter Informações de Gerenciamento de Dispositivo
zh_cn: 获取设备管理信息
zh_tw: 取得裝置管理資訊

source: The *getDeviceManagementInformation()* method is used to get the device management information for a device. The response contains the last activity date-time, the device's dormant status (true/false), support for device and firmware actions, and firmware data. For a comprehensive list of response content, please see the relevant API documentation.
pt_br: O método *getDeviceManagementInformation()* é utilizado para obter as informações de gerenciamento de dispositivo para um dispositivo. A resposta contém a última atividade de data e hora, status inativo do dispositivo (verdadeiro/falso), suporte para ações de dispositivo e firmware e os dados do firmware. Para uma lista abrangente de conteúdo de resposta, consulte a documentação da API relacionada.
zh_cn: *getDeviceManagementInformation()* 方法用于获取设备的管理信息。响应中包含上一次活动日期时间、设备的睡眠状态 (true/false)、设备和固件操作支持以及固件数据。有关响应内容的完整列表，请参阅相关 API 文档。
zh_tw: *getDeviceManagementInformation()* 方法可用來取得裝置的裝置管理資訊。回應包含前次活動日期時間、裝置的休眠狀態 (true/false)、裝置和韌體動作的支援，以及韌體資料。如需完整的回應內容清單，請參閱相關的 API 文件。
