Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/mqtt/index.po
Languages: it, ja, zh_cn, zh_tw

source: The primary mechanism that devices and applications use to communicate with the IBM Watson IoT platform is MQTT; this is a protocol designed for the efficient exchange of real-time data with sensor and mobile devices.
it: Il meccanismo principale che i dispositivi e le applicazioni utilizzano per comunicare con IBM Watson IoT platform è MQTT; questo è un protocollo progettato per lo scambio efficiente di dati in tempo reale tra un sensore e dispositivi mobili.
ja: デバイスとアプリケーションが IBM Watson IoT プラットフォームと通信するために使用する主要なメカニズムは、MQTT です。これは、センサーおよびモバイル・デバイスとのリアルタイムの効率的なデータ交換を実現するように設計されたプロトコルです。
zh_cn: 设备和应用程序用于与 IBM Watson IoT Platform 进行通信的主机制为 MQTT；这是设计用于与传感器和移动设备高效交换实时数据的协议。
zh_tw: 裝置和應用程式用來與 IBM Watson IoT Platform 進行通訊的主要機制是 MQTT；這是為了與感應器和行動式裝置有效交換即時資料而設計的通訊協定。

source: MQTT runs over TCP/IP and, while it is possible to code directly to TCP/IP, you might prefer to use a library that handles the details of the MQTT protocol for you. You will find there's a wide range of MQTT client libraries available at mqtt.org_, with the best place to start looking being the `Eclipse Paho project`_. IBM contributes to the development and support of many of these libraries.
it: MQTT funziona su TCP/IP e, benché sia possibile codificare direttamente su TCP/IP, si consiglia di utilizzare una libreria che gestisca i dettagli del protocollo MQTT per l'utente. Esiste un'ampia gamma di librerie client MQTT disponibili presso mqtt.org_ e il posto migliore per iniziare a cercare è il `progetto Eclipse Paho`_. IBM contribuisce allo sviluppo e al sostegno di molte di queste librerie.
ja: MQTT は TCP/IP で実行されます。TCP/IP の直接コーディングも可能ですが、MQTT プロトコルの詳細を処理するライブラリーを使用する方が便利かもしれません。mqtt.org には、利用可能なさまざまな MQTT クライアント・ライブラリーがあります。手始めに「Eclipse Paho project」を検索すると良いでしょう。それらのライブラリーの多くは、IBM が開発とサポートに貢献したものです。
zh_cn: MQTT 通过 TCP/IP 运行，虽然可以直接编码到 TCP/IP，但您可能更倾向于使用用于为您处理 MQTT 协议详细信息的库。您将发现 mqtt.org_ 中提供了一系列范围广泛的 MQTT 客户机库，从 `Eclipse Paho project`_ 开始查找是最合适的。IBM 致力于开发和支持其中的许多库。
zh_tw: MQTT 是透過 TCP/IP 執行，雖然可以將程式直接撰寫到 TCP/IP，但您或許想要使用程式庫來為您處理 MQTT 通訊協定的詳細資料。您將發現 mqtt.org_ 有非常多的 MQTT 用戶端程式庫可用，而開始探索的最好去處是 `Eclipse Paho 專案`_。IBM 對這些程式庫的開發和支援做出貢獻。

source: MQTT 3.1 is the version of the protocol that is in widest use today. Version 3.1.1 contains a number of minor enhancements, and has been ratified as an OASIS Standard.
it: MQTT 3.1 è la versione del protocollo maggiormente utilizzata oggi. La versione 3.1.1 contiene una serie di miglioramenti minori ed è stata ratificata come uno standard OASIS.
ja: MQTT 3.1 は、現在最も広く使用されているプロトコル・バージョンです。バージョン 3.1.1 には数多くの細かい機能拡張が含まれており、OASIS 標準規格として批准されています。
zh_cn: MQTT 3.1 是目前使用最广泛的协议版本。V3.1.1 包含多个次级增强功能，并且已作为 OASIS 标准认可。
zh_tw: MQTT 3.1 是目前最廣泛使用的通訊協定版本。3.1.1 版包含許多次要加強功能，已核定為 OASIS 標準。

source: One reason for using version 3.1.1 is that the maximum length of the MQTT Client Identifier (ClientId) is increased from the 23 character limit imposed by 3.1. The IoT service will often require longer ClientId's and will accept long ClientId's with either version of the protocol however some 3.1 client libraries check the ClientId and enforce the 23 character limit.
it: Un motivo per utilizzare la versione 3.1.1 potrebbe essere perché la lunghezza massima dell'identificativo client MQTT (ClientId) è aumentata rispetto al limite di 23 caratteri imposto dalla 3.1. Il servizio IoT richiederà spesso ClientId più lunghi e accetterà i ClientId con entrambe le versioni del protocollo, tuttavia alcune librerie client 3.1 controllano il ClientId e applicano il limite di 23 caratteri.
ja: バージョン 3.1.1 を使用する理由の 1 つは、MQTT クライアント ID (ClientId) の最大長が、3.1 での 23 文字という制限より大きくなっているという点です。IoT サービスでは、それより長い ClientId が必要になることがしばしばあり、プロトコルのどのバージョンでもそのような長い ClientId が受け入れられていますが、3.1 クライアント・ライブラリーの中には、ClientId が 23 文字の制限を満たしているかどうかをチェックするものがあります。
zh_cn: 使用 V3.1.1 的一个原因在于，MQTT 客户机标识 (ClientId) 的最大长度在 3.1 实施的 23 个字符限制基础上有所增加。IoT 服务通常将需要更长的 ClientId，并且针对任一版本的协议将接受很长的 ClientId，但是，某些 3.1 客户机库将检查 ClientId 并实施 23 个字符的限制。
zh_tw: 使用 3.1.1 版的原因之一，是 MQTT 用戶端 ID (ClientId) 的長度上限已從 3.1 強制執行的 23 個字元限制增加。IoT 服務通常需要較長的 ClientId，而且會接受任一通訊協定版本較長的 ClientId，但是部分 3.1 用戶端程式庫會檢查 ClientId 並施行 23 個字元限制。

source: Device and application clients
it: Client di dispositivi e applicazioni
ja: デバイス・クライアントおよびアプリケーション・クライアント
zh_cn: 设备和应用程序客户机
zh_tw: 裝置和應用程式用戶端

source: We define two primary classes of thing: Devices & Applications
it: Vengono definite due classi principali di elementi: Dispositivi e Applicazioni
ja: モノの主要な分類としてデバイスとアプリケーションという 2 つが定義されています
zh_cn: 我们定义了两大类事物：设备和应用程序
zh_tw: 我們定義事物的兩個主要類別：裝置和應用程式

source: The class of thing that your MQTT client identifies itself to the service as will determine the capabilities of your client once connected as well as the mechanism through which you will need to authenticate.
it: La classe di elementi in cui il client MQTT si identifica rispetto al servizio, determinerà le capacità del client una volta connessi, come pure il meccanismo attraverso il quale è necessario autenticarsi.
ja: MQTT クライアントがそれ自体をサービスに対してモノのどの分類にするかに応じて、接続後のクライアントの機能や認証のメカニズムが決まります。
zh_cn: MQTT 客户机向服务识别自身所采用的事物类将确定该客户机在连接后的功能以及您将需要用于进行认证的机制。
zh_tw: MQTT 用戶端在服務中用以識別自己的事物類別將決定連接後的用戶端功能，以及您需要透過哪個機制進行鑑別。

source: Applications and devices also work with different MQTT topic spaces. Devices work within a device-scoped topic space, whereas applications have full access to the topic space for an entire organization.
it: Le applicazioni e i dispositivi funzionano anche con spazi argomento MQTT differenti. I dispositivi operano all'interno di uno spazio argomenti in ambito dispositivo, mentre le applicazioni hanno accesso completo allo spazio argomenti per un'intera organizzazione.
ja: また、アプリケーションおよびデバイスは、異なる MQTT トピック空間で動作します。デバイスはデバイス・スコープのトピック空間内で動作する一方、アプリケーションには組織全体のトピック空間に対して全アクセス権限が付与されます。
zh_cn: 应用程序和设备还与不同 MQTT 主题空间配合工作。设备在限定设备作用域的主题空间中工作，而应用程序对整个组织的主题空间具有完全访问权。
zh_tw: 應用程式和裝置也使用不同的 MQTT 主題空間。裝置是在裝置範圍的主題空間內運作，而應用程式則對整個組織的主題空間具有完整存取權。

source: Quality of service
it: QOS (quality of service)
ja: サービスの品質
zh_cn: 服务质量
zh_tw: 服務品質

source: The MQTT protocol provides three qualities of service for delivering messages between clients and servers: "at most once", "at least once" and "exactly once". Events and commands can be sent using any quality of service level, however you should carefully consider whether what the right level is for your needs. It is not a simple case that QoS2 is "better" than QoS0.
it: Il protocollo MQTT fornisce tre QoS (quality of service) per la consegna dei messaggi tra i client e i server: "al massimo una volta", "almeno una volta" e "esattamente una volta". Gli eventi e i comandi possono essere inviati utilizzando qualsiasi livello di QoS, ma è necessario considerare attentamente quale sia il giusto livello per le proprie esigenze. Non si pensi semplicemente che QoS2 sia "migliore" di QoS0.
ja: MQTT プロトコルでは、クライアントとサーバーの間のメッセージ配信について、「最高 1 回」、「最低 1 回」、および「ちょうど 1 回」の 3 つのサービス品質が提供されています。イベントとコマンドは、どのレベルのサービス品質を使用しても送信可能ですが、どのレベルが自分の必要に最も適切かを注意深く考慮するようにしてください。QoS2 が QoS0「より良い」かどうかは、それほど簡単に判断できません。
zh_cn: MQTT 协议提供了在客户机和服务器之间传递消息的三种服务质量：“最多一次”、“至少一次”和“恰好一次”。可使用任何服务质量级别发送事件和命令，但是，应仔细考虑适用于您需求的正确级别。并不能简单地说 QoS2 优于 QoS0。
zh_tw: MQTT 通訊協定提供三種服務品質在用戶端與伺服器之間傳遞訊息：「最多一次」、「最少一次」及「正好一次」。事件和指令可利用任何服務品質等級傳送，不過您應審慎考量何種等級最符合您的需求。它並不是 QoS2 比 QoS0「更好」這麼簡單。

source: At most once (QoS0)
it: Al massimo una volta (QoS0)
ja: 最高 1 回 (QoS0)
zh_cn: 最多一次 (QoS0)
zh_tw: 最多一次 (QoS0)

source: The message is delivered at most once, or it might not be delivered at all. Delivery across the network is not acknowledged, and the message is not stored. The message could be lost if the client is disconnected, or if the server fails. QoS0 is the fastest mode of transfer. It is sometimes called "fire and forget".
it: Il messaggio viene consegnato al massimo una volta o potrebbe non essere consegnato affatto. La consegna nella rete non viene riconosciuta e il messaggio non viene memorizzato. Il messaggio potrebbe essere perso se il client è disconnesso o se si verifica un problema nel server. QoS0 è il modo più veloce di trasferire. Viene anche chiamato "attiva e dimentica (fire and forget)".
ja: メッセージは最高 1 回配信されるか、あるいはまったく配信されません。ネットワークを通じての配信には肯定応答が送られず、メッセージは保管されません。クライアントが切断していたりサーバーに障害が発生したりした場合、メッセージが失われる可能性があります。QoS0 は、最も高速な転送モードです。これは「応答不要送信」とも呼ばれます。
zh_cn: 消息最多传递一次，也可能根本不会传递。通过网络进行传递未得到确认，并且该消息未存储。如果客户机断开连接或服务器发生故障，那么可能会丢失消息。QoS0 是最快的传输方式。有些时候被称为“发完就忘”。
zh_tw: 訊息最多傳遞一次，或者完全不傳遞。不會確認透過網路的遞送，也不會儲存訊息。如果用戶端中斷連線，或伺服器故障，則可能失去訊息。QoS0 是最快的傳送模式。它有時稱為「發後即忘」模式。

source: The MQTT protocol does not require servers to forward publications at QoS0 to a client. If the client is disconnected at the time the server receives the publication, the publication might be discarded, depending on the server implementation.
it: Il protocollo MQTT non richiede che i server inoltrino le pubblicazioni al livello QoS0 a un client. Se il client è disconnesso nel momento in cui il server riceve la pubblicazione, la pubblicazione potrebbe essere eliminata, a seconda dell'implementazione del server.
ja: MQTT プロトコルでは、サーバーからクライアントへのパブリッシュを QoS0 で転送する必要はありません。サーバーがパブリッシュを受信した時点でクライアントが切断されていた場合、サーバーの実装方法によってはパブリッシュが破棄されることがあります。
zh_cn: MQTT 协议不需要服务器在 QoS0 级别将发布内容转发给客户机。如果客户机在服务器接收到发布内容时已断开连接，那么根据服务器实施，可能会废弃发布内容。
zh_tw: MQTT 通訊協定不需要伺服器以 QoS0 轉遞出版品至用戶端。如果用戶端在伺服器接收出版品時中斷連線，視伺服器實作而定，有可能會捨棄該出版品。

source: When sending real-time data on an interval we recommend using QoS0. If a single message goes missing it does not really matter as another message will be sent shortly after containing newer data. In this scenario the extra cost of using higher quality of service does not result in any tangible benefit.
it: Quando si inviano i dati in tempo reale in base a un intervallo si consiglia di utilizzare QoS0. Se si perde un solo messaggio non è grave, poiché poco dopo verrà inviato un altro messaggio contenente dati più recenti. In questo scenario, il costo supplementare dell'utilizzo di un livello più elevato di QoS non porta alcun vantaggio tangibile.
ja: リアルタイム・データを一定間隔で送信する際には、QoS0 を使用することが推奨されています。単一のメッセージが欠落しても、新しいデータを含む別のメッセージがそのすぐ後に送信されるのでそれほど問題ではありません。このシナリオの場合、高いサービス品質を使用することに余分のコストをかけても、それほどメリットはありません。
zh_cn: 按某个时间间隔发送实时数据时，我们建议使用 QoS0。如果单条消息丢失，这其实并无大碍，因为不久会发送包含较新数据的另一条消息。在此场景中，使用较高服务质量会产生额外成本，却不会带来任何实质优势。
zh_tw: 如果是根據時間間隔來傳送即時資料，我們建議使用 QoS0。遺漏單一訊息沒有多大關係，因為不久之後就會傳送另一則包含更新資料的訊息。在此實務範例中，使用更高服務品質的額外成本不會帶來任何實質利益。

source: At least once (QoS1)
it: Almeno una volta (QoS1)
ja: 最低 1 回 (QoS1)
zh_cn: 至少一次 (QoS1)
zh_tw: 最少一次 (QoS1)

source: The message is always delivered at least once. It might be delivered multiple times if there is a failure before an acknowledgment is received by the sender. The message must be stored locally at the sender, until the sender receives confirmation that the message has been published by the receiver. The message is stored in case the message must be sent again.
it: Il messaggio viene sempre consegnato almeno una volta. È possibile che venga consegnato più volte se si verifica un errore prima che il mittente riceva la ricevuta di ricezione. Il messaggio deve essere memorizzato localmente all'ubicazione del mittente, fino a quando il mittente non riceve una conferma che il messaggio è stato pubblicato dal destinatario. Il messaggio viene memorizzato nel caso in cui debba essere inviato nuovamente.
ja: メッセージは、最低 1 回は常に配信されます。送信側が肯定応答を受信するまでに障害が発生した場合、複数回配信される可能性があります。メッセージがパブリッシュされたという受信側の確認を送信側が受信する時点まで、メッセージは送信側にローカルに保管されていなければなりません。メッセージが保管されるのは、メッセージの再送が必要になった場合に備えてのことです。
zh_cn: 消息总是至少传递一次。如果在发送方接收到确认之前发生了故障，那么可能会多次传递该消息。该消息必须存储在发送方本地，直到发送方接收到指示接收方已发布该消息的确认为止。在此期间将一直存储该消息，以防必须再次发送该消息。
zh_tw: 訊息一律至少遞送一次。如果在傳送者收到確認通知之前發生失敗狀況，則可能會將其遞送多次。訊息必須儲存在傳送者本端，直到傳送者接收到確認，表示接收者已發佈該訊息。儲存訊息是為了萬一必須重新傳送訊息。

source: Exactly once (QoS2)
it: Esattamente una volta (QoS2)
ja: ちょうど 1 回 (QoS2)
zh_cn: 恰好一次 (QoS2)
zh_tw: 正好一次 (QoS2)

source: The message is always delivered exactly once. The message must be stored locally at the sender, until the sender receives confirmation that the message has been published by the receiver. The message is stored in case the message must be sent again. QoS2 is the safest, but slowest mode of transfer. A more sophisticated handshaking and acknowledgement sequence is used than for QoS1 to ensure no duplication of messages occurs.
it: Il messaggio viene sempre consegnato esattamente una volta. Il messaggio deve essere memorizzato localmente all'ubicazione del mittente, fino a quando il mittente non riceve una conferma che il messaggio è stato pubblicato dal destinatario. Il messaggio viene memorizzato nel caso in cui debba essere inviato nuovamente. QoS2 è la modalità di trasferimento più sicura, ma la più lenta. Rispetto a QoS1 viene utilizzata una sequenza più sofisticata di presentazione e riconoscimento, per assicurare che non si verifichino duplicati di messaggi.
ja: メッセージは、常にちょうど 1 回配信されます。メッセージがパブリッシュされたという受信側の確認を送信側が受信する時点まで、メッセージは送信側にローカルに保管されていなければなりません。メッセージが保管されるのは、メッセージの再送が必要になった場合に備えてのことです。QoS2 は安全性の点では最も高いですが、転送速度は最も遅くなります。メッセージの重複が発生しないようにするため、QoS1 に比べて、さらに洗練されたハンドシェークおよび肯定応答シーケンスが使用されます
zh_cn: 消息总是恰好传递一次。该消息必须存储在发送方本地，直到发送方接收到指示接收方已发布该消息的确认为止。在此期间将一直存储该消息，以防必须再次发送该消息。QoS2 是最安全但最慢的传输方式。将使用比 QoS1 更复杂的握手和确认序列，以确保不会出现重复的消息。
zh_tw: 訊息一律只遞送一次。訊息必須儲存在傳送者本端，直到傳送者接收到確認，表示接收者已發佈該訊息。儲存訊息是為了萬一必須重新傳送訊息。QoS2 是最安全但傳送速度最慢的模式。會使用比 QoS1 更準確的信號交換和確認序列，以確保不會發生訊息重複。

source: When sending commands we recommend using QoS2. In many cases, when processing commands you want to know that the command will only be actioned, and that it will be actioned only once. This is one of the clearest examples of when the additional overhead of QoS2 has a clear benefit.
it: Quando si inviano i comandi si consiglia di utilizzare QoS2. In molti casi, quando si elaborano i comandi si desidera solo sapere che il comando sia azionato e che lo sia una sola volta. Questo è uno dei più evidenti esempi di quando il sovraccarico aggiuntivo di QoS2 ha un evidente beneficio.
ja: コマンド送信時には、QoS2 を使用することが推奨されています。多くの場合、コマンド処理時には、コマンドが処理されること、および 1 回のみ処理されることを知る必要があります。これは、QoS2 の付加的なオーバーヘッドに明確なメリットがあるという、最も明確な例の 1 つです。
zh_cn: 在发送命令时，建议使用 QoS2。在很多情况下，处理命令时，您希望确信将仅对命令执行操作，且仅执行一次。这是 QoS2 的额外开销带来明显优势的最清楚示例之一。
zh_tw: 傳送指令時，我們建議使用 QoS2。在許多情況下，當處理指令時，您想知道只會處理該指令，而且只會處理一次。QoS2 的額外負荷何時會有明顯的好處，這是最清楚的範例之一。

source: Subscription Buffers and Clean Session
it: Buffer si sottoscrizione e sessione pulita
ja: サブスクリプション・バッファーとクリーン・セッション
zh_cn: 预订缓冲区和清洁会话
zh_tw: 訂閱緩衝區和清除階段作業

source: Each subscription from either a device or application is allocated a buffer of 5000 messages. This allows for any application or device to fall behind the live data it is processing and build up a backlog of up to 5000 pending messages for each subscription it has made. Once the buffer fills up, any new message will result in the oldest message in the buffer being discarded.
it: A ogni sottoscrizione da un dispositivo o da applicazione viene assegnato un buffer di 5000 messaggi. Questo può far sì che un'applicazione o un dispositivo possa andare oltre i dati live che sta elaborando e crei un backlog di fino a 5000 messaggi in sospeso per ogni sottoscrizione effettuata. Quando il buffer si riempie, qualsiasi nuovo messaggio causerà l'eliminazione del messaggio più vecchio nel buffer.
ja: デバイスまたはアプリケーションのいずれかからの各サブスクリプションには、5000 個のメッセージが入るバッファーが割り振られます。これにより、アプリケーションやデバイスは処理するライブ・データの背後になることが可能になり、サブスクリプションごとに保留メッセージが 5000 個まで入るバックログを構成することが可能になります。バッファーがいっぱいになった時点で、新しいメッセージが到着すると、バッファーの中で最も古いメッセージが破棄されます。
zh_cn: 将为来自设备或应用程序的每个预订分配一个可容纳 5000 条消息的缓冲区。这允许任何应用程序或设备跟不上其正在处理实时数据的进度，且其每一订阅积压高达 5000 条暂挂消息。缓冲区充满后，任何新消息将导致废弃缓冲区中的最旧消息。
zh_tw: 會配置 5000 個訊息的緩衝區給來自裝置或應用程式的每一個訂閱。這可讓任何應用程式或裝置落後於它正在處理的現用資料，並為它所建立的每一個訂閱建置最多含 5000 個擱置訊息的待辦事項。當緩衝區填滿時，如有任何新訊息，將導致緩衝區中最舊的訊息遭捨棄。

source: The subscription buffer can be accessed using MQTT clean session option. If clean session is set to false, a subscriber will start receiving messages from the buffer. If clean session is set to true, the buffer is reset.
it: Al buffer di sottoscrizione è possibile accedere utilizzando l'opzione della sessione pulita di MQTT. Se la sessione pulita è impostata su false, un sottoscrittore inizierà a ricevere i messaggi dal buffer. Se la sessione pulita è impostata su true, il buffer viene reimpostato.
ja: サブスクリプション・バッファーには、MQTT クリーン・セッション・オプションを使用してアクセスできます。クリーン・セッションが false に設定されている場合、サブスクライバーは、バッファーからのメッセージ受信を開始します。クリーン・セッションが true に設定されている場合、バッファーがリセットされます。
zh_cn: 可使用 MQTT 清洁会话选项访问预订缓冲区。如果“清洁会话”设置为 false，那么订户将开始从缓冲区接收消息。如果“清洁会话”设置为 true，那么将重置缓冲区。
zh_tw: 可使用 MQTT 清除階段作業選項來存取此訂閱緩衝區。如果清除階段作業是設為 false，訂閱者將開始從緩衝區接收訊息。如果清除階段作業設為 true，則重設緩衝區。

source: This limit applies regardless of the quality of service setting used. Thus it is possible that a message sent at QoS1 or QoS2 may not be delivered to an application that is unable to keep up with the messages rate for the subscription(s) it has made.
it: Questo limite si applica a prescindere dall'impostazione QoS utilizzata. Di conseguenza è possibile che un messaggio inviato al livello QoS1 o QoS2 non sia consegnato a un'applicazione che non è in grado di stare al passo con la velocità dei messaggi per la sottoscrizione creata.
ja: この制限は、使用されるサービス品質の設定には関係なく適用されます。したがって、アプリケーションがサブスクリプションのメッセージ・レートを維持できない場合、QoS1 または QoS2 で送信されるメッセージが配信されないという可能性があります。
zh_cn: 无论使用的服务质量设置是什么，都将应用此限制。因此，按 QoS1 或 QoS2 级别发送的消息有可能不会传递到某个跟不上其所执行预订的消息速率的应用程序。
zh_tw: 不論使用何種服務品質設定，均適用此限制。因此，以 QoS1 或 QoS2 傳送的訊息可能無法傳遞至跟不上它所建立訂閱的訊息速率的應用程式。

source: Message Payload
it: Payload dei messaggi
ja: メッセージ・ペイロード
zh_cn: 消息有效内容
zh_tw: 訊息內容

source: The Watson IoT platform supports sending and recieving messages in any format.
it: Watson IoT platform supporta l'invio e la ricezione di messaggi in qualsiasi formato.
ja: Watson IoT Platform では、任意の形式のメッセージの送受信がサポートされています。
zh_cn: Watson IoT Platform 支持发送和接收任何格式的消息。
zh_tw: Watson IoT Platform 支援以任何格式傳送及接收訊息。

source: Watson IoT Platform Maximum Message Payload Size
it: Dimensione massima del payload dei messaggi Watson IoT Platform
ja: Watson IoT Platform 最大メッセージ・ペイロード・サイズ
zh_cn: Watson IoT Platform 最大消息有效内容大小
zh_tw: Watson IoT Platform 訊息內容大小上限

source: The maximum payload size is 131072 bytes. If messages with payloads larger than this limit are sent, the client will be disconnected and the following log message will appear in the Diagnostic Logs if the client is a device:
it: La dimensione massima del payload è 131072 byte. Se vengono inviati messaggi con payload superiori a questo limite, il client verrà disconnesso e nei Log diagnostici verrà visualizzato il seguente messaggio di log se il client è un dispositivo:
ja: 最大ペイロード・サイズは 131072 バイトです。この限界より大きいペイロードを持つメッセージが送信される場合、クライアントは切断され、以下のログ・メッセージが診断ログに表示されます (クライアントがデバイスである場合)。
zh_cn: 最大有效内容大小为 131072 字节。如果发送的消息有效内容超出了该限制，那么在客户机为设备的情况下，将会断开该客户机连接，并在“诊断日志”中显示以下日志消息：
zh_tw: 內容大小上限為 131072 個位元組。如果傳送的訊息包含內容大於此限制，則會中斷用戶端連線，如果用戶端為裝置，則會在「診斷日誌」中出現下列日誌訊息：

source: Closed connection from x.x.x.x. The message size is too large for this endpoint.
it: Connessione da x.x.x.x chiusa. La dimensione del messaggio è troppo elevata per questo endpoint.
ja: x.x.x.x からの接続が閉じられました。メッセージ・サイズがこのエンドポイントには大きすぎます。
zh_cn: 已关闭来自 x.x.x.x 的连接。消息大小对该端点来说过大。
zh_tw: 已關閉來自 x.x.x.x 的連線。對此端點而言，訊息大小太大。
