Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/custom_actions.po
Languages: ja, pt_br, zh_cn, zh_tw

source: Extending Device Management
ja: デバイス管理の拡張
pt_br: Estendendo o gerenciamento de dispositivo
zh_cn: 扩展设备管理
zh_tw: 延伸裝置管理

source: This feature is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
ja: この機能は、現在、限定的なベータ版で提供されています。今後の更新によって、この機能の現行バージョンと互換性のない変更が行われる可能性があります。この機能を試して、`ご意見をお寄せください<https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_。
pt_br: Este recurso está atualmente disponível como parte de uma versão beta limitada. Atualizações futuras poderão incluir mudanças incompatíveis com a versão atual deste recurso. Experimente e nos dê sua opinião <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
zh_cn: 此功能目前作为受限测试版的一部分提供。将来的更新可能包含与此功能的当前版本不兼容的更改。试用并 `告知我们您的想法 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
zh_tw: 受限測試版目前提供此功能。未來更新可能包括與此功能的現行版本不相容的變更。請試用它，並 `讓我們知道您的想法 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_

source: The IBM Watson IoT Platform provides the ability to extend the device management capabilities. This is done by adding device management extensions using either the REST APIs or the IoT Platform dashboard.
ja: IBM Watson IoT Platform では、デバイス管理機能を拡張することができます。このためには、REST API または IoT Platform ダッシュボードを使用してデバイス管理拡張を追加します。
pt_br: O IBM Watson IoT Platform fornece capacidade de estender os recursos de gerenciamento de dispositivo. Isso é feito incluindo extensões de gerenciamento de dispositivo usando as APIs REST para o painel IoT Platform.
zh_cn: IBM Watson IoT Platform 使您能够扩展设备管理功能。可以通过使用 REST API 或 IoT Platform 仪表板添加设备管理扩展来实现这一点。
zh_tw: IBM Watson IoT Platform 可讓您延伸裝置管理功能。為此，請使用 REST API 或 IoT Platform 儀表板來新增裝置管理延伸。

source: Devices which connect to the IoT Platform may have a wide range of capabilities. The device management actions supported by default in the IoT Platform (*device reboot*, *factory reset*, *firmware download* and *firmware update*) may not be sufficient to manage everything which a device can do.
ja: IoT Platform には、さまざまな機能を持つデバイスが接続されます。IoT Platform でデフォルトでサポートされるデバイス管理操作 (デバイスのリブート、出荷時設定へのリセット、ファームウェアのダウンロード、ファームウェアの更新) では、デバイスの実行可能な機能のすべてを管理するために十分ではない可能性があります。
pt_br: Dispositivos que se conectam ao IoT Platform podem ter uma grande gama de recursos. As ações de gerenciamento de dispositivos suportadas por padrão no IoT Platform (*device reboot*, *factory reset*, *firmware download* e *firmware update*) podem não ser suficientes para gerenciar tudo o que um dispositivo pode fazer.
zh_cn: 连接到 IoT Platform 的设备可能具有丰富的功能。IoT Platform 中缺省情况下支持的设备管理操作（*设备重新引导*、*恢复出厂设置*、*固件下载* 和 *固件更新*）可能不足以管理设备可执行的所有任务。
zh_tw: 連接至 IoT Platform 的裝置具有各種功能。依預設，IoT Platform 支援的裝置管理動作（*裝置重新啟動*、*重設為原廠設定*、*韌體下載* 及 *韌體更新*）可能不足以管理裝置可以完成的所有作業。

source: Device Management Extension Packages
ja: デバイス管理拡張パッケージ
pt_br: Pacotes de extensão de gerenciamento de dispositivo
zh_cn: 设备管理扩展包
zh_tw: 裝置管理延伸套件

source: An extension package is a JSON document which defines a set of device management actions. The actions can be initiated against one or more devices which support those actions. The actions are initiated in the same way as the default device management actions by using either the IoT Platform dashboard or the device management REST APIs.
ja: 拡張パッケージは、一連のデバイス管理操作を定義した JSON 文書です。それらの操作は、操作をサポートしている 1 つ以上のデバイスに対して開始できます。操作は、デフォルトのデバイス管理操作と同じ方法で IoT Platform ダッシュボードまたはデバイス管理 REST API を使用して開始できます。
pt_br: Um pacote de extensão é um documento JSON que define um conjunto de ações de gerenciamento de dispositivo. As ações podem ser iniciadas em um ou mais dispositivos que suportam essas ações. As ações são iniciadas da mesma forma que as ações de gerenciamento de dispositivo padrão usando o painel IoT Platform ou as APIs REST de gerenciamento de dispositivos.
zh_cn: 扩展包是用于定义一组设备管理操作的 JSON 文档。可以针对支持这些操作的一个或多个设备启动这些操作。可通过 IoT Platform 仪表板或设备管理 REST API，采用与缺省设备管理操作相同的方式启动这些操作。
zh_tw: 延伸套件是一個定義裝置管理動作集的 JSON 文件。可以針對一個以上支援這些動作的裝置來起始這些動作。這些動作的起始方式和預設裝置管理動作相同，都是使用 IoT Platform 儀表板或裝置管理 REST API。

source: Device management extension packages have the following format:
ja: デバイス管理拡張パッケージの形式は以下のとおりです。
pt_br: Pacotes de extensão de gerenciamento de dispositivo possuem o seguinte formato:
zh_cn: 设备管理扩展包具有以下格式：
zh_tw: 裝置管理延伸套件具有下列格式：

source: Extension Package Properties:
ja: 拡張パッケージのプロパティー:
pt_br: Propriedades do pacote de extensão:
zh_cn: 扩展包属性：
zh_tw: 延伸套件內容：

source: ``bundleId``: Unique identifier for a device management extension. Required.
ja: ``bundleId``: デバイス管理拡張の固有 ID。必須。
pt_br: ``bundleId``: Identificador exclusivo para uma extensão de gerenciamento de dispositivo. Requerido.
zh_cn: “bundleId”：设备管理扩展的唯一标识。必需。
zh_tw: ``bundleId``：裝置管理延伸的唯一 ID。必要項目。

source: ``version``: Version string for a device management extension. Optional.
ja: ``version``: デバイス管理拡張のバージョン・ストリング。オプション。
pt_br: ``version``: Sequência de versões para uma extensão de gerenciamento de dispositivo. Optional.
zh_cn: “version”：设备管理扩展的版本字符串。可选。
zh_tw: ``version``：裝置管理延伸的版本字串。選用項目。

source: ``provider``: Provider string for a device management extension. Maximum length of 1024 characters. Optional.
ja: ``provider``: デバイス管理拡張のプロバイダー・ストリング。最大長は 1024 文字です。オプション。
pt_br: ``provider``: Sequência de provedor para uma extensão de gerenciamento de dispositivo. Comprimento máximo de 1024 caracteres. Optional.
zh_cn: “provider”：设备管理扩展的提供者字符串。最大长度为 1024 字符。可选。
zh_tw: ``provider``：裝置管理延伸的提供者字串。長度上限為 1024 個字元。選用項目。

source: ``displayName``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Required. Must contain at least one entry.
ja: ``displayName``: IoT Platform ダッシュボードでの表示に使用する ``locale``:``String`` のキー/値のペアのマップ。必須。少なくとも 1 つの項目が含まれている必要があります。
pt_br: ``displayName``: Mapa de pares de valor de chave ``locale``: ``String`` usados para exibição no painel IoT Platform. Requerido. Deve conter pelo menos uma entrada.
zh_cn: “displayName”：“locale”/“String”键值对映射，用于显示在 IoT Platform 仪表板中。必需。必须包含至少一个条目。
zh_tw: ``displayName``：用於在 IoT Platform 儀表板中顯示的 ``locale``: ``String`` 鍵值組對映。必要項目。必須至少包含一個項目。

source: ``description``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Optional. If specified, must contain at least one entry.
ja: ``description``: IoT Platform ダッシュボードでの表示に使用する ``locale``:``String`` のキー/値のペアのマップ。オプション。指定する場合、少なくとも 1 つの項目が含まれている必要があります。
pt_br: ``description``: Mapa de pares de valor de chave ``locale``: ``String`` usados para exibição no painel IoT Platform. Optional. Se especificado, deve conter pelo menos uma entrada.
zh_cn: “description”：“locale”/“String”键值对映射，用于显示在 IoT Platform 仪表板中。可选。如果指定此项，那么必须包含至少一个条目。
zh_tw: ``description``：用於在 IoT Platform 儀表板中顯示的 ``locale``: ``String`` 鍵值組對映。選用項目。如果指定的話，則必須至少包含一個項目。

source: ``actions``: Map of ``actionId``: ``<action>`` key-value pairs which defines the actions contained within a device management extension. Required. Must contain at least one entry.
ja: ``actions``: デバイス管理拡張に含まれる操作を定義する ``actionId``:``<action>`` のキー/値のペアのマップ。必須。少なくとも 1 つの項目が含まれている必要があります。
pt_br: ``actions``: Mapa de pares de valor de chave ``actionId``: ``<action>`` que define as ações contidas dentro de uma extensão de gerenciamento de dispositivo. Requerido. Deve conter pelo menos uma entrada.
zh_cn: “actions”：“actionId”/“<action>”键值对映射，用于定义设备管理扩展中包含的操作。必需。必须包含至少一个条目。
zh_tw: ``actions``：定義裝置管理延伸中所含動作的 ``actionId``: ``<action>`` 鍵值組對映。必要項目。必須至少包含一個項目。

source: Properties per action:
ja: 操作ごとのプロパティー:
pt_br: Propriedades por ação:
zh_cn: 每个操作的属性：
zh_tw: 每個動作的內容：

source: ``actionDisplayName``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Required. Must contain at least one entry.
ja: ``actionDisplayName``: IoT Platform ダッシュボードでの表示に使用する ``locale``:``String`` のキー/値のペアのマップ。必須。少なくとも 1 つの項目が含まれている必要があります。
pt_br: ``actionDisplayName``: Mapa de pares de valor de chave ``locale``: ``String`` usados para exibição no painel IoT Platform. Requerido. Deve conter pelo menos uma entrada.
zh_cn: “actionDisplayName”：“locale”/“String”键值对映射，用于显示在 IoT Platform 仪表板中。必需。必须包含至少一个条目。
zh_tw: ``actionDisplayName``：用於在 IoT Platform 儀表板中顯示的 ``locale``: ``String`` 鍵值組對映。必要項目。必須至少包含一個項目。

source: ``description``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Optional. If specified, must contain at least one entry.
ja: ``description``: IoT Platform ダッシュボードでの表示に使用する ``locale``:``String`` のキー/値のペアのマップ。オプション。指定する場合、少なくとも 1 つの項目が含まれている必要があります。
pt_br: ``description``: Mapa de pares de valor de chave ``locale``: ``String`` usados para exibição no painel IoT Platform. Optional. Se especificado, deve conter pelo menos uma entrada.
zh_cn: “description”：“locale”/“String”键值对映射，用于显示在 IoT Platform 仪表板中。可选。如果指定此项，那么必须包含至少一个条目。
zh_tw: ``description``：用於在 IoT Platform 儀表板中顯示的 ``locale``: ``String`` 鍵值組對映。選用項目。如果指定的話，則必須至少包含一個項目。

source: ``parameters``: Array of parameters allowed for a particular action. Optional. If specified, must contain at least one entry.
ja: ``parameters``: 特定の操作で許可されるパラメーターの配列。オプション。指定する場合、少なくとも 1 つの項目が含まれている必要があります。
pt_br: ``parameters``: Matriz de parâmetros permitidos para uma determinada ação. Optional. Se especificada, deve conter pelo menos uma entrada.
zh_cn: “parameters”：特定操作允许的参数数组。可选。如果指定此项，那么必须包含至少一个条目。
zh_tw: ``parameters``：特定動作所接受的參數陣列。選用項目。如果指定的話，則必須至少包含一個項目。

source: Properties per action parameter:
ja: 操作ごとのプロパティーのパラメーター:
pt_br: Propriedades por parâmetro de ação:
zh_cn: 每个操作参数的属性：
zh_tw: 每個動作參數的內容：

source: ``name``: Unique identifier for a parameter within an action. Required.
ja: ``name``: 操作の中で一意のパラメーター ID。必須。
pt_br: ``name``: Identificador exclusivo para um parâmetro dentro de uma ação. Requerido.
zh_cn: “name”：操作中参数的唯一标识。必需。
zh_tw: ``name``：動作中參數的唯一 ID。必要項目。

source: ``value``: Regular expression used for validating parameter values when a request is initiated. Optional. If not specified, value will not be validated.
ja: ``value``: リクエストの開始時にパラメーター値を検証するために使用する正規表現。オプション。指定しない場合、値の検証は行われません。
pt_br: ``value``: Expressão regular usada para validar valores de parâmetros quando uma solicitação é iniciada. Optional. Se não especificada, o valor não será validado.
zh_cn: “value”：用于在启动请求时验证参数值的正则表达式。可选。如果未指定此项，那么将不验证值。
zh_tw: ``value``：起始要求時用於驗證參數值的正規表示式。選用項目。如果未指定，則將不會驗證值。

source: ``required``: Boolean value specifying whether the parameter is required. Optional. Default: False
ja: ``required``: パラメーターが必須かどうかを示すブール値。オプション。デフォルト: False
pt_br: ``required``: Valor booleano especificando se o parâmetro é necessário. Optional. Padrão: Falso
zh_cn: “required”：用于指定参数是否为必需参数的布尔值。可选。缺省值：False
zh_tw: ``required``：用來指定參數是否為必要項目的布林值。選用項目。預設值：False

source: ``defaultValue``: Value to be used if the parameter is not provided when a request is initiated. Optional.
ja: ``defaultValue``: リクエストの開始時にパラメーターが指定されていない場合に使用する値。オプション。
pt_br: ``defaultValue``: Valor a ser usado se o parâmetro não for fornecido quando uma solicitação é iniciada. Optional.
zh_cn: “defaultValue”：启动请求时，如果没有提供该参数，那么将使用此值。可选。
zh_tw: ``defaultValue``：起始要求時未提供參數的情況要使用的值。選用項目。

source: The ``bundleId``, ``version``, ``actionId`` and ``parameterId`` values have the following restrictions:
ja: ``bundleId``、``version``、``actionId``、および ``parameterId`` 値には、以下の制限があります。
pt_br: Os valores ``bundleId``, ``version``, ``actionId`` e ``parameterId`` possuem as seguintes restrições:
zh_cn: “bundleId”、“version”、“actionId”和“parameterId”值具有以下限制：
zh_tw: ``bundleId``、``version``、``actionId`` 及 ``parameterId`` 值具有下列限制：

source: Maximum length of 255 characters
ja: 最大長 255 文字
pt_br: Comprimento máximo de 255 caracteres
zh_cn: 最大长度为 255 个字符
zh_tw: 長度上限為 255 個字元

source: Must comprise only alpha-numeric characters (a-z, A-Z, 0-9) and the following special characters:
ja: 英数字 (a-z、A-Z、0-9) および以下の特殊文字のみで構成する必要があります。
pt_br: Deve abranger apenas caracteres alfanuméricos (a-z, A-Z, 0-9) e os seguintes caracteres especiais:
zh_cn: 必须仅包含字母数字字符（a-z、A-Z 和 0-9）以及下列特殊字符：
zh_tw: 只能包含英數字元（a-z、A-Z 和 0-9）及下列特殊字元：

source: dash (-)
ja: ダッシュ (-)
pt_br: hífen (-)
zh_cn: 短划线 (-)
zh_tw: 橫線 (-)

source: underscore (_)
ja: アンダースコアー (_)
pt_br: sublinhado (_)
zh_cn: 下划线 (_)
zh_tw: 底線 (_)

source: dot (.)
ja: ドット (.)
pt_br: ponto (.)
zh_cn: 点 (.)
zh_tw: 點 (.)

source: Extension packages are managed in the IoT Platform using the following REST APIs.
ja: 拡張パッケージは、以下の REST API を使用して IoT Platform で管理します。
pt_br: Pacotes de extensão são gerenciados no IoT Platform usando as seguintes APIs REST.
zh_cn: 可使用以下 REST API 在 IoT Platform 中管理扩展包。
zh_tw: 在 IoT Platform 中使用下列 REST API 來管理延伸套件。

source: List all device management extension packages:
ja: すべてのデバイス管理拡張パッケージをリストします。
pt_br: Lista todos os pacotes de extensão de gerenciamento de dispositivo:
zh_cn: 列出所有设备管理扩展包：
zh_tw: 列出所有裝置管理延伸套件：

source: Create a new device management extension package:
ja: 新しいデバイス管理拡張パッケージを作成します。
pt_br: Cria um novo pacote de extensão de gerenciamento de dispositivo:
zh_cn: 创建新的设备管理扩展包：
zh_tw: 建立新的裝置管理延伸套件：

source: Get a specific device management extension package:
ja: 特定のデバイス管理拡張パッケージを取得します。
pt_br: Obtém um pacote de extensão de gerenciamento de dispositivo específico:
zh_cn: 获取特定设备管理扩展包：
zh_tw: 取得特定的裝置管理延伸套件：

source: Update a device management extension package:
ja: デバイス管理拡張パッケージを更新します。
pt_br: Atualiza um pacote de extensão de gerenciamento de dispositivo:
zh_cn: 更新设备管理扩展包：
zh_tw: 更新裝置管理延伸套件：

source: Delete a device management extension package:
ja: デバイス管理拡張パッケージを削除します。
pt_br: Exclui um pacote de extensão de gerenciamento de dispositivo:
zh_cn: 删除设备管理扩展包：
zh_tw: 刪除裝置管理延伸套件：

source: For more information on the REST APIs for device management extension packages refer to the `version 2 API documentation <../../swagger/v0002.html>`_.
ja: デバイス管理拡張パッケージのための REST API について詳しくは、`バージョン 2 API の資料 <../../swagger/v0002.html>`_を参照してください。
pt_br: Para obter mais informações sobre as APIs REST para pacotes de extensão de gerenciamento de dispositivos, consulte a documentação da API da versão 2 <../../swagger/v0002.html>`_.
zh_cn: 有关用于设备管理扩展包的 REST API 的更多信息，请参阅 `V2 API 文档 <../../swagger/v0002.html>`_。
zh_tw: 如需裝置管理延伸套件 REST API 的相關資訊，請參閱 `第 2 版 API 文件 <../../swagger/v0002.html>`_。

source: Supporting Custom Device Management Actions
ja: カスタムのデバイス管理操作のサポート
pt_br: Suportando Ações de gerenciamento de dispositivo customizado
zh_cn: 支持定制设备管理操作
zh_tw: 支援自訂裝置管理動作

source: Device management actions defined in an extension package may only be initiated against devices which support those actions. A device specifies what types of actions it supports when it publishes a manage request to the IoT Platform. In order to allow a device to receive custom actions defined in a particular extension package, the device must specify that extension's bundle identifier in the supports object when publishing a manage request.
ja: 拡張パッケージに定義されたデバイス管理操作は、その操作をサポートするデバイスに対してのみ開始できます。デバイスは、管理リクエストを IoT Platform にパブリッシュするときに、そのデバイスでサポートしている操作のタイプを指定します。特定の拡張パッケージで定義されたカスタム操作をデバイスが受け取れるようにするには、デバイスが管理リクエストをパブリッシュするときに、その拡張のバンドル ID をサポート・オブジェクトに指定する必要があります。
pt_br: Ações de gerenciamento de dispositivo definidas em um pacote de extensão só podem ser iniciadas em dispositivos que suportam essas ações. Um dispositivo especifica quais tipos de ações ele suporta quando publica uma solicitação de gerenciamento para o IoT Platform. Para permitir que um dispositivo receba ações customizadas definidas em um determinado pacote de extensão, o dispositivo deve especificar que o identificador do pacote configurável da extensão suporta objeto ao publicar uma solicitação de gerenciamento.
zh_cn: 扩展包中定义的设备管理操作只能针对支持这些操作的设备启动。设备在向 IoT Platform 发布管理请求时指定其支持的操作类型。为了允许设备接收特定扩展包中定义的定制操作，该设备在发布管理请求时，必须在支持对象中指定此扩展包标识。
zh_tw: 延伸套件中定義的裝置管理動作只能針對支援這些動作的裝置進行起始。裝置在將管理要求發佈到 IoT Platform 時會指定它支援哪些類型的動作。為了容許裝置接收特定延伸套件中定義的自訂動作，裝置在發佈管理要求時必須在支援物件中指定該延伸的組合 ID。

source: For additional information about device manage requests, refer to `Device Management Protocol <index.html>`__.
ja: デバイス管理リクエストについて詳しくは、`デバイス管理プロトコル <index.html>`__を参照してください。
pt_br: Para obter informações adicionais sobre solicitações de gerenciamento de dispositivo, consulte `Protocolo de gerenciamento de dispositivo <index.html>`__.
zh_cn: 有关设备管理请求的其他信息，请参阅 `设备管理协议 <index.html>`__。
zh_tw: 如需裝置管理要求的相關資訊，請參閱 `裝置管理通訊協定 <index.html>`__。

source: Initiating Custom Device Management Actions
ja: カスタムのデバイス管理操作の開始
pt_br: Iniciando Ações de gerenciamento de dispositivo customizado
zh_cn: 启动定制设备管理操作
zh_tw: 起始自訂裝置管理動作

source: Custom device management actions are initiated using the same REST API as the default device management actions:
ja: カスタムのデバイス管理操作は、デフォルトのデバイス管理操作と同じ REST API を使用して、次のように開始します。
pt_br: Ações de gerenciamento de dispositivo customizado são iniciadas usando a mesma API REST das ações de gerenciamento de dispositivo padrão:
zh_cn: 使用与缺省设备管理操作相同的 REST API 来启动定制设备管理操作：
zh_tw: 使用和預設裝置管理動作相同的 REST API 來起始自訂裝置管理動作：

source: The following information must be provided when initiating a request:
ja: リクエストを開始するときには、以下の情報を指定する必要があります。
pt_br: As seguintes informações devem ser fornecidas ao iniciar uma solicitação:
zh_cn: 启动请求时必须提供以下信息：
zh_tw: 起始要求時必須提供下列資訊：

source: The action ``<bundleId>/<actionId>``
ja: 操作 ``<bundleId>/<actionId>``
pt_br: A ação ``<bundleId>/<actionId>``
zh_cn: 操作“<bundleId>/<actionId>”
zh_tw: 動作 ``<bundleId>/<actionId>``

source: A list of devices to initiate the action against, with a maximum of 5000 devices
ja: 開始する操作の対象にするデバイスのリスト (最大デバイス数 5000)
pt_br: Uma lista de dispositivos com os quais iniciar a ação, com no máximo 5000 dispositivos
zh_cn: 要对其启动该操作的设备列表（最多包含 5000 台设备）
zh_tw: 要針對其起始動作的裝置清單，上限為 5000 個裝置

source: A list of parameters as defined in the custom action definition
ja: カスタム操作定義に定義されたパラメーターのリスト
pt_br: Uma lista de parâmetros, conforme definido na definição de ação customizada
zh_cn: 在定制操作定义中定义的参数列表
zh_tw: 自訂動作定義中定義的參數清單

source: The payload for initiating a request has the following format:
ja: リクエストを開始するためのペイロードの形式は以下のとおりです。
pt_br: A carga útil para iniciar uma solicitação tem o seguinte formato:
zh_cn: 用于启动请求的有效内容具有以下格式：
zh_tw: 用於起始要求的有效負載具有下列格式：

source: Handling Custom Device Management Actions
ja: カスタムのデバイス管理操作の処理
pt_br: Manipulando Ações de gerenciamento de dispositivo customizado
zh_cn: 处理定制设备管理操作
zh_tw: 處理自訂裝置管理動作

source: When a custom action is initiated against a device, an MQTT message will be published to the device. The message will contain any parameters that were specified as part of the request. When the device receives this message, it is expected to either execute the action or respond with an error code indicating that it cannot complete the action at this time.
ja: カスタム操作をデバイスに対して開始すると、そのデバイスに MQTT メッセージがパブリッシュされます。このメッセージには、リクエストの一部として指定したパラメーターが含まれています。このメッセージを受け取ったデバイスは、操作を実行するか、現時点では操作を実行できないことを示すエラー・コードを出して応答する必要があります。
pt_br: Quando uma ação customizada é iniciada em um dispositivo, uma mensagem MQTT é publicada para o dispositivo. A mensagem conterá qualquer parâmetro especificado como parte da solicitação. Quando o dispositivo recebe essa mensagem, espera-se que ele execute a ação ou responda com um código de erro indicando que não pode concluir a ação naquele momento.
zh_cn: 当对设备启动定制操作时，会向该设备发布 MQTT 消息。该消息将包含作为请求的一部分指定的所有参数。当设备收到此消息时，它应该执行相应操作或者返回错误码以指示此时无法完成该操作。
zh_tw: 針對裝置起始自訂動作時，將向裝置發佈 MQTT 訊息。訊息將包含任何已指定為要求一部分的參數。如果裝置收到此訊息，則應該執行該動作，或者以錯誤碼進行回應，指出它目前無法完成該動作。

source: To indicate that the action was completed successfully, a device should publish a response with ``rc`` set to ``200``.
ja: 操作が正常に完了したことを示す場合、デバイスは ``rc`` を ``200`` に設定した応答をパブリッシュします。
pt_br: Para indicar que a ação foi concluída com êxito, um dispositivo deve publicar uma resposta com ``rc`` configurado como ``200``.
zh_cn: 要指示已成功完成该操作，设备应发布“rc”设置为“200”的响应。
zh_tw: 若要指出動作已順利完成，則裝置應該發佈回應，其中 ``rc`` 設為 ``200``。

source: Below is an example exchange between the server and a device.
ja: サーバーとデバイスの間の交換の例を以下に示します。
pt_br: Abaixo, um exemplo de troca entre o servidor e um dispositivo.
zh_cn: 以下是服务器和设备之间的交换示例。
zh_tw: 下面舉例說明了伺服器與裝置之間的交換。

source: Example
ja: 例
pt_br: Exemplo:
zh_cn: 示例
zh_tw: 範例

source: In this example, we will walk through defining a new device management extension and executing an action defined within that extension.
ja: この例では、新しいデバイス管理拡張を定義し、その拡張内に定義した操作を実行する方法を示します。
pt_br: Neste exemplo, percorreremos a definição de uma nova extensão de gerenciamento de dispositivo e a execução de uma ação definida dentro dessa extensão.
zh_cn: 在该示例中，我们将引导您定义新设备管理扩展并执行该扩展中定义的操作。
zh_tw: 在此範例中，我們將逐步引導您定義新的裝置管理延伸以及執行該延伸中定義的動作。

source: Some company manufactures ``exampleDeviceType`` devices. Users of these devices have the ability to manage plug-ins which run on the devices. To facilitate remote management of plug-ins on ``exampleDeviceType`` devices, the manufacturer provides a device management extension which users can import into their Watson IoT Platform organization.
ja: ある企業が、``exampleDeviceType`` デバイスを製造しています。このデバイスのユーザーは、デバイス上で実行するプラグインを管理できます。``exampleDeviceType`` デバイス上のプラグインを簡単にリモート管理できるように、この製造メーカーは、ユーザーの Watson IoT Platform 組織にインポートできるデバイス管理拡張を提供しています。
pt_br: Alguns dispositivos ``exampleDeviceType`` de fabricantes de empresas. Os usuários desses dispositivos têm a capacidade de gerenciar plug-ins que executam nos dispositivos. Para facilitar o gerenciamento remoto de plug-ins nos dispositivos ``exampleDeviceType``, o fabricante fornece uma extensão de gerenciamento de dispositivo que os usuários podem importar em suas organizações do Watson IoT Platform.
zh_cn: 某家公司生产了“exampleDeviceType”设备。此类设备的用户能够管理设备上运行的插件。为便于远程管理“exampleDeviceType”设备上的插件，该制造商提供了设备管理扩展，以供用户导入到他们自己的 Watson IoT Platform 组织中。
zh_tw: 某個公司製造了 ``exampleDeviceType`` 裝置。這些裝置的使用者可以管理執行於裝置上的外掛程式。為了方便對 ``exampleDeviceType`` 裝置上的外掛程式進行遠端管理，製造商提供了使用者可以匯入到 Watson IoT Platform 組織中的裝置管理延伸。

source: The extension JSON document used in this example:
ja: この例で使用する拡張 JSON 文書:
pt_br: O documento JSON de extensão usado neste exemplo:
zh_cn: 该示例中使用的扩展 JSON 文档：
zh_tw: 此範例中使用的延伸 JSON 文件：

source: In this device management extension package, 4 actions are defined:
ja: このデバイス管理拡張パッケージには、以下の 4 つの操作が定義されています。
pt_br: Neste pacote de extensão de gerenciamento de dispositivo, quatro ações são definidas:
zh_cn: 在该设备管理扩展包中，定义了 4 个操作：
zh_tw: 在此裝置管理延伸套件中，定義了 4 個動作：

source: The extension is added using the REST API:
ja: この拡張を、REST API を使用して追加します。
pt_br: A extensão é incluída usando a API REST:
zh_cn: 使用 REST API 添加了该扩展：
zh_tw: 使用 REST API 來新增此延伸：

source: Devices registered in organization ``<orgId>`` are now able to specify that they support ``exampleDeviceType-actions-v1`` actions when publishing a manage request.
ja: 以上で、組織 ``<orgId>`` に登録されたデバイスは、管理リクエストをパブリッシュするときに、``exampleDeviceType-actions-v1`` 操作をサポートしていることを示せるようになりました。
pt_br: Dispositivos registrados na organização ``<orgId>`` agora podem especificar que eles suportam as ações ``exampleDeviceType-actions-v1`` ao publicar uma solicitação de gerenciamento.
zh_cn: 在组织“<orgId>”中注册的设备现在能够指定在发布管理请求时其支持“exampleDeviceType-actions-v1”操作。
zh_tw: 現在，組織 ``<orgId>`` 中登錄的裝置可以在發佈管理要求時，指定它們支援 ``exampleDeviceType-actions-v1`` 動作。

source: In this example, the manage request sent by a device would look like this:
ja: この例では、デバイスから送信する管理リクエストは以下のようなものになります。
pt_br: Neste exemplo, a solicitação de gerenciamento enviada por um dispositivo deve ser semelhante a esta:
zh_cn: 在该示例中，设备发送的管理请求类似于：
zh_tw: 在此範例中，裝置所傳送的管理要求看起來如下：

source: The device should then receive the following response from the IoT Platform:
ja: そして、デバイスは IoT Platform から以下の応答を受け取ります。
pt_br: O dispositivo deve então receber a seguinte resposta do IoT Platform:
zh_cn: 然后，该设备应从 IoT Platform 收到以下响应：
zh_tw: 隨後，裝置應該會從 IoT Platform 接收下列回應：
