Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/custom_actions.po
Languages: ja, pt_br, zh_cn, zh_tw

source: At this point, an action defined in the ``exampleIoT-exampleDeviceType-v1`` extension can be initiated against some devices.
ja: この時点で、``exampleIoT-exampleDeviceType-v1`` 拡張に定義された操作をデバイスに対して開始することができます。
pt_br: Neste ponto, uma ação definida na extensão ``exampleIoT-exampleDeviceType-v1`` pode ser iniciada em alguns dispositivos.
zh_cn: 此时，可以针对某些设备启动“exampleIoT-exampleDeviceType-v1”扩展中定义的操作。
zh_tw: 此時，可以針對部分裝置起始 ``exampleIoT-exampleDeviceType-v1`` 延伸中定義的動作。

source: The payload for initiating an ``installPlugin`` action will look like the following:
ja: ``installPlugin`` 操作を開始するためのペイロードは、以下のようなものになります。
pt_br: A carga útil para iniciar uma ação ``installPlugin`` deve ser semelhante à seguinte:
zh_cn: 用于启动“installPlugin”操作的有效内容将与下面类似：
zh_tw: 用來起始 ``installPlugin`` 動作的有效負載看起來如下：

source: The request is initiated using the REST API:
ja: 以下の REST API を使用して、リクエストを開始します。
pt_br: A solicitação é iniciada usando a API REST:
zh_cn: 使用 REST API 启动请求：
zh_tw: 使用 REST API 來起始此要求：

source: Devices ``device0`` and ``device1`` of type ``exampleDeviceType`` will then receive the following MQTT message:
ja: そして、タイプ ``exampleDeviceType`` のデバイス ``device0`` および ``device1`` が、以下の MQTT メッセージを受け取ります。
pt_br: Os dispositivos ``device0`` e ``device1`` do tipo ``exampleDeviceType`` receberão então a seguinte mensagem MQTT:
zh_cn: 然后，类型为“exampleDeviceType”的设备“device0”和“device1”将收到以下 MQTT 消息：
zh_tw: 隨後，類型為 ``exampleDeviceType`` 的裝置 ``device0`` 和 ``device1`` 將收到下列 MQTT 訊息：

source: Each device will take action on the message, installing the new plug-in. Once installation is complete, the devices respond with the following message to indicate that the action completed successfully:
ja: 各デバイスは、メッセージの操作を実行して、新しいプラグインをインストールします。インストールが完了したら、デバイスは、操作が正常に完了したことを示す以下のメッセージを出して応答します。
pt_br: Cada dispositivo efetuará ação na mensagem, instalando o novo plug-in. Depois que a instalação é concluída, os dispositivos respondem com a seguinte mensagem para indicar que a ação foi concluída com êxito:
zh_cn: 每个设备将执行此消息上的操作：安装新插件。完成安装后，设备立即返回以下消息以指示成功完成该操作：
zh_tw: 每個裝置都將處理訊息，安裝新的外掛程式。完成安裝後，裝置會以下列訊息進行回應，指出動作已順利完成：

source: At this point, the ``installPlugin`` action is now complete.
ja: この時点で、`installPlugin`` 操作は完了します。
pt_br: Neste ponto, a ação ``installPlugin`` agora é concluída.
zh_cn: 此时，“installPlugin”操作现已完成。
zh_tw: 現在，``installPlugin`` 動作已完成。

source: API Examples
ja: API の例
pt_br: Exemplos de API
zh_cn: API 示例
zh_tw: API 範例

source: The following are examples of API requests that may be useful when performing device management actions:
ja: デバイス管理操作を実行するときに参考になる API リクエストの例を以下に示します。
pt_br: A seguir, há exemplos de solicitações de API que podem ser úteis ao executar ações de gerenciamento de dispositivos:
zh_cn: 以下是执行设备管理操作时可能有用的 API 请求示例：
zh_tw: 下面舉例說明了執行裝置管理動作時可能會很有用的 API 要求：

source: Create a new device management extension:
ja: 新しいデバイス管理拡張を作成します。
pt_br: Criar uma nova extensão de gerenciamento de dispositivo:
zh_cn: 创建新的设备管理扩展：
zh_tw: 建立新的裝置管理延伸：

source: List device management extensions:
ja: デバイス管理拡張をリストします。
pt_br: Listar extensões de gerenciamento de dispositivo:
zh_cn: 列出设备管理扩展：
zh_tw: 列出裝置管理延伸：

source: Initiate a device management request:
ja: デバイス管理リクエストを開始します。
pt_br: Iniciar uma solicitação de gerenciamento de dispositivo:
zh_cn: 启动设备管理请求：
zh_tw: 起始裝置管理要求：

source: List in-progress or completed device management requests:
ja: 進行中のデバイス管理リクエスト、または完了したデバイス管理リクエストをリストします。
pt_br: Listar solicitações de gerenciamento de dispositivos em andamento ou concluídas:
zh_cn: 列出正在进行中或已完成的设备管理请求：
zh_tw: 列出進行中或已完成的裝置管理要求：

source: View status of a particular device management request:
ja: 特定のデバイス管理リクエストの状況を表示します。
pt_br: Visualizar status de uma determinada solicitação de gerenciamento de dispositivo:
zh_cn: 查看特定设备管理请求的状态：
zh_tw: 檢視特定裝置管理要求的狀態：
