Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/index.po
Languages: de, ja, zh_tw

source: The IoT Platform can send this request to a device to update values of one or more device attributes. Attributes that can be updated by the Rest API are location, metadata, device information and firmware.
de: IoT Platform kann diese Anforderung zum Aktualisieren der Werte für mindestens ein Geräteattribut an ein Gerät senden. Die Attribute für Position, Metadaten, Gerätedaten und Firmware können aktualisiert werden.
ja: IoT Platform は、このリクエストをデバイスに送信して、1 つ以上のデバイス属性の値を更新できます。Rest API によって更新できる属性は、ロケーション、メタデータ、デバイス情報、およびファームウェアです。
zh_tw: IoT Platform 可以將這項要求傳送給裝置，以更新一或多個裝置屬性的值。可由 REST API 更新的屬性包含位置、meta 資料、裝置資訊及韌體。

source: The "value" is the new value of the device attribute. It is a complex field matching the device model. Only writeable fields should be updated as a result of this operation. Values can be updated in:
de: Die Angabe unter "value" ist der neue Wert des Geräteattributs. Es ist ein komplexes Feld, das dem Gerätemodell entspricht. Als Ergebnis dieser Operation müssen nur änderbare Felder aktualisiert werden. Folgende Werte können aktualisiert werden:
ja: "value" はデバイス属性の新しい値です。これはデバイス・モデルに一致する複合フィールドです。この操作の結果として書き込み可能なフィールドだけを更新する必要があります。以下の値を更新できます。
zh_tw: "value" 是新的裝置屬性值。這是個符合裝置模型的複式欄位。這項作業應該只更新可寫入的欄位。可更新以下項目的值：

source: location (see Update location section for details)
de: Position (Details siehe Abschnitt 'Position aktualisieren')
ja: location (詳しくは『ロケーションの更新』セクションを参照)
zh_tw: location（請參閱「更新位置區段」以取得詳細資料）

source: metadata (Optional)
de: Metadaten (optional)
ja: metadata (オプション)
zh_tw: metadata（選用）

source: deviceInfo (Optional)
de: Geräteinformationen (optional)
ja: deviceInfo (オプション)
zh_tw: deviceInfo（選用）

source: mgmt.firmware (see Firmware update process for details)
de: mgmt.firmware (Details siehe 'Firmware-Update-Prozess')
ja: mgmt.firmware (詳しくはファームウェア更新プロセスを参照)
zh_tw: mgmt.firmware（請參閱「韌體更新程序」以取得詳細資料）

source: Message format
de: Nachrichtenformat
ja: メッセージの形式
zh_tw: 訊息格式

source: Add Error Code
de: Fehlercode hinzufügen
ja: エラー・コードの追加
zh_tw: 新增錯誤碼

source: Devices can choose to notify the IoT Platform device management server about changes in their error status.
de: Geräte können festlegen, dass der Gerätemanagementserver von IoT Platform über Änderungen ihres Fehlerstatus informiert wird.
ja: デバイスはエラー状況の変化を IoT Platform デバイス管理サーバーに通知することを選択できます。
zh_tw: 裝置可以選擇通知 IoT Platform 裝置管理伺服器有關其錯誤狀態的變更。

source: The "errorCode" is a current device error code that needs to be added to the IoT Platform.
de: Die Angabe "errorCode" ist ein aktueller Gerätefehlercode, der in IoT Platform hinzugefügt werden muss.
ja: "errorCode" は、IoT Platform に追加する必要のある現在のデバイス・エラー・コードです。
zh_tw: "errorCode" 是必須新增至 IoT Platform 的現行裝置錯誤碼。

source: Clear Error Codes
de: Fehlercodes löschen
ja: エラー・コードの消去
zh_tw: 清除錯誤碼

source: Devices can request that the Internet of Things Foundation clear all of their error codes.
de: Von Geräten kann angefordert werden, dass von Internet of Things Foundation alle Fehlercodes gelöscht werden.
ja: デバイスは、すべてのエラー・コードを消去するよう Internet of Things Foundation にリクエストすることができます。
zh_tw: 裝置可以要求 Internet of Things Foundation 清除其所有錯誤碼。

source: Add Log
de: Protokoll hinzufügen
ja: ログの追加
zh_tw: 新增日誌

source: Devices can choose to notify IoTF device management support about changes a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data.
de: Bei Geräte kann festgelegt werden, dass die IoTF-Gerätemanagementunterstützung über Änderungen benachrichtigt werden, die in einem neuen Protokolleintrag erfasst werden. Ein Protokolleintrag umfasst eine Protokollnachricht, ihre Zeitmarke und optional base64-codierte binäre Diagnosedaten.
ja: デバイスは、新しいログ・エントリーに関する変更を IoTF デバイス管理サポートに通知することを選択できます。ログ・エントリーには、ログ・メッセージ、タイム・スタンプと重大度、およびオプションで base64 でエンコードしたバイナリー診断データが含まれます。
zh_tw: 裝置可以選擇通知 IoTF 裝置管理支援有關新日誌項目的變更。日誌項目包括日誌訊息、其時間戳記和嚴重性，以及可能包含 base64 編碼的二進位診斷資料。

source: "message" is a diagnostic message that needs to be added to IoTF. "timestamp" is a date and time of the log entry in ISO8601 format. "data" is an optional base64-encoded diagnostic data. "severity" is a severity of the message (0: informational, 1: warning, 2: error).
de: "message" ist eine Diagnosenachricht, die zu IoTF hinzugefügt werden muss. "timestamp" umfasst ein Datum und eine Uhrzeit des Protokolleintrags im Format ISO8601. "data" sind optionale base64-codierte Diagnosedaten. "severity" ist der Schweregrad der Nachricht (0: Informationsnachricht, 1: Warnung, 2: Fehler).
ja: "message" は、IoTF に追加する必要のある診断メッセージです。"timestamp" はログ・エントリーの日時 (ISO8601 形式) です。"data" は、base64 でエンコードしたオプションの診断データです。"severity" はメッセージの重大度です (0: 通知、1: 警告、2: エラー)。
zh_tw: 「訊息」是必須新增至 IoTF 的診斷訊息。「時間戳記」是 ISO8601 格式的日誌項目的日期和時間。「資料」是可能包含的 base64 編碼診斷資料。「嚴重性」是訊息的嚴重性（0：參考、1：警告、2：錯誤）。

source: Clear Logs
de: Protokolle löschen
ja: ログの消去
zh_tw: 清除日誌

source: Devices can request that the Internet of Things Foundation clear all of their log entries.
de: Von Geräten kann angefordert werden, dass von Internet of Things Foundation alle Protokolleinträge gelöscht werden.
ja: デバイスは、すべてのログ・エントリーを消去するよう Internet of Things Foundation にリクエストすることができます。
zh_tw: 裝置可以要求 Internet of Things Foundation 清除其所有日誌項目。

source: Observe Attribute Changes
de: Attributänderungen beobachten
ja: 属性変更の監視
zh_tw: 察覺屬性變更

source: The IoT Platform can send this request to a device to observe changes of one or more device attributes. When the device receives this request, it must send a notification request ("notify" message) to the IoT Platform whenever the observed attributes value changes.
de: IoT Platform kann diese Anforderung zum Beobachten der Änderungen für mindestens ein Geräteattribut an ein Gerät senden. Wenn diese Anforderung vom Gerät empfangen wird, muss das Gerät eine Benachrichtigungsanforderung (die Nachricht "notify") an IoT Platform senden, sobald sich die beobachteten Attributwerte ändern.
ja: IoT Platform は、1 つ以上のデバイス属性の変更を監視するためにこのリクエストをデバイスに送信できます。このリクエストを受け取ったデバイスは、監視対象の属性値が変更されるたびに通知リクエスト (" 通知 " メッセージ) を IoT Platform に送信する必要があります。
zh_tw: IoT Platform 可以將這項要求傳送給裝置，來觀察一或多個裝置屬性的變更。當裝置接收到此要求時，每當觀察的屬性值變更時，就必須傳送通知要求（"notify" 訊息）給 IoT Platform。

source: Devices must implement observe, notify & cancel operations in order to support :ref:`firmware-actions-update`.
de: Von einem Gerät müssen die Operationen zum Beobachten, Benachrichtigen und Abbrechen implementiert werden, damit :ref:`firmware-actions-update` unterstützt wird.
ja: :ref:`firmware-actions-update` をサポートするには、監視、通知、およびキャンセル操作をデバイスに実装する必要があります。
zh_tw: 裝置必須實作觀察、通知並取消作業，才能支援 :ref:`firmware-actions-update`。

source: The "fields" field is an array of the device attribute names from the device model. For example, values could be "location", "mgmt.firmware" or "mgmt.firmware.state". If a complex field, such as "mgmt.firmware" is specified, it is expected that its underlying fields are updated at the same time, such that only a single notify message is generated.
de: Das Feld "fields" ist eine Feldgruppe aus den Geräteattributnamen des Gerätemodells. Gültige Werte sind zum Beispiel "location", "mgmt.firmware" und"mgmt.firmware.state". Wenn ein komplexes Feld wie "mgmt.firmware" angegeben wird, wird erwartet, dass die zugrunde liegenden Felder gleichzeitig aktualisiert werden, sodass nur eine einzige Hinweisnachricht generiert wird.
ja: "fields" フィールドは、デバイス・モデルのデバイス属性名から成る配列です。値は、"location"、"mgmt.firmware"、"mgmt.firmware.state" などを指定できます。"mgmt.firmware" のような複合フィールドを指定した場合は、その複数の基礎フィールドが同時に更新された場合に通知メッセージが 1 つだけ生成されます。
zh_tw: "fields" 欄位是來自裝置模型之裝置屬性名稱的陣列。例如，值可以是 "location"、"mgmt.firmware" 或 "mgmt.firmware.state"。如果指定複式欄位（例如 "mgmt.firmware"），則預期其基礎欄位也會同時更新，因此只會產生單一通知訊息。

source: The "message" field used in the response can be specified if "rc" is not 200. If any field value which was to be observed could not be retrieved, "rc" should be set to 404 (if not found) or 500 (any other reason). When values for fields to be observed cannot be found, "fields" should contain an array of elements with "field" set to the name of each field that could not be read, "value" fields should be omitted. For the response code to be set to 200, both "field" and "value" must be specified, "value" is the current value of an attribute identified by "field" content.
de: Das Feld "message", das in der Antwort verwendet wird, kann angegeben werden, wenn "rc" nicht 200 ist. Wenn ein Feldwert, der beobachtet werden soll, nicht abgerufen werden konnte, muss für "rc" der Wert 404 (falls nicht gefunden) oder 500 (bei anderen Gründen) eingestellt werden. Wenn Werte für Felder, die beobachtet werden sollen, nicht gefunden werden können, muss "fields" eine Feldgruppe aus Elementen enthalten, wobei für "field" der Name jedes einzelnen Felds eingestellt ist, das nicht gelesen werden konnte; Felder des Typs "value" müssen ausgeschlossen sein. Damit der Antwortcode auf 200 gesetzt ist, müssen sowohl "field" als auch "value" angegeben sein; "value" enthält den aktuellen Wert eines Attributs, das von "field" angegeben wird.
ja: "rc" が 200 でない場合は、レスポンスで使用する "message" フィールドを指定可能です。監視対象のフィールド値を取得できない場合は、"rc" を 404 (見つからない場合) または 500 (他のすべての理由) に設定します。監視対象のフィールドの値が見つからない場合、"fields" に含まれる配列の要素 "field" には読み取れなかった各フィールドの名前を設定し、"value" フィールドは省略します。応答コードを 200 に設定するためには、"field" と "value" の両方を指定する必要があります。"value" は "field" の内容で識別される属性の現行値です。
zh_tw: 如果 "rc" 不是 200，則可以指定回應中使用的 "message" 欄位。如果無法擷取任何一個要觀察的欄位值，"rc" 應該設為 404（如果找不到）或 500（任何其他理由）。若找不到要觀察的欄位值，"fields" 應該包含元素的陣列，並將 "field" 設為每一個無法讀取的欄位名稱，"value" 欄位則應該省略。若回應碼設為 200，"field" 及 "value" 兩者都必須指定，且 "value" 是 "field" 內容所識別之屬性的現行值。

source: Cancel Attribute Observation
de: Attributbeobachtung abbrechen
ja: 属性の監視のキャンセル
zh_tw: 取消屬性觀察

source: The IoT Platform can send this request to a device to cancel the current observation of one or more device attributes. The "fields" is an array of the device attribute names from the device model, for example, values could be "location", "mgmt.firmware" or "mgmt.firmware.state".
de: IoT Platform kann diese Anforderung zum Abbrechen der aktuellen Beobachtung von mindestens einem Geräteattribut an ein Gerät senden. Das Feld "fields" ist eine Feldgruppe aus den Geräteattributnamen des Gerätemodells; gültige Werte sind zum Beispiel "location", "mgmt.firmware" und "mgmt.firmware.state".
ja: IoT Platform は、このリクエストをデバイスに送信して、現在行われている 1 つ以上のデバイス属性の監視をキャンセルすることができます。"fields" は、デバイス・モデルのデバイス属性名から成る配列です。値は、"location"、"mgmt.firmware"、"mgmt.firmware.state" などを指定できます。
zh_tw: IoT Platform 可以將這項要求傳送給裝置，以取消一或多個裝置屬性的現行觀察。"fields" 是來自裝置模型之裝置屬性名稱的陣列，例如，值可以是 "location"、"mgmt.firmware" 或 "mgmt.firmware.state"。

source: The "message" field must be specified if "rc" is not 200.
de: Das Feld "message" muss angegeben werden, wenn "rc" nicht 200 ist.
ja: "rc" が 200 でない場合は、"message" フィールドを指定する必要があります。
zh_tw: 如果 "rc" 不是 200，則必須指定 "message" 欄位。

source: Notify Attribute Changes
de: Über Attributänderungen benachrichtigen
ja: 属性変更の通知
zh_tw: 通知屬性變更

source: The IoT Platform can make an observation request referring to a specific attribute or set of values. When the value of the attribute or attributes changes, the device must send a notification containing the latest value.
de: IoT Platform kann eine Beobachtungsanforderung für ein bestimmtes Attribut oder eine Gruppe von Werten ausführen. Bei einer Änderung eines Attributwerts oder mehrerer Attributwerte muss von dem Gerät eine Benachrichtigung gesendet werden, in der die neuesten Werte enthalten sind.
ja: IoT Platform は、1 つの属性値または属性値のセットを参照する監視リクエストを送信できます。1 つまたは複数の属性の値が変更された場合、デバイスは最新の値を含む通知を送信する必要があります。
zh_tw: IoT Platform 可以產生參照一個特定屬性或一組值的觀察要求。當一或多個屬性的值變更時，裝置必須傳送包含最新值的通知。

source: The "field_name" value is the name of the attribute that has changed, the "field_value" is the current value of the attribute. The attribute can be a complex field, if multiple values in a complex field are updated as a result of a single operation, only a single notification message should be sent.
de: Der Wert für "field_name" ist der Name des Attributs, das sich geändert hat, der Wert für "field_value" ist der aktuelle Wert des Attributs. Das Attribut kann ein komplexes Feld sein, falls mehrere Werte in einem komplexen Feld als Ergebnis einer einzigen Operation aktualisiert werden; es muss nur eine einzelne Benachrichtigung gesendet werden.
ja: "field_name" 値は変更された属性の名前、"field_value" は属性の現行値です。属性は複合フィールドにすることも可能です。1 つの操作の結果として複合フィールド内の複数の値が更新された場合に、通知メッセージが 1 つだけ送信されます。
zh_tw: "field_name" 值是已變更的屬性的名稱，"field_value" 則是該屬性的現行值。屬性可以是複式欄位，如果在單一作業中更新了複式欄位中的多個值，則應該只傳送單一通知訊息。

source: If notify request is processed successfully, "rc" should be set to 200. If the request is not correct, "rc" should be set to 400. If the field specified in the notify request is not being observed, "rc" should be set to 404.
de: Wenn die Benachrichtigungsanforderung erfolgreich verarbeitet wird, muss für "rc" der Wert 200 eingestellt sein. Wenn die Anforderung nicht korrekt ist, muss für "rc" der Wert 400 eingestellt sein. Wenn das in der Benachrichtigungsanforderung angegebene Feld nicht beobachtet wird, muss für "rc" der Wert 404 eingestellt sein.
ja: 通知リクエストが正常に処理された場合は、"rc" を 200 に設定する必要があります。リクエストが正しくない場合は、"rc" を 400 に設定します。通知リクエストで指定されたフィールドが監視されていない場合は、"rc" を 404 に設定します。
zh_tw: 如果已順利處理通知要求，"rc" 應該設為 200。如果要求不正確，"rc" 應該設為 400。如果未觀察通知要求中指定的欄位，"rc" 應該設為 404。

source: 404: The topic name is incorrect, the device is not in the database, or there is no observation for the field reported.
de: 404: Der Abschnittsname ist falsch, das Gerät ist nicht in der Datenbank vorhanden, oder es ist keine Überwachung für das gemeldete Feld vorhanden.
ja: 404: トピック名が正しくないか、デバイスがデータベースにないか、フィールドの監視が報告されていません。
zh_tw: 404: 主題名稱不正確、裝置不在資料庫中，或未報告任何該欄位的觀察。

source: 500: An internal error occurred, contact IBM Support.
de: 500: Ein interner Fehler trat auf; wenden Sie sich an den IBM Support.
ja: 500: 内部エラーが発生しました。IBM サポートに連絡してください。
zh_tw: 500: 發生內部錯誤，請聯絡 IBM 支援中心。
