Repository: leehaesung/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/index.po
Languages: de, ja, zh_tw

source: Device Management Protocol
de: Gerätemanagementprotokoll
ja: デバイス管理プロトコル
zh_tw: 裝置管理通訊協定

source: Introduction
de: Einführung
ja: 概要
zh_tw: 簡介

source: The Device Management capabilities in the IoT Platform create a new class of connected devices, Managed Devices.
de: Die Gerätemanagementfunktionen in IoT Platform erstellen eine neue Klasse für verbundene Geräte (verwaltete Geräte).
ja: IoT Platform のデバイス管理機能は、接続デバイスの新しいクラスである管理対象デバイスを作成します。
zh_tw: IoT Platform 中的「裝置管理」功能會建立一個新的已連接裝置類別，稱為「受管理裝置」。

source: Managed Devices must, by definition, contain a management agent which can understand the IoT Platform Device Management Protocol, and send a Manage Device request to the IoT Platform Device Management server. Managed devices can access the device management operations as explained later in this document.
de: Verwaltete Geräte müssen per Definition einen Managementagenten enthalten, der das IoT Platform-Gerätemanagementprotokoll kennt, und eine Anforderung 'Gerät verwalten' an den IoT Platform-Gerätemanagementserver senden kann. Verwaltete Geräte können auf die Gerätemanagementoperationen zugreifen (wie später in diesem Dokument beschrieben).
ja: 管理対象デバイスには、この名前が示すとおり、管理エージェントが含まれていなければなりません。つまり、IoT Platform のデバイス管理プロトコルを理解して、管理デバイス・リクエストを IoT Platform のデバイス管理サーバーに送信できる管理エージェントです。本書内で後述していますが、管理対象デバイスは、デバイス管理操作にアクセスすることができます。
zh_tw: 依定義，「受管理裝置」必須包含一個管理代理程式，其可瞭解「IoT Platform 裝置管理通訊協定」，並將「管理裝置」要求傳送至「IoT Platform 裝置管理」伺服器。受管理裝置可以存取裝置管理作業，如本文件中稍後說明。

source: The Device Management Protocol defines a set of supported operations. A device management agent can support a subset of the operations, but the Manage device and Unmanage device operations must be supported. A device supporting firmware action operations must also support observation.
de: Das Gerätemanagementprotokoll definiert eine Gruppe unterstützter Operationen. Von einem Gerätemanagementagenten kann eine Teilmenge der Operationen unterstützt werden, die Operationen 'Gerät verwalten' und 'Gerät nicht verwalten' müssen jedoch unterstützt werden. Von einem Gerät, von dem Operationen für Firmwareaktionen unterstützt werden, muss auch eine Beobachtung unterstützt werden.
ja: デバイス管理プロトコルとは、サポートされる一連の操作を定義したものです。デバイス管理エージェントはこれらの操作のサブセットをサポートできますが、「デバイスを管理」操作と「デバイスを管理解除」操作のサポートは必須です。また、ファームウェア・アクション操作をサポートするデバイスでは、監視もサポートする必要があります。
zh_tw: 「裝置管理通訊協定」定義一組支援的作業。裝置管理代理程式可以支援部分作業，但必須支援「管理裝置」及「取消管理裝置」作業。支援韌體動作作業的裝置也必須支援觀察。

source: The Device Management Protocol is built on top of MQTT. For details specific to how Device Management Protocol interacts with MQTT please see `MQTT Connectivity for Devices <../mqtt.html>`__
de: Das Gerätemanagementprotokoll baut auf MQTT auf. Details zur Interaktion des Gerätemanagementprotokolls mit MQTT finden Sie unter `MQTT-Konnektivität für Geräte <../mqtt.html>`__.
ja: デバイス管理プロトコルは、MQTT を基礎として作成されています。デバイス管理プロトコルと MQTT の対話方法の詳細については、`MQTT デバイス接続<../mqtt.html>`__ の資料を参照してください。
zh_tw: 「裝置管理通訊協定」是建置在 MQTT 之上。如需「裝置管理通訊協定」如何與 MQTT 互動的特定詳細資訊，請參閱 `裝置的 MQTT 連線功能 <../mqtt.html>`__

source: The Device Management Lifecycle
de: Lebenszyklus im Gerätemanagement
ja: デバイス管理ライフサイクル
zh_tw: 裝置管理生命週期

source: A device and its associated device type are created in the IoT Platform using the dashboard or API.
de: Ein Gerät und der zugehörige Gerätetyp werden in IoT Platform mithilfe eines Dashboards oder einer API erstellt.
ja: デバイスおよびそれに関連したデバイス・タイプは、ダッシュボードまたは API を使用して IoT Platform に作成されます。
zh_tw: 裝置及其相關聯的裝置類型會使用儀表板或 API 建立在 IoT Platform 中。

source: The device connects to the IoT Platform and uses the 'Manage Device' operation to become a managed device.
de: Das Gerät stellt eine Verbindung zu IoT Platform her und verwendet die Operation 'Gerät verwalten', um zu einem verwalteten Gerät zu werden.
ja: デバイスは IoT Platform に接続し、「デバイスを管理」操作によって管理対象デバイスになります。
zh_tw: 裝置會連接至 IoT Platform，並使用「管理裝置」作業變成受管理裝置。

source: The device's metadata, as described in the Device Model can now be viewed and manipulated through device operations, for example, firmware update and device reboot.
de: Die Metadaten des Geräts können jetzt wie im Gerätemodell beschrieben angezeigt und mithilfe von Geräteoperationen geändert werden, zum Beispiel durch ein Firmware-Update oder einen Neustart des Geräts.
ja: これで、「デバイス・モデル」で説明したようなデバイスのメタデータを表示し、ファームウェアの更新やデバイスのリブートなどのデバイス操作によって操作できるようになりました。
zh_tw: 如「裝置模型」中所述，裝置的 meta 資料現在可以透過裝置作業（例如，韌體更新及裝置重新啟動）來檢視及操作。

source: The device can communicate updates through the device-management protocol, such as location or diagnostic information and error codes.
de: Von dem Gerät können Aktualisierungen über das Gerätemanagementprotokoll kommuniziert werden, zum Beispiel die Position oder Diagnoseinformationen und Fehlercodes.
ja: デバイスは、ロケーション、診断情報、エラー・コードなどの更新をデバイス管理プロトコルを介して伝達できます。
zh_tw: 裝置可以透過裝置管理通訊協定來傳遞更新項目，如：位置或診斷資訊，以及錯誤碼。

source: In order to provide a way to deal with defunct devices in large device populations, the 'Manage device' operation request has an optional lifetime parameter. This lifetime parameter is the number of seconds within which the device must make another 'Manage device' request in order to avoid being marked as dormant and becoming an unmanaged device.
de: Um ein Verfahren für die Handhabung nicht mehr vorhandener Geräte in Umgebungen mit umfangreichem Gerätebestand bereitzustellen, verfügt die Operation 'Gerät verwalten' über einen optionalen Parameter für den Lebenszyklus. Dieser Lebenszyklusparameter gibt den Zeitraum als Anzahl der Sekunden an, in dem ein Gerät eine weitere Anforderung des Typs 'Gerät verwalten' senden muss, um zu vermeiden, dass es als 'ruhend' angesehen und zu einem nicht verwalteten Gerät wird.
ja: デバイスが多数存在する環境で機能不良デバイスに対処できるように、「デバイスを管理」操作リクエストにはオプションのライフタイム・パラメーターが用意されています。このライフタイム・パラメーターは、休止のマークが付けられて非管理対象デバイスにならないように、デバイスが次の「デバイスを管理」リクエストを行わなければならない制限時間 (秒) です。
zh_tw: 為了提供一種方式來處理大量裝置群中失效的裝置，「管理裝置」作業要求具有一個選用的生命期限參數。這個生命期限參數是裝置必須在此期間內產生另一個「管理裝置」要求，以避免被標示為休眠並成為未受管理裝置的秒數。

source: When a device is decommissioned it can be removed from the IoT Platform using the dashboard or REST API.
de: Wenn ein Gerät stillgelegt wird, kann es mithilfe des Dashboards oder der REST-API von IoT Platform entfernt werden.
ja: 使用廃止にしたデバイスは、ダッシュボードまたは REST API を使用して IoT Platform から削除できます。
zh_tw: 當裝置解除任務時，即可使用儀表板或 REST API 從 IoT Platform 中移除。

source: Return Code Summary
de: Zusammenfassung der Rückkehrcodes
ja: 戻りコードの要約
zh_tw: 回覆碼摘要

source: There are several return codes which are sent in response to the actions listed above.
de: Als Antwort auf die nachfolgend aufgelisteten Aktionen werden mehrere Rückkehrcodes gesendet.
ja: 上記のアクションに対する応答として送信される戻りコードはいくつかあります。
zh_tw: 您可傳送多個回覆碼，以回應上述列出的動作。

source: 200: Operation succeeded
de: 200: Operation erfolgreich
ja: 200: 操作が成功しました
zh_tw: 200：作業成功

source: 202: Accepted (for initiating commands)
de: 202: Akzeptiert (für initiierte Befehle)
ja: 202: 受け入れられました (開始コマンドの場合)
zh_tw: 202：已接受（針對起始指令）

source: 204: Changed (for attribute updates)
de: 204: Geändert (für Attributaktualisierungen)
ja: 204: 変更されました (属性更新の場合)
zh_tw: 204：已變更（針對屬性更新）

source: 400: Bad request, for example, if a device is not in the appropriate state for this command
de: 400: Falsche Anforderung (Beispiel: Ein Gerät befindet sich nicht im entsprechenden Status für einen bestimmten Befehl)
ja: 400: 不適切なリクエストです (デバイスがこのコマンドに適した状態にない場合など)
zh_tw: 400：不當的要求，例如，如果裝置不在此指令適用的狀態中

source: 404: Attribute was not found, this code is also used if the operation was published to an invalid topic.
de: 404: Attribut wurde nicht gefunden; dieser Code wird auch dann verwendet, wenn die Operation in einem ungültigen Attribut publiziert wurde.
ja: 404: 属性が見つかりません。このコードは、操作が無効なトピックにパブリッシュされた場合にも使用されます。
zh_tw: 404：找不到屬性，如果作業發佈到無效的主題，也會使用此訊息碼。

source: 409: Resource could not be updated due to a conflict, for example, the resource is being updated by two simultaneous requests, so update could be retried later
de: 409: Ressource wegen Konflikt nicht aktualisiert (Beispiel: Wenn eine Ressource von zwei simultanen Anforderungen aktualisiert wird, kann eine Aktualisierung später erneut versucht werden)
ja: 409: (2 つのリクエストが同時にリソースを更新しようとしたなどの理由で) 競合のためにリソースを更新できませんでした。更新は後で再試行されます
zh_tw: 409：由於衝突而無法更新資源，例如，資源由兩個同時執行的要求更新，因此稍後可能會再重試更新

source: 500: Unexpected device error
de: 500: Nicht erwarteter Gerätefehler
ja: 500: 予期しないデバイス・エラー
zh_tw: 500：非預期的裝置錯誤

source: 501: Operation not implemented
de: 501: Operation nicht implementiert
ja: 501: 操作が実装されていません
zh_tw: 501：未實作作業

source: Manage Device
de: Gerät verwalten
ja: デバイスを管理
zh_tw: 管理裝置

source: A device uses this request to become a managed device. It should be the first device management request sent by the device after connecting to the IoT Platform. It would be usual for a device management agent to send this whenever it starts or restarts.
de: Diese Anforderung wird von einem Gerät verwendet, um zu einem verwalteten Gerät zu werden. Sie muss die erste Gerätemanagementanforderung sein, die von dem Gerät nach dem Verbinden mit IoT Platform gesendet wird. Für einen Gerätemanagementagenten ist es üblich, diese Anforderung bei jedem Start oder Neustart zu senden.
ja: デバイスはこのリクエストを使用して管理対象デバイスになります。これは、デバイスが IoT Platform に接続した後に送信する最初のデバイス管理リクエストでなければなりません。通常、デバイス管理エージェントは、開始または再始動するたびにこれを送信します。
zh_tw: 使用這個要求的裝置會變成受管理裝置。它應該是在連接至 IoT Platform 之後，由裝置傳送的第一個裝置管理要求。裝置管理代理程式每次啟動或重新啟動時，通常都會傳送這項要求。

source: Support for this operation is mandatory for any managed devices.
de: Die Unterstützung dieser Operation ist für alle verwalteten Geräte obligatorisch.
ja: この操作のサポートは、すべての管理対象デバイスにとって必須です。
zh_tw: 任何受管理裝置都必須支援此作業。

source: Topic
ja: トピック
zh_tw: 主題

source: A device publishes this request to the following topic:
de: Ein Gerät publiziert diese Anforderung an das folgende Topic:
ja: デバイスはこのリクエストを次のトピックにパブリッシュします。
zh_tw: 裝置會將此要求發佈至下列主題：

source: The server responds to this request on the following topic:
de: Der Server antwortet auf diese Antwort mit dem folgenden Topic:
ja: サーバーはこのリクエストを次のトピックで応答します。
zh_tw: 伺服器會在下列主題中回應此要求：

source: Message Format
de: Nachrichtenformat
ja: メッセージの形式
zh_tw: 訊息格式

source: For the request, the ``d`` field and all of its sub-fields are optional. The ``metadata`` and ``deviceInfo`` field values replace the corresponding attributes for the sending device if they are sent.
de: Für die Anforderung sind das Feld ``d`` und alle zugehörigen Unterfelder optional. Von den Feldern ``metadata`` und ``deviceInfo`` werden die entsprechenden Attribute für das sendende Gerät ersetzt, wenn sie gesendet werden.
ja: リクエストの ``d`` フィールドとそのすべてのサブフィールドはオプションです。``metadata`` および ``deviceInfo`` フィールド値を送信した場合は、それらの値が送信側デバイスの対応する属性を置き換えます。
zh_tw: 要求中的 ``d`` 欄位及其所有子欄位都是選用的。如果傳送 ``metadata`` 及 ``deviceInfo`` 欄位，則其欄位值會取代傳送裝置的對應屬性。

source: The optional ``lifetime`` field specifies the length of time in seconds within which the device must send another 'Manage device' request in order to avoid being reverted to an unmanaged device and marked as dormant. If omitted or if set to ``0``, the managed device will not become dormant. When set, the minimum supported setting is ``3600`` (1 hour).
de: Im optionalen Feld ``lifetime`` wird die Länge der Zeit in Sekunden angegeben, in der von dem Gerät eine weitere Anforderung des Typs 'Gerät verwalten' gesendet werden muss, um zu vermeiden, dass es in den Status eines nicht verwalteten Geräts versetzt und als 'ruhend' angesehen wird. Wenn in dieses Feld kein Wert oder der Wert ``0`` eingegeben wird, wechselt das verwaltete Gerät nicht in den ruhenden Zustand. Wenn ein Wert eingestellt wird, ist der unterstützte Mindestwert ``3600`` (1 Stunde).
ja: オプションの ``lifetime`` フィールドは、デバイスが次の「デバイスを管理」リクエストを送信しなければならない制限時間 (秒数) を指定します。これを過ぎるとデバイスは非管理対象デバイスに戻り、「休止」のマークが付けられます。これを省略するか ``0`` に設定すると、管理対象デバイスは休止状態になりません。これを設定する場合、サポートされる最小設定値は ``3600`` (1 時間) です。
zh_tw: 選用的 ``lifetime`` 欄位會指定一個時間長度（以秒為單位），裝置必須在此期間內傳送另一個「管理裝置」要求，以避免回復成未受管理裝置並標示為休眠。如果省略或設為 ``0``，受管理裝置就不會變成休眠。若已設定，則支援的最小設定值為 ``3600``（1 小時）。

source: Optional ``supports.deviceActions`` and ``supports.firmwareActions`` indicate the capabilities of the device management agent. If ``supports.deviceActions`` is set, the agent supports Reboot and Factory Reset actions. For a device that does not distinguish between rebooting and factory reset, it is acceptable to use the same behaviour for both actions. If ``supports.firmwareActions`` is set, the agent supports Firmware Download and Firmware Update actions.
de: In den optionalen Feldern ``supports.deviceActions`` und ``supports.firmwareActions`` werden die Leistungsmerkmale des Gerätemanagementagenten angegeben. Wenn für ``supports.deviceActions`` ein Wert eingestellt ist, werden vom Agenten die Aktionen 'Neu starten' und 'Factory-Reset' unterstützt. Für ein Gerät, das nicht zwischen einem Neustart und einem Factory-Reset unterscheidet, ist es zulässig, dasselbe Verhalten für beide Aktionen zu verwenden. Wenn für ``supports.firmwareActions`` ein Wert eingestellt ist, werden vom Agenten die Aktionen 'Firmware-Download' und 'Firmware-Update' unterstützt.
ja: オプションの ``supports.deviceActions`` および ``supports.firmwareActions`` はデバイス管理エージェントの機能を示します。``supports.deviceActions`` を設定した場合、エージェントはリブート・アクションと工場出荷時設定にリセット・アクションをサポートします。リブートと工場出荷時設定へのリセットが区別されないデバイスの場合は、両方のアクションに同じ動作を使用してかまいません。``supports.firmwareActions`` を設定した場合、エージェントはファームウェア・ダウンロード・アクションとファームウェア更新アクションをサポートします。
zh_tw: 選用的 ``supports.deviceActions`` 及 ``supports.firmwareActions`` 表示裝置管理代理程式的功能。如果已設定 ``supports.deviceActions``，代理程式支援「重新啟動」及「重設為原廠設定」動作。如果裝置不會區分重新啟動與重設為原廠設定，可接受這兩個動作使用相同的行為。如果已設定 ``supports.firmwareActions``，代理程式支援「韌體下載」及「韌體更新」動作。

source: Request Format:
de: Anforderungsformat:
ja: リクエストの形式:
zh_tw: 要求格式：

source: Response Format:
de: Antwortformat:
ja: レスポンスの形式:
zh_tw: 回應格式：

source: Response Codes
de: Antwortcodes
ja: 応答コード
zh_tw: 回應碼

source: 200: The operation was successful.
de: 200: Die Operation war erfolgreich.
ja: 200: 操作は正常に終了しました。
zh_tw: 200: 作業成功。

source: 400: The input message does not match the expected format, or one of the values is out of the valid range.
de: 400: Die Eingabenachricht stimmt nicht mit dem erwarteten Format überein, oder einer der Werte liegt außerhalb des gültigen Bereichs.
ja: 400: 入力メッセージが予期される形式に一致しないか、値の 1 つが有効範囲外です。
zh_tw: 400: 輸入訊息與預期的格式不符，或其中一個值不在有效的範圍內。

source: 404: The topic name is incorrect, or the device is not in the database.
de: 404: Der Abschnittsname ist falsch, oder das Gerät ist nicht in der Datenbank vorhanden.
ja: 404: トピック名が正しくないか、デバイスがデータベースにありません。
zh_tw: 404: 主題名稱不正確，或裝置不在資料庫中。

source: 409: A conflict occurred during the device database update. To resolve this, simplify the operation is necessary.
de: 409: Ein Konflikt trat bei der Gerätedatenbankaktualisierung auf. Um dies zu beheben, vereinfachen Sie die Operation.
ja: 409: デバイスのデータベース更新中に競合が発生しました。これを解決するには、操作を簡略化することが必要です。
zh_tw: 409: 裝置資料庫更新期間發生衝突。若要解決此問題，需要簡化作業。

source: Unmanage Device
de: Gerät nicht verwalten
ja: デバイスを管理解除
zh_tw: 取消管理裝置

source: A device uses this request when it no longer needs to be managed. The IoT Platform will no longer send new device management requests to this device and all device management requests from this device will be rejected other than a 'Manage device' request.
de: Von einem Gerät wird dies verwendet, wenn für es keine Verwaltung mehr erforderlich ist. IoT Platform sendet keine neuen Gerätemanagementanforderungen mehr an dieses Gerät und alle Gerätemanagementanforderungen von diesem Gerät bis auf die Anforderung 'Gerät verwalten' werden abgelehnt.
ja: デバイスは、管理される必要がなくなったときにこのリクエストを使用します。IoT Platform は、新しいデバイス管理リクエストをこのデバイスに送信しなくなり、このデバイスからのすべてのデバイス管理リクエスト (「デバイスを管理」リクエストを除く) が拒否されるようになります。
zh_tw: 當裝置不再需要管理時，可使用這個要求。IoT Platform 不會再傳送新的裝置管理要求給這個裝置，且除了「管理裝置」要求以外，來自這個裝置的所有裝置管理要求都會遭到拒絕。

source: Update Location
de: Position aktualisieren
ja: ロケーションの更新
zh_tw: 更新位置

source: Devices can change their location over time. The update of the location can happen in two ways:
de: Im Laufe der Zeit kann sich die Position von Geräten ändern. Die Aktualisierung der Position kann auf zwei Arten erfolgen:
ja: デバイスは時間の経過とともにロケーションが変わる場合があります。ロケーションの更新は、以下の 2 つの方法で行われます。
zh_tw: 裝置可能會隨著時間變更其位置。位置的更新可透過兩種方式來執行：

source: The device itself notifies the IoT Platform about the location update: The device retrieves its location from a GPS receiver and sends a device management message to the IoT Platform to update its location. The timestamp captures the time at which the location was retrieved from the GPS receiver. This means that the timestamp is valid, even if the transmission of the location message was delayed. In the event that the timestamp is omitted from the device management message sent, the current date and time on message receipt will be used when the device's location metadata is updated.
de: Das Gerät selbst informiert IoT Platform über die Aktualisierung der Position: Das Gerät ruft seine Position von einem GPS-Empfänger ab und sendet eine Gerätemanagementnachricht an IoT Platform, damit die zugehörige Position aktualisiert wird. Anhand einer Zeitmarke wird der Zeitpunkt erfasst, an dem die Position vom GPS-Empfänger abgerufen wurde. Dies bedeutet, dass die Zeitmarke gültig ist, auch wenn sich die Übertragung der Positionsnachricht verzögert hat. Falls die Zeitmarke in der gesendeten Gerätemanagementnachricht weggelassen wurde, werden Datum und Uhrzeit des Zeitpunkts des Nachrichtenempfangs verwendet, wenn die Positionsmetadaten des Geräts aktualisiert werden.
ja: デバイス自身がロケーションの更新を IoT Platform に通知します。デバイスが GPS レシーバーから自身のロケーションを取得して、ロケーションを更新するためのデバイス管理メッセージを IoT Platform に送信します。タイム・スタンプは、GPS レシーバーからロケーションが取得された時間をキャプチャーします。つまり、ロケーション・メッセージの伝送が遅れた場合でもタイム・スタンプは有効です。送信されたデバイス管理メッセージ内でタイム・スタンプが省略されている場合は、デバイスのロケーション・メタデータを更新するときに、メッセージを受信したときの現在日時が使用されます。
zh_tw: 由裝置本身通知 IoT Platform 其位置更新：裝置會從 GPS 接收端擷取其位置，再傳送裝置管理訊息給 IoT Platform 來更新其位置。時間戳記會擷取從 GPS 接收端擷取位置的時間。這表示時間戳記是有效的，即使傳輸位置訊息有點延遲。如果傳送的裝置管理訊息中省略時間戳記，則當裝置的位置 meta 資料更新時，會使用訊息回條上的現行日期和時間。

source: A user / app updates the location of a device using the Rest API: The IoT Platform REST API is used to set the location metadata of a static device. This can be done at the time that the device is registered, or later if required. It is optional whether to include a timestamp. If omitted, the current date and time will be set as the device’s location metadata.
de: Ein Benutzer bzw. eine App aktualisiert die Postion eines Geräts über die Rest-API: Die REST-API von IoT Platform wird verwendet, um die Positionsmetadaten eines statischen Geräts festzulegen. Dies kann zum Zeitpunkt der Geräteregistrierung erfolgen, bei Bedarf aber auch später. Das Einfügen einer Zeitmarke ist optional. Wenn sie weggelassen wird, werden das aktuelle Datum und die aktuelle Uhrzeit für die Einstellung der Positionsmetadaten des Geräts verwendet.
ja: ユーザーまたはアプリが Rest API を使用してデバイスのロケーションを更新します。IoT Platform の REST API を使用して、静的デバイスのロケーション・メタデータを設定します。デバイスの登録時、または必要に応じて後の時点でこれを行うことができます。タイム・スタンプを含めるかどうかはオプションです。省略した場合、現在の日時がデバイスのロケーション・メタデータとして設定されます。
zh_tw: 使用者/應用程式使用 REST API 更新裝置的位置：IoT Platform REST API 可用來設定靜態裝置的位置 meta 資料。這可以在登錄裝置時完成，或是之後需要時再完成。您可以選擇是否要併入時間戳記。如果省略，現行日期和時間會設為裝置的位置 meta 資料。

source: Location update triggered by device
de: Vom Gerät ausgelöste Positionsaktualisierung
ja: デバイスによってトリガーされるロケーションの更新
zh_tw: 裝置觸發的位置更新

source: Devices that can determine their location can choose to notify the IoT Platform device management server about location changes.
de: Bei Geräten, die Ihre Position bestimmen können, kann festgelegt werden, dass der Gerätemanagementserver von IoT Platform über Positionsänderungen informiert wird.
ja: ロケーションを判別できるデバイスは、ロケーションの変更を IoT Platform デバイス管理サーバーに通知することを選択できます。
zh_tw: 可判斷其位置的裝置可以選擇通知 IoT Platform 裝置管理伺服器有關其位置變更。

source: Location update triggered by user or app
de: Vom Benutzer oder von einer App ausgelöste Positionsaktualisierung
ja: ユーザーまたはアプリによってトリガーされるロケーションの更新
zh_tw: 使用者或應用程式觸發的位置更新

source: When a user or application updates the location of an active managed device the device retrieves an update message:
de: Wenn ein Benutzer oder eine Anwendung die Position eines aktiven verwalteten Geräts aktualisiert, ruft das Gerät eine Aktualisierungsnachricht ab:
ja: ユーザーまたはアプリケーションがアクティブな管理対象デバイスのロケーションを更新すると、そのデバイスは次のような更新メッセージを受け取ります。
zh_tw: 當使用者或應用程式更新作用中受管理裝置的位置時，裝置即會擷取更新訊息：

source: The server publishes this request to the following topic:
de: Der Server publiziert diese Anforderung an das folgende Topic:
ja: サーバーはこのリクエストを次のトピックにパブリッシュします。
zh_tw: 伺服器會將此要求發佈至下列主題：

source: The "measuredDateTime" is the date of location measurement. The "updatedDateTime" is the date of the update to the device information. For efficiency reasons, the IoT Platform may batch updates to location information so the updates may be slightly delayed. The "latitude" and "longitude" should be specified in decimal degrees using WGS84.
de: Der Wert für "measuredDateTime" ist das Datum der Positionsmessung. Der Wert für "updatedDateTime" gibt das Datum der Aktualisierung für die Geräteinformationen an. Aus Effizienzgründen können die Aktualisierungen der Positionsinformationen von IoT Platform im Stapelbetrieb ausgeführt werden, d. h. die Aktualisierungen werden möglicherweise etwas verzögert durchgeführt. Die Werte für "latitude" und "longitude" müssen in Dezimalgrad gemäß WGS84 angegeben werden.
ja: "measuredDateTime" はロケーション計測の日付です。"updatedDateTime" はデバイス情報の更新の日付です。IoT Platform は、効率化のためにロケーション情報の更新をバッチ処理することがあるため、更新はわずかに遅れる可能性があります。"latitude" (緯度) と "longitude" (経度) は、WGS84 を使用して 10 進表記の度数で指定する必要があります。
zh_tw: "measuredDateTime" 是位置測量的日期。"updatedDateTime" 是裝置資訊的更新日期。基於效率的考量，IoT Platform 可能會批次更新位置資訊，因此更新可能會稍微延遲。"latitude" 及 "longitude" 應該使用 WGS84 以十進位制指定。

source: Whenever location is updated, the values provided for latitude, longitude, elevation and uncertainty are considered as a single multi-value update. The latitude and longitude are mandatory and must both be provided with each update. Elevation and uncertainty are optional and can be omitted.
de: Wann immer die Position aktualisiert wird, werden die für Breitengrad, Längengrad, Höhe u.N. und Unbestimmtheit als einziges mehrwertiges Update betrachtet. Die Werte für Breitengrad und Längengrad sind obligatorisch und müssen bei jeder Aktualisierung angegeben werden. Erhebungen und Unbestimmtheiten sind optional und können weggelassen werden.
ja: ロケーションが更新される際は必ず、緯度、経度、高度、および不確実性の値が、複数値から成る 1 つの更新と見なされます。緯度と経度は必須であり、すべての更新においてこの両方は指定する必要があります。高度と不確実性はオプションであり、省略可能です。
zh_tw: 每當位置更新時，提供給緯度、經度、海拔高度及不確定性的值，都會被視為單一的多值更新。緯度與經度是必要項目，每次更新時兩者都必須提供。海拔高度及不確定性則是選用項目，可以省略。

source: If an optional value is provided on an update and then omitted on a later update, the earlier value is deleted by the later update. Each update is considered as a complete multi-value set.
de: Wenn ein optionaler Wert für eine Aktualisierung angegeben und bei einer späteren Aktualisierung weggelassen wird, wird der frühere Wert bei der späteren Aktualisierung gelöscht. Jede Aktualisierung wird als eine vollständige Einstellung mehrere Werte betrachtet.
ja: ある更新でオプションの値を提供し、その後の更新で省略した場合、最初の値はその後の更新によって削除されます。それぞれの更新は完全にそろった複数値セットと見なされます。
zh_tw: 如果在某次更新時提供了選用值，然後在之後的更新中省略這些值，則之前的值會被後面的更新刪除。每次更新都會被視為完整的多值設定。

source: Payload Format:
de: Nutzdatenformat:
ja: ペイロードの形式:
zh_tw: 內容格式：

source: Please note: there is no reqId as no response by device is required.
de: Bitte beachten Sie: Es ist keine Anforderungs-ID vorhanden, da keine Antwort des Geräts erforderlich ist.
ja: デバイスによる応答は必要ないため、reqId が存在しないことに注意してください。
zh_tw: 請注意：不會有 reqId，因為裝置不需要回應。

source: Update Device Attributes
de: Geräteattribute aktualisieren
ja: デバイス属性の更新
zh_tw: 更新裝置屬性
